/* automatically generated by rust-bindgen 0.58.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }

    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const __SEOF: u32 = 32;
pub const __SERR: u32 = 64;
pub const __SMBF: u32 = 128;
pub const __SAPP: u32 = 256;
pub const __SSTR: u32 = 512;
pub const __SOPT: u32 = 1024;
pub const __SNPT: u32 = 2048;
pub const __SOFF: u32 = 4096;
pub const __SORD: u32 = 8192;
pub const __SL64: u32 = 32768;
pub const __SNLK: u32 = 1;
pub const __SWID: u32 = 8192;
pub const _IOFBF: u32 = 0;
pub const _IOLBF: u32 = 1;
pub const _IONBF: u32 = 2;
pub const EOF: i32 = -1;
pub const BUFSIZ: u32 = 1024;
pub const FOPEN_MAX: u32 = 20;
pub const FILENAME_MAX: u32 = 1024;
pub const L_tmpnam: u32 = 1024;
pub const P_tmpdir: &'static [u8; 5usize] = b"/tmp\0";
pub const SEEK_SET: u32 = 0;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const TMP_MAX: u32 = 26;
pub const L_ctermid: u32 = 16;
pub const C2D_DEFAULT_MAX_OBJECTS: u32 = 4096;
pub type __int8_t = crate::os::raw::c_schar;
pub type __uint8_t = crate::os::raw::c_uchar;
pub type __int16_t = crate::os::raw::c_short;
pub type __uint16_t = crate::os::raw::c_ushort;
pub type __int32_t = crate::os::raw::c_int;
pub type __uint32_t = crate::os::raw::c_uint;
pub type __int64_t = crate::os::raw::c_longlong;
pub type __uint64_t = crate::os::raw::c_ulonglong;
pub type __int_least8_t = crate::os::raw::c_schar;
pub type __uint_least8_t = crate::os::raw::c_uchar;
pub type __int_least16_t = crate::os::raw::c_short;
pub type __uint_least16_t = crate::os::raw::c_ushort;
pub type __int_least32_t = crate::os::raw::c_int;
pub type __uint_least32_t = crate::os::raw::c_uint;
pub type __int_least64_t = crate::os::raw::c_longlong;
pub type __uint_least64_t = crate::os::raw::c_ulonglong;
pub type __intmax_t = crate::os::raw::c_longlong;
pub type __uintmax_t = crate::os::raw::c_ulonglong;
pub type __intptr_t = crate::os::raw::c_int;
pub type __uintptr_t = crate::os::raw::c_uint;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = crate::os::raw::c_schar;
pub type uint_fast8_t = crate::os::raw::c_uchar;
pub type int_fast16_t = crate::os::raw::c_short;
pub type uint_fast16_t = crate::os::raw::c_ushort;
pub type int_fast32_t = crate::os::raw::c_int;
pub type uint_fast32_t = crate::os::raw::c_uint;
pub type int_fast64_t = crate::os::raw::c_longlong;
pub type uint_fast64_t = crate::os::raw::c_ulonglong;
pub type size_t = crate::os::raw::c_uint;
pub type wchar_t = crate::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __max_align_ll: crate::os::raw::c_longlong,
    pub __max_align_ld: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        crate::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        crate::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<max_align_t>())).__max_align_ll as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ll)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<max_align_t>())).__max_align_ld as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ld)
        )
    );
}
pub type u8_ = u8;
pub type u16_ = u16;
pub type u32_ = u32;
pub type u64_ = u64;
pub type s8 = i8;
pub type s16 = i16;
pub type s32 = i32;
pub type s64 = i64;
pub type vu8 = u8_;
pub type vu16 = u16_;
pub type vu32 = u32_;
pub type vu64 = u64_;
pub type vs8 = s8;
pub type vs16 = s16;
pub type vs32 = s32;
pub type vs64 = s64;
pub type Handle = u32_;
pub type Result = s32;
pub type ThreadFunc =
    crate::option::Option<unsafe extern "C" fn(arg1: *mut crate::os::raw::c_void)>;
pub type voidfn = crate::option::Option<unsafe extern "C" fn()>;
#[doc = " Structure representing CPU registers"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CpuRegisters {
    #[doc = "< r0-r12."]
    pub r: [u32_; 13usize],
    #[doc = "< sp."]
    pub sp: u32_,
    #[doc = "< lr."]
    pub lr: u32_,
    #[doc = "< pc. May need to be adjusted."]
    pub pc: u32_,
    #[doc = "< cpsr."]
    pub cpsr: u32_,
}
#[test]
fn bindgen_test_layout_CpuRegisters() {
    assert_eq!(
        crate::mem::size_of::<CpuRegisters>(),
        68usize,
        concat!("Size of: ", stringify!(CpuRegisters))
    );
    assert_eq!(
        crate::mem::align_of::<CpuRegisters>(),
        4usize,
        concat!("Alignment of ", stringify!(CpuRegisters))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CpuRegisters>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CpuRegisters),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CpuRegisters>())).sp as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(CpuRegisters),
            "::",
            stringify!(sp)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CpuRegisters>())).lr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CpuRegisters),
            "::",
            stringify!(lr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CpuRegisters>())).pc as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(CpuRegisters),
            "::",
            stringify!(pc)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CpuRegisters>())).cpsr as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CpuRegisters),
            "::",
            stringify!(cpsr)
        )
    );
}
#[doc = " Structure representing FPU registers"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FpuRegisters {
    pub __bindgen_anon_1: FpuRegisters__bindgen_ty_1,
    #[doc = "< fpscr."]
    pub fpscr: u32_,
    #[doc = "< fpexc."]
    pub fpexc: u32_,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union FpuRegisters__bindgen_ty_1 {
    pub __bindgen_anon_1: FpuRegisters__bindgen_ty_1__bindgen_ty_1,
    #[doc = "< s0-s31."]
    pub s: [f32; 32usize],
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct FpuRegisters__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< d0-d15."]
    pub d: [f64; 16usize],
}
#[test]
fn bindgen_test_layout_FpuRegisters__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        crate::mem::size_of::<FpuRegisters__bindgen_ty_1__bindgen_ty_1>(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(FpuRegisters__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        crate::mem::align_of::<FpuRegisters__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(FpuRegisters__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<FpuRegisters__bindgen_ty_1__bindgen_ty_1>())).d as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FpuRegisters__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(d)
        )
    );
}
#[test]
fn bindgen_test_layout_FpuRegisters__bindgen_ty_1() {
    assert_eq!(
        crate::mem::size_of::<FpuRegisters__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(FpuRegisters__bindgen_ty_1))
    );
    assert_eq!(
        crate::mem::align_of::<FpuRegisters__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(FpuRegisters__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<FpuRegisters__bindgen_ty_1>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FpuRegisters__bindgen_ty_1),
            "::",
            stringify!(s)
        )
    );
}
#[test]
fn bindgen_test_layout_FpuRegisters() {
    assert_eq!(
        crate::mem::size_of::<FpuRegisters>(),
        136usize,
        concat!("Size of: ", stringify!(FpuRegisters))
    );
    assert_eq!(
        crate::mem::align_of::<FpuRegisters>(),
        4usize,
        concat!("Alignment of ", stringify!(FpuRegisters))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<FpuRegisters>())).fpscr as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(FpuRegisters),
            "::",
            stringify!(fpscr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<FpuRegisters>())).fpexc as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(FpuRegisters),
            "::",
            stringify!(fpexc)
        )
    );
}
pub const RL_SUCCESS: crate::os::raw::c_uint = 0;
pub const RL_INFO: crate::os::raw::c_uint = 1;
pub const RL_FATAL: crate::os::raw::c_uint = 31;
pub const RL_RESET: crate::os::raw::c_uint = 30;
pub const RL_REINITIALIZE: crate::os::raw::c_uint = 29;
pub const RL_USAGE: crate::os::raw::c_uint = 28;
pub const RL_PERMANENT: crate::os::raw::c_uint = 27;
pub const RL_TEMPORARY: crate::os::raw::c_uint = 26;
pub const RL_STATUS: crate::os::raw::c_uint = 25;
#[doc = " Result code level values."]
pub type _bindgen_ty_1 = crate::os::raw::c_uint;
pub const RS_SUCCESS: crate::os::raw::c_uint = 0;
pub const RS_NOP: crate::os::raw::c_uint = 1;
pub const RS_WOULDBLOCK: crate::os::raw::c_uint = 2;
pub const RS_OUTOFRESOURCE: crate::os::raw::c_uint = 3;
pub const RS_NOTFOUND: crate::os::raw::c_uint = 4;
pub const RS_INVALIDSTATE: crate::os::raw::c_uint = 5;
pub const RS_NOTSUPPORTED: crate::os::raw::c_uint = 6;
pub const RS_INVALIDARG: crate::os::raw::c_uint = 7;
pub const RS_WRONGARG: crate::os::raw::c_uint = 8;
pub const RS_CANCELED: crate::os::raw::c_uint = 9;
pub const RS_STATUSCHANGED: crate::os::raw::c_uint = 10;
pub const RS_INTERNAL: crate::os::raw::c_uint = 11;
pub const RS_INVALIDRESVAL: crate::os::raw::c_uint = 63;
#[doc = " Result code summary values."]
pub type _bindgen_ty_2 = crate::os::raw::c_uint;
pub const RM_COMMON: crate::os::raw::c_uint = 0;
pub const RM_KERNEL: crate::os::raw::c_uint = 1;
pub const RM_UTIL: crate::os::raw::c_uint = 2;
pub const RM_FILE_SERVER: crate::os::raw::c_uint = 3;
pub const RM_LOADER_SERVER: crate::os::raw::c_uint = 4;
pub const RM_TCB: crate::os::raw::c_uint = 5;
pub const RM_OS: crate::os::raw::c_uint = 6;
pub const RM_DBG: crate::os::raw::c_uint = 7;
pub const RM_DMNT: crate::os::raw::c_uint = 8;
pub const RM_PDN: crate::os::raw::c_uint = 9;
pub const RM_GSP: crate::os::raw::c_uint = 10;
pub const RM_I2C: crate::os::raw::c_uint = 11;
pub const RM_GPIO: crate::os::raw::c_uint = 12;
pub const RM_DD: crate::os::raw::c_uint = 13;
pub const RM_CODEC: crate::os::raw::c_uint = 14;
pub const RM_SPI: crate::os::raw::c_uint = 15;
pub const RM_PXI: crate::os::raw::c_uint = 16;
pub const RM_FS: crate::os::raw::c_uint = 17;
pub const RM_DI: crate::os::raw::c_uint = 18;
pub const RM_HID: crate::os::raw::c_uint = 19;
pub const RM_CAM: crate::os::raw::c_uint = 20;
pub const RM_PI: crate::os::raw::c_uint = 21;
pub const RM_PM: crate::os::raw::c_uint = 22;
pub const RM_PM_LOW: crate::os::raw::c_uint = 23;
pub const RM_FSI: crate::os::raw::c_uint = 24;
pub const RM_SRV: crate::os::raw::c_uint = 25;
pub const RM_NDM: crate::os::raw::c_uint = 26;
pub const RM_NWM: crate::os::raw::c_uint = 27;
pub const RM_SOC: crate::os::raw::c_uint = 28;
pub const RM_LDR: crate::os::raw::c_uint = 29;
pub const RM_ACC: crate::os::raw::c_uint = 30;
pub const RM_ROMFS: crate::os::raw::c_uint = 31;
pub const RM_AM: crate::os::raw::c_uint = 32;
pub const RM_HIO: crate::os::raw::c_uint = 33;
pub const RM_UPDATER: crate::os::raw::c_uint = 34;
pub const RM_MIC: crate::os::raw::c_uint = 35;
pub const RM_FND: crate::os::raw::c_uint = 36;
pub const RM_MP: crate::os::raw::c_uint = 37;
pub const RM_MPWL: crate::os::raw::c_uint = 38;
pub const RM_AC: crate::os::raw::c_uint = 39;
pub const RM_HTTP: crate::os::raw::c_uint = 40;
pub const RM_DSP: crate::os::raw::c_uint = 41;
pub const RM_SND: crate::os::raw::c_uint = 42;
pub const RM_DLP: crate::os::raw::c_uint = 43;
pub const RM_HIO_LOW: crate::os::raw::c_uint = 44;
pub const RM_CSND: crate::os::raw::c_uint = 45;
pub const RM_SSL: crate::os::raw::c_uint = 46;
pub const RM_AM_LOW: crate::os::raw::c_uint = 47;
pub const RM_NEX: crate::os::raw::c_uint = 48;
pub const RM_FRIENDS: crate::os::raw::c_uint = 49;
pub const RM_RDT: crate::os::raw::c_uint = 50;
pub const RM_APPLET: crate::os::raw::c_uint = 51;
pub const RM_NIM: crate::os::raw::c_uint = 52;
pub const RM_PTM: crate::os::raw::c_uint = 53;
pub const RM_MIDI: crate::os::raw::c_uint = 54;
pub const RM_MC: crate::os::raw::c_uint = 55;
pub const RM_SWC: crate::os::raw::c_uint = 56;
pub const RM_FATFS: crate::os::raw::c_uint = 57;
pub const RM_NGC: crate::os::raw::c_uint = 58;
pub const RM_CARD: crate::os::raw::c_uint = 59;
pub const RM_CARDNOR: crate::os::raw::c_uint = 60;
pub const RM_SDMC: crate::os::raw::c_uint = 61;
pub const RM_BOSS: crate::os::raw::c_uint = 62;
pub const RM_DBM: crate::os::raw::c_uint = 63;
pub const RM_CONFIG: crate::os::raw::c_uint = 64;
pub const RM_PS: crate::os::raw::c_uint = 65;
pub const RM_CEC: crate::os::raw::c_uint = 66;
pub const RM_IR: crate::os::raw::c_uint = 67;
pub const RM_UDS: crate::os::raw::c_uint = 68;
pub const RM_PL: crate::os::raw::c_uint = 69;
pub const RM_CUP: crate::os::raw::c_uint = 70;
pub const RM_GYROSCOPE: crate::os::raw::c_uint = 71;
pub const RM_MCU: crate::os::raw::c_uint = 72;
pub const RM_NS: crate::os::raw::c_uint = 73;
pub const RM_NEWS: crate::os::raw::c_uint = 74;
pub const RM_RO: crate::os::raw::c_uint = 75;
pub const RM_GD: crate::os::raw::c_uint = 76;
pub const RM_CARD_SPI: crate::os::raw::c_uint = 77;
pub const RM_EC: crate::os::raw::c_uint = 78;
pub const RM_WEB_BROWSER: crate::os::raw::c_uint = 79;
pub const RM_TEST: crate::os::raw::c_uint = 80;
pub const RM_ENC: crate::os::raw::c_uint = 81;
pub const RM_PIA: crate::os::raw::c_uint = 82;
pub const RM_ACT: crate::os::raw::c_uint = 83;
pub const RM_VCTL: crate::os::raw::c_uint = 84;
pub const RM_OLV: crate::os::raw::c_uint = 85;
pub const RM_NEIA: crate::os::raw::c_uint = 86;
pub const RM_NPNS: crate::os::raw::c_uint = 87;
pub const RM_AVD: crate::os::raw::c_uint = 90;
pub const RM_L2B: crate::os::raw::c_uint = 91;
pub const RM_MVD: crate::os::raw::c_uint = 92;
pub const RM_NFC: crate::os::raw::c_uint = 93;
pub const RM_UART: crate::os::raw::c_uint = 94;
pub const RM_SPM: crate::os::raw::c_uint = 95;
pub const RM_QTM: crate::os::raw::c_uint = 96;
pub const RM_NFP: crate::os::raw::c_uint = 97;
pub const RM_APPLICATION: crate::os::raw::c_uint = 254;
pub const RM_INVALIDRESVAL: crate::os::raw::c_uint = 255;
#[doc = " Result code module values."]
pub type _bindgen_ty_3 = crate::os::raw::c_uint;
pub const RD_SUCCESS: crate::os::raw::c_uint = 0;
pub const RD_INVALID_RESULT_VALUE: crate::os::raw::c_uint = 1023;
pub const RD_TIMEOUT: crate::os::raw::c_uint = 1022;
pub const RD_OUT_OF_RANGE: crate::os::raw::c_uint = 1021;
pub const RD_ALREADY_EXISTS: crate::os::raw::c_uint = 1020;
pub const RD_CANCEL_REQUESTED: crate::os::raw::c_uint = 1019;
pub const RD_NOT_FOUND: crate::os::raw::c_uint = 1018;
pub const RD_ALREADY_INITIALIZED: crate::os::raw::c_uint = 1017;
pub const RD_NOT_INITIALIZED: crate::os::raw::c_uint = 1016;
pub const RD_INVALID_HANDLE: crate::os::raw::c_uint = 1015;
pub const RD_INVALID_POINTER: crate::os::raw::c_uint = 1014;
pub const RD_INVALID_ADDRESS: crate::os::raw::c_uint = 1013;
pub const RD_NOT_IMPLEMENTED: crate::os::raw::c_uint = 1012;
pub const RD_OUT_OF_MEMORY: crate::os::raw::c_uint = 1011;
pub const RD_MISALIGNED_SIZE: crate::os::raw::c_uint = 1010;
pub const RD_MISALIGNED_ADDRESS: crate::os::raw::c_uint = 1009;
pub const RD_BUSY: crate::os::raw::c_uint = 1008;
pub const RD_NO_DATA: crate::os::raw::c_uint = 1007;
pub const RD_INVALID_COMBINATION: crate::os::raw::c_uint = 1006;
pub const RD_INVALID_ENUM_VALUE: crate::os::raw::c_uint = 1005;
pub const RD_INVALID_SIZE: crate::os::raw::c_uint = 1004;
pub const RD_ALREADY_DONE: crate::os::raw::c_uint = 1003;
pub const RD_NOT_AUTHORIZED: crate::os::raw::c_uint = 1002;
pub const RD_TOO_LARGE: crate::os::raw::c_uint = 1001;
pub const RD_INVALID_SELECTION: crate::os::raw::c_uint = 1000;
#[doc = " Result code generic description values."]
pub type _bindgen_ty_4 = crate::os::raw::c_uint;
#[doc = "< Readable"]
pub const IPC_BufferRights_IPC_BUFFER_R: IPC_BufferRights = 2;
#[doc = "< Writable"]
pub const IPC_BufferRights_IPC_BUFFER_W: IPC_BufferRights = 4;
#[doc = "< Readable and Writable"]
pub const IPC_BufferRights_IPC_BUFFER_RW: IPC_BufferRights = 6;
#[doc = " IPC buffer access rights."]
pub type IPC_BufferRights = crate::os::raw::c_uint;
#[doc = "< Memory un-mapping"]
pub const MemOp_MEMOP_FREE: MemOp = 1;
#[doc = "< Reserve memory"]
pub const MemOp_MEMOP_RESERVE: MemOp = 2;
#[doc = "< Memory mapping"]
pub const MemOp_MEMOP_ALLOC: MemOp = 3;
#[doc = "< Mirror mapping"]
pub const MemOp_MEMOP_MAP: MemOp = 4;
#[doc = "< Mirror unmapping"]
pub const MemOp_MEMOP_UNMAP: MemOp = 5;
#[doc = "< Change protection"]
pub const MemOp_MEMOP_PROT: MemOp = 6;
#[doc = "< APPLICATION memory region."]
pub const MemOp_MEMOP_REGION_APP: MemOp = 256;
#[doc = "< SYSTEM memory region."]
pub const MemOp_MEMOP_REGION_SYSTEM: MemOp = 512;
#[doc = "< BASE memory region."]
pub const MemOp_MEMOP_REGION_BASE: MemOp = 768;
#[doc = "< Operation bitmask."]
pub const MemOp_MEMOP_OP_MASK: MemOp = 255;
#[doc = "< Region bitmask."]
pub const MemOp_MEMOP_REGION_MASK: MemOp = 3840;
#[doc = "< Flag for linear memory operations"]
pub const MemOp_MEMOP_LINEAR_FLAG: MemOp = 65536;
#[doc = "< Allocates linear memory."]
pub const MemOp_MEMOP_ALLOC_LINEAR: MemOp = 65539;
#[doc = " @brief @ref svcControlMemory operation flags"]
#[doc = ""]
#[doc = " The lowest 8 bits are the operation"]
pub type MemOp = crate::os::raw::c_uint;
#[doc = "< Free memory"]
pub const MemState_MEMSTATE_FREE: MemState = 0;
#[doc = "< Reserved memory"]
pub const MemState_MEMSTATE_RESERVED: MemState = 1;
#[doc = "< I/O memory"]
pub const MemState_MEMSTATE_IO: MemState = 2;
#[doc = "< Static memory"]
pub const MemState_MEMSTATE_STATIC: MemState = 3;
#[doc = "< Code memory"]
pub const MemState_MEMSTATE_CODE: MemState = 4;
#[doc = "< Private memory"]
pub const MemState_MEMSTATE_PRIVATE: MemState = 5;
#[doc = "< Shared memory"]
pub const MemState_MEMSTATE_SHARED: MemState = 6;
#[doc = "< Continuous memory"]
pub const MemState_MEMSTATE_CONTINUOUS: MemState = 7;
#[doc = "< Aliased memory"]
pub const MemState_MEMSTATE_ALIASED: MemState = 8;
#[doc = "< Alias memory"]
pub const MemState_MEMSTATE_ALIAS: MemState = 9;
#[doc = "< Aliased code memory"]
pub const MemState_MEMSTATE_ALIASCODE: MemState = 10;
#[doc = "< Locked memory"]
pub const MemState_MEMSTATE_LOCKED: MemState = 11;
#[doc = " The state of a memory block."]
pub type MemState = crate::os::raw::c_uint;
#[doc = "< Readable"]
pub const MemPerm_MEMPERM_READ: MemPerm = 1;
#[doc = "< Writable"]
pub const MemPerm_MEMPERM_WRITE: MemPerm = 2;
#[doc = "< Executable"]
pub const MemPerm_MEMPERM_EXECUTE: MemPerm = 4;
#[doc = "< Readable and writable"]
pub const MemPerm_MEMPERM_READWRITE: MemPerm = 3;
#[doc = "< Readable and executable"]
pub const MemPerm_MEMPERM_READEXECUTE: MemPerm = 5;
#[doc = "< Don't care"]
pub const MemPerm_MEMPERM_DONTCARE: MemPerm = 268435456;
#[doc = " Memory permission flags"]
pub type MemPerm = crate::os::raw::c_uint;
#[doc = "< All regions."]
pub const MemRegion_MEMREGION_ALL: MemRegion = 0;
#[doc = "< APPLICATION memory."]
pub const MemRegion_MEMREGION_APPLICATION: MemRegion = 1;
#[doc = "< SYSTEM memory."]
pub const MemRegion_MEMREGION_SYSTEM: MemRegion = 2;
#[doc = "< BASE memory."]
pub const MemRegion_MEMREGION_BASE: MemRegion = 3;
#[doc = " Memory regions."]
pub type MemRegion = crate::os::raw::c_uint;
#[doc = " Memory information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MemInfo {
    #[doc = "< Base address."]
    pub base_addr: u32_,
    #[doc = "< Size."]
    pub size: u32_,
    #[doc = "< Memory permissions. See @ref MemPerm"]
    pub perm: u32_,
    #[doc = "< Memory state. See @ref MemState"]
    pub state: u32_,
}
#[test]
fn bindgen_test_layout_MemInfo() {
    assert_eq!(
        crate::mem::size_of::<MemInfo>(),
        16usize,
        concat!("Size of: ", stringify!(MemInfo))
    );
    assert_eq!(
        crate::mem::align_of::<MemInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(MemInfo))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<MemInfo>())).base_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MemInfo),
            "::",
            stringify!(base_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<MemInfo>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MemInfo),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<MemInfo>())).perm as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MemInfo),
            "::",
            stringify!(perm)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<MemInfo>())).state as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MemInfo),
            "::",
            stringify!(state)
        )
    );
}
#[doc = " Memory page information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PageInfo {
    #[doc = "< Page flags."]
    pub flags: u32_,
}
#[test]
fn bindgen_test_layout_PageInfo() {
    assert_eq!(
        crate::mem::size_of::<PageInfo>(),
        4usize,
        concat!("Size of: ", stringify!(PageInfo))
    );
    assert_eq!(
        crate::mem::align_of::<PageInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(PageInfo))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PageInfo>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PageInfo),
            "::",
            stringify!(flags)
        )
    );
}
#[doc = "< Signal #value threads for wake-up."]
pub const ArbitrationType_ARBITRATION_SIGNAL: ArbitrationType = 0;
#[doc = "< If the memory at the address is strictly lower than #value, then wait for signal."]
pub const ArbitrationType_ARBITRATION_WAIT_IF_LESS_THAN: ArbitrationType = 1;
#[doc = "< If the memory at the address is strictly lower than #value, then decrement it and wait for signal."]
pub const ArbitrationType_ARBITRATION_DECREMENT_AND_WAIT_IF_LESS_THAN: ArbitrationType = 2;
#[doc = "< If the memory at the address is strictly lower than #value, then wait for signal or timeout."]
pub const ArbitrationType_ARBITRATION_WAIT_IF_LESS_THAN_TIMEOUT: ArbitrationType = 3;
#[doc = "< If the memory at the address is strictly lower than #value, then decrement it and wait for signal or timeout."]
pub const ArbitrationType_ARBITRATION_DECREMENT_AND_WAIT_IF_LESS_THAN_TIMEOUT: ArbitrationType = 4;
#[doc = " Arbitration modes."]
pub type ArbitrationType = crate::os::raw::c_uint;
#[doc = "< When the primitive is signaled, it will wake up exactly one thread and will clear itself automatically."]
pub const ResetType_RESET_ONESHOT: ResetType = 0;
#[doc = "< When the primitive is signaled, it will wake up all threads and it won't clear itself automatically."]
pub const ResetType_RESET_STICKY: ResetType = 1;
#[doc = "< Only meaningful for timers: same as ONESHOT but it will periodically signal the timer instead of just once."]
pub const ResetType_RESET_PULSE: ResetType = 2;
#[doc = " Reset types (for use with events and timers)"]
pub type ResetType = crate::os::raw::c_uint;
#[doc = "< Unknown."]
pub const ThreadInfoType_THREADINFO_TYPE_UNKNOWN: ThreadInfoType = 0;
#[doc = " Types of thread info."]
pub type ThreadInfoType = crate::os::raw::c_uint;
#[doc = "< Thread priority"]
pub const ResourceLimitType_RESLIMIT_PRIORITY: ResourceLimitType = 0;
#[doc = "< Quantity of allocatable memory"]
pub const ResourceLimitType_RESLIMIT_COMMIT: ResourceLimitType = 1;
#[doc = "< Number of threads"]
pub const ResourceLimitType_RESLIMIT_THREAD: ResourceLimitType = 2;
#[doc = "< Number of events"]
pub const ResourceLimitType_RESLIMIT_EVENT: ResourceLimitType = 3;
#[doc = "< Number of mutexes"]
pub const ResourceLimitType_RESLIMIT_MUTEX: ResourceLimitType = 4;
#[doc = "< Number of semaphores"]
pub const ResourceLimitType_RESLIMIT_SEMAPHORE: ResourceLimitType = 5;
#[doc = "< Number of timers"]
pub const ResourceLimitType_RESLIMIT_TIMER: ResourceLimitType = 6;
#[doc = "< Number of shared memory objects, see @ref svcCreateMemoryBlock"]
pub const ResourceLimitType_RESLIMIT_SHAREDMEMORY: ResourceLimitType = 7;
#[doc = "< Number of address arbiters"]
pub const ResourceLimitType_RESLIMIT_ADDRESSARBITER: ResourceLimitType = 8;
#[doc = "< CPU time. Value expressed in percentage regular until it reaches 90."]
pub const ResourceLimitType_RESLIMIT_CPUTIME: ResourceLimitType = 9;
#[doc = "< Forces enum size to be 32 bits"]
pub const ResourceLimitType_RESLIMIT_BIT: ResourceLimitType = 2147483648;
#[doc = " Types of resource limit"]
pub type ResourceLimitType = crate::os::raw::c_uint;
#[doc = "< DMA transfer involving at least one device is starting and has not reached DMAWFP yet."]
pub const DmaState_DMASTATE_STARTING: DmaState = 0;
#[doc = "< DMA channel is in WFP state for the destination device (2nd loop iteration onwards)."]
pub const DmaState_DMASTATE_WFP_DST: DmaState = 1;
#[doc = "< DMA channel is in WFP state for the source device (2nd loop iteration onwards)."]
pub const DmaState_DMASTATE_WFP_SRC: DmaState = 2;
#[doc = "< DMA transfer is running."]
pub const DmaState_DMASTATE_RUNNING: DmaState = 3;
#[doc = "< DMA transfer is done."]
pub const DmaState_DMASTATE_DONE: DmaState = 4;
#[doc = " DMA transfer state."]
pub type DmaState = crate::os::raw::c_uint;
#[doc = "< DMA source is a device/peripheral. Address will not auto-increment."]
pub const DMACFG_SRC_IS_DEVICE: crate::os::raw::c_uint = 1;
#[doc = "< DMA destination is a device/peripheral. Address will not auto-increment."]
pub const DMACFG_DST_IS_DEVICE: crate::os::raw::c_uint = 2;
#[doc = "< Make \\ref svcStartInterProcessDma wait for the channel to be unlocked."]
pub const DMACFG_WAIT_AVAILABLE: crate::os::raw::c_uint = 4;
#[doc = "< Keep the channel locked after the transfer. Required for \\ref svcRestartDma."]
pub const DMACFG_KEEP_LOCKED: crate::os::raw::c_uint = 8;
#[doc = "< Use the provided source device configuration even if the DMA source is not a device."]
pub const DMACFG_USE_SRC_CONFIG: crate::os::raw::c_uint = 64;
#[doc = "< Use the provided destination device configuration even if the DMA destination is not a device."]
pub const DMACFG_USE_DST_CONFIG: crate::os::raw::c_uint = 128;
#[doc = " Configuration flags for \\ref DmaConfig."]
pub type _bindgen_ty_5 = crate::os::raw::c_uint;
#[doc = "< Unlock the channel after transfer."]
pub const DMARST_UNLOCK: crate::os::raw::c_uint = 1;
#[doc = "< Replace DMAFLUSHP instructions by NOP (they may not be regenerated even if this flag is not set)."]
pub const DMARST_RESUME_DEVICE: crate::os::raw::c_uint = 2;
#[doc = " Configuration flags for \\ref svcRestartDma."]
pub type _bindgen_ty_6 = crate::os::raw::c_uint;
#[doc = " @brief Device configuration structure, part of \\ref DmaConfig."]
#[doc = " @note"]
#[doc = " - if (and only if) src/dst is a device, then src/dst won't be auto-incremented."]
#[doc = " - the kernel uses DMAMOV instead of DMAADNH, when having to decrement (possibly working around an erratum);"]
#[doc = " this forces all loops to be unrolled -- you need to keep that in mind when using negative increments, as the kernel"]
#[doc = " uses a limit of 100 DMA instruction bytes per channel."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DmaDeviceConfig {
    #[doc = "< DMA device ID."]
    pub deviceId: s8,
    #[doc = "< Mask of allowed access alignments (8, 4, 2, 1)."]
    pub allowedAlignments: s8,
    #[doc = "< Number of bytes transferred in a burst loop. Can be 0 (in which case the max allowed alignment is used as unit)."]
    pub burstSize: s16,
    #[doc = "< Number of bytes transferred in a \"transfer\" loop (made of burst loops)."]
    pub transferSize: s16,
    #[doc = "< Burst loop stride, can be <= 0."]
    pub burstStride: s16,
    #[doc = "< \"Transfer\" loop stride, can be <= 0."]
    pub transferStride: s16,
}
#[test]
fn bindgen_test_layout_DmaDeviceConfig() {
    assert_eq!(
        crate::mem::size_of::<DmaDeviceConfig>(),
        10usize,
        concat!("Size of: ", stringify!(DmaDeviceConfig))
    );
    assert_eq!(
        crate::mem::align_of::<DmaDeviceConfig>(),
        2usize,
        concat!("Alignment of ", stringify!(DmaDeviceConfig))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaDeviceConfig>())).deviceId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaDeviceConfig),
            "::",
            stringify!(deviceId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DmaDeviceConfig>())).allowedAlignments as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaDeviceConfig),
            "::",
            stringify!(allowedAlignments)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaDeviceConfig>())).burstSize as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaDeviceConfig),
            "::",
            stringify!(burstSize)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaDeviceConfig>())).transferSize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaDeviceConfig),
            "::",
            stringify!(transferSize)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaDeviceConfig>())).burstStride as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaDeviceConfig),
            "::",
            stringify!(burstStride)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaDeviceConfig>())).transferStride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaDeviceConfig),
            "::",
            stringify!(transferStride)
        )
    );
}
#[doc = " Configuration stucture for \\ref svcStartInterProcessDma."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DmaConfig {
    #[doc = "< Channel ID (Arm11: 0-7, Arm9: 0-1). Use -1 to auto-assign to a free channel (Arm11: 3-7, Arm9: 0-1)."]
    pub channelId: s8,
    #[doc = "< Endian swap size (can be 0)."]
    pub endianSwapSize: s8,
    #[doc = "< DMACFG_* flags."]
    pub flags: u8_,
    pub _padding: u8_,
    #[doc = "< Source device configuration, read if \\ref DMACFG_SRC_IS_DEVICE and/or \\ref DMACFG_USE_SRC_CONFIG are set."]
    pub srcCfg: DmaDeviceConfig,
    #[doc = "< Destination device configuration, read if \\ref DMACFG_SRC_IS_DEVICE and/or \\ref DMACFG_USE_SRC_CONFIG are set."]
    pub dstCfg: DmaDeviceConfig,
}
#[test]
fn bindgen_test_layout_DmaConfig() {
    assert_eq!(
        crate::mem::size_of::<DmaConfig>(),
        24usize,
        concat!("Size of: ", stringify!(DmaConfig))
    );
    assert_eq!(
        crate::mem::align_of::<DmaConfig>(),
        2usize,
        concat!("Alignment of ", stringify!(DmaConfig))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaConfig>())).channelId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaConfig),
            "::",
            stringify!(channelId)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaConfig>())).endianSwapSize as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaConfig),
            "::",
            stringify!(endianSwapSize)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaConfig>())).flags as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaConfig),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaConfig>()))._padding as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaConfig),
            "::",
            stringify!(_padding)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaConfig>())).srcCfg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaConfig),
            "::",
            stringify!(srcCfg)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DmaConfig>())).dstCfg as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(DmaConfig),
            "::",
            stringify!(dstCfg)
        )
    );
}
#[doc = "< Enable and lock perfmon. functionality."]
pub const PerfCounterOperation_PERFCOUNTEROP_ENABLE: PerfCounterOperation = 0;
#[doc = "< Disable and forcibly unlock perfmon. functionality."]
pub const PerfCounterOperation_PERFCOUNTEROP_DISABLE: PerfCounterOperation = 1;
#[doc = "< Get the value of a counter register."]
pub const PerfCounterOperation_PERFCOUNTEROP_GET_VALUE: PerfCounterOperation = 2;
#[doc = "< Set the value of a counter register."]
pub const PerfCounterOperation_PERFCOUNTEROP_SET_VALUE: PerfCounterOperation = 3;
#[doc = "< Get the overflow flags for all CP15 and SCU counters."]
pub const PerfCounterOperation_PERFCOUNTEROP_GET_OVERFLOW_FLAGS: PerfCounterOperation = 4;
#[doc = "< Reset the value and/or overflow flags of selected counters."]
pub const PerfCounterOperation_PERFCOUNTEROP_RESET: PerfCounterOperation = 5;
#[doc = "< Get the event ID associated to a particular counter."]
pub const PerfCounterOperation_PERFCOUNTEROP_GET_EVENT: PerfCounterOperation = 6;
#[doc = "< Set the event ID associated to a paritcular counter."]
pub const PerfCounterOperation_PERFCOUNTEROP_SET_EVENT: PerfCounterOperation = 7;
#[doc = "< (Dis)allow the kernel to track counter overflows and to use 64-bit counter values."]
pub const PerfCounterOperation_PERFCOUNTEROP_SET_VIRTUAL_COUNTER_ENABLED: PerfCounterOperation = 8;
#[doc = " Operations for \\ref svcControlPerformanceCounter"]
pub type PerfCounterOperation = crate::os::raw::c_uint;
pub const PerfCounterRegister_PERFCOUNTERREG_CORE_BASE: PerfCounterRegister = 0;
#[doc = "< CP15 PMN0."]
pub const PerfCounterRegister_PERFCOUNTERREG_CORE_COUNT_REG_0: PerfCounterRegister = 0;
#[doc = "< CP15 PMN1."]
pub const PerfCounterRegister_PERFCOUNTERREG_CORE_COUNT_REG_1: PerfCounterRegister = 1;
#[doc = "< CP15 CCNT."]
pub const PerfCounterRegister_PERFCOUNTERREG_CORE_CYCLE_COUNTER: PerfCounterRegister = 2;
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_BASE: PerfCounterRegister = 16;
#[doc = "< SCU MN0."]
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_0: PerfCounterRegister = 16;
#[doc = "< SCU MN1."]
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_1: PerfCounterRegister = 17;
#[doc = "< SCU MN2."]
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_2: PerfCounterRegister = 18;
#[doc = "< SCU MN3."]
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_3: PerfCounterRegister = 19;
#[doc = "< SCU MN4. Prod-N3DS only. IRQ line missing."]
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_4: PerfCounterRegister = 20;
#[doc = "< SCU MN5. Prod-N3DS only. IRQ line missing."]
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_5: PerfCounterRegister = 21;
#[doc = "< SCU MN6. Prod-N3DS only. IRQ line missing."]
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_6: PerfCounterRegister = 22;
#[doc = "< SCU MN7. Prod-N3DS only. IRQ line missing."]
pub const PerfCounterRegister_PERFCOUNTERREG_SCU_7: PerfCounterRegister = 23;
#[doc = " Performance counter register IDs (CP15 and SCU)."]
pub type PerfCounterRegister = crate::os::raw::c_uint;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_BASE: PerfCounterEvent = 0;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_INST_CACHE_MISS: PerfCounterEvent = 0;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_STALL_BY_LACK_OF_INST: PerfCounterEvent = 1;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_STALL_BY_DATA_HAZARD: PerfCounterEvent = 2;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_INST_MICRO_TLB_MISS: PerfCounterEvent = 3;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_DATA_MICRO_TLB_MISS: PerfCounterEvent = 4;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_BRANCH_INST: PerfCounterEvent = 5;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_BRANCH_NOT_PREDICTED: PerfCounterEvent = 6;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_BRANCH_MISS_PREDICTED: PerfCounterEvent = 7;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_INST_EXECUTED: PerfCounterEvent = 8;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_FOLDED_INST_EXECUTED: PerfCounterEvent = 9;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_DATA_CACHE_READ: PerfCounterEvent = 10;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_DATA_CACHE_READ_MISS: PerfCounterEvent = 11;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_DATA_CACHE_WRITE: PerfCounterEvent = 12;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_DATA_CACHE_WRITE_MISS: PerfCounterEvent = 13;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_DATA_CACHE_LINE_EVICTION: PerfCounterEvent = 14;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_PC_CHANGED: PerfCounterEvent = 15;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_MAIN_TLB_MISS: PerfCounterEvent = 16;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_EXTERNAL_REQUEST: PerfCounterEvent = 17;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_STALL_BY_LSU_FULL: PerfCounterEvent = 18;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_STORE_BUFFER_DRAIN: PerfCounterEvent = 19;
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_MERGE_IN_STORE_BUFFER: PerfCounterEvent = 20;
#[doc = "< One cycle elapsed."]
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_CYCLE_COUNT: PerfCounterEvent = 255;
#[doc = "< 64 cycles elapsed."]
pub const PerfCounterEvent_PERFCOUNTEREVT_CORE_CYCLE_COUNT_64: PerfCounterEvent = 4095;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_BASE: PerfCounterEvent = 4096;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_DISABLED: PerfCounterEvent = 4096;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINEFILL_MISS_FROM_CORE0: PerfCounterEvent = 4097;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINEFILL_MISS_FROM_CORE1: PerfCounterEvent = 4098;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINEFILL_MISS_FROM_CORE2: PerfCounterEvent = 4099;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINEFILL_MISS_FROM_CORE3: PerfCounterEvent = 4100;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINEFILL_HIT_FROM_CORE0: PerfCounterEvent = 4101;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINEFILL_HIT_FROM_CORE1: PerfCounterEvent = 4102;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINEFILL_HIT_FROM_CORE2: PerfCounterEvent = 4103;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINEFILL_HIT_FROM_CORE3: PerfCounterEvent = 4104;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINE_MISSING_FROM_CORE0: PerfCounterEvent = 4105;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINE_MISSING_FROM_CORE1: PerfCounterEvent = 4106;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINE_MISSING_FROM_CORE2: PerfCounterEvent = 4107;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINE_MISSING_FROM_CORE3: PerfCounterEvent = 4108;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_LINE_MIGRATION: PerfCounterEvent = 4109;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_READ_BUSY_PORT0: PerfCounterEvent = 4110;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_READ_BUSY_PORT1: PerfCounterEvent = 4111;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_WRITE_BUSY_PORT0: PerfCounterEvent = 4112;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_WRITE_BUSY_PORT1: PerfCounterEvent = 4113;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_EXTERNAL_READ: PerfCounterEvent = 4114;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_EXTERNAL_WRITE: PerfCounterEvent = 4115;
pub const PerfCounterEvent_PERFCOUNTEREVT_SCU_CYCLE_COUNT: PerfCounterEvent = 4127;
#[doc = " @brief Performance counter event IDs (CP15 or SCU)."]
#[doc = ""]
#[doc = " @note Refer to:"]
#[doc = "     - CP15: https://developer.arm.com/documentation/ddi0360/e/control-coprocessor-cp15/register-descriptions/c15--performance-monitor-control-register--pmnc-"]
#[doc = "     - SCU: https://developer.arm.com/documentation/ddi0360/e/mpcore-private-memory-region/about-the-mpcore-private-memory-region/performance-monitor-event-registers"]
pub type PerfCounterEvent = crate::os::raw::c_uint;
#[doc = " Event relating to the attachment of a process."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AttachProcessEvent {
    #[doc = "< ID of the program."]
    pub program_id: u64_,
    #[doc = "< Name of the process."]
    pub process_name: [crate::os::raw::c_char; 8usize],
    #[doc = "< ID of the process."]
    pub process_id: u32_,
    #[doc = "< Always 0"]
    pub other_flags: u32_,
}
#[test]
fn bindgen_test_layout_AttachProcessEvent() {
    assert_eq!(
        crate::mem::size_of::<AttachProcessEvent>(),
        24usize,
        concat!("Size of: ", stringify!(AttachProcessEvent))
    );
    assert_eq!(
        crate::mem::align_of::<AttachProcessEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(AttachProcessEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<AttachProcessEvent>())).program_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AttachProcessEvent),
            "::",
            stringify!(program_id)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<AttachProcessEvent>())).process_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AttachProcessEvent),
            "::",
            stringify!(process_name)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<AttachProcessEvent>())).process_id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AttachProcessEvent),
            "::",
            stringify!(process_id)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<AttachProcessEvent>())).other_flags as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AttachProcessEvent),
            "::",
            stringify!(other_flags)
        )
    );
}
#[doc = "< Process exited either normally or due to an uncaught exception."]
pub const ExitProcessEventReason_EXITPROCESS_EVENT_EXIT: ExitProcessEventReason = 0;
#[doc = "< Process has been terminated by @ref svcTerminateProcess."]
pub const ExitProcessEventReason_EXITPROCESS_EVENT_TERMINATE: ExitProcessEventReason = 1;
#[doc = "< Process has been terminated by @ref svcTerminateDebugProcess."]
pub const ExitProcessEventReason_EXITPROCESS_EVENT_DEBUG_TERMINATE: ExitProcessEventReason = 2;
#[doc = " Reasons for an exit process event."]
pub type ExitProcessEventReason = crate::os::raw::c_uint;
#[doc = " Event relating to the exiting of a process."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExitProcessEvent {
    #[doc = "< Reason for exiting. See @ref ExitProcessEventReason"]
    pub reason: ExitProcessEventReason,
}
#[test]
fn bindgen_test_layout_ExitProcessEvent() {
    assert_eq!(
        crate::mem::size_of::<ExitProcessEvent>(),
        4usize,
        concat!("Size of: ", stringify!(ExitProcessEvent))
    );
    assert_eq!(
        crate::mem::align_of::<ExitProcessEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(ExitProcessEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExitProcessEvent>())).reason as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExitProcessEvent),
            "::",
            stringify!(reason)
        )
    );
}
#[doc = " Event relating to the attachment of a thread."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AttachThreadEvent {
    #[doc = "< ID of the creating thread."]
    pub creator_thread_id: u32_,
    #[doc = "< Thread local storage."]
    pub thread_local_storage: u32_,
    #[doc = "< Entry point of the thread."]
    pub entry_point: u32_,
}
#[test]
fn bindgen_test_layout_AttachThreadEvent() {
    assert_eq!(
        crate::mem::size_of::<AttachThreadEvent>(),
        12usize,
        concat!("Size of: ", stringify!(AttachThreadEvent))
    );
    assert_eq!(
        crate::mem::align_of::<AttachThreadEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(AttachThreadEvent))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<AttachThreadEvent>())).creator_thread_id as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AttachThreadEvent),
            "::",
            stringify!(creator_thread_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<AttachThreadEvent>())).thread_local_storage as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AttachThreadEvent),
            "::",
            stringify!(thread_local_storage)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<AttachThreadEvent>())).entry_point as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AttachThreadEvent),
            "::",
            stringify!(entry_point)
        )
    );
}
#[doc = "< Thread exited."]
pub const ExitThreadEventReason_EXITTHREAD_EVENT_EXIT: ExitThreadEventReason = 0;
#[doc = "< Thread terminated."]
pub const ExitThreadEventReason_EXITTHREAD_EVENT_TERMINATE: ExitThreadEventReason = 1;
#[doc = "< Process exited either normally or due to an uncaught exception."]
pub const ExitThreadEventReason_EXITTHREAD_EVENT_EXIT_PROCESS: ExitThreadEventReason = 2;
#[doc = "< Process has been terminated by @ref svcTerminateProcess."]
pub const ExitThreadEventReason_EXITTHREAD_EVENT_TERMINATE_PROCESS: ExitThreadEventReason = 3;
#[doc = " Reasons for an exit thread event."]
pub type ExitThreadEventReason = crate::os::raw::c_uint;
#[doc = " Event relating to the exiting of a thread."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExitThreadEvent {
    #[doc = "< Reason for exiting. See @ref ExitThreadEventReason"]
    pub reason: ExitThreadEventReason,
}
#[test]
fn bindgen_test_layout_ExitThreadEvent() {
    assert_eq!(
        crate::mem::size_of::<ExitThreadEvent>(),
        4usize,
        concat!("Size of: ", stringify!(ExitThreadEvent))
    );
    assert_eq!(
        crate::mem::align_of::<ExitThreadEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(ExitThreadEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExitThreadEvent>())).reason as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExitThreadEvent),
            "::",
            stringify!(reason)
        )
    );
}
#[doc = "< Panic."]
pub const UserBreakType_USERBREAK_PANIC: UserBreakType = 0;
#[doc = "< Assertion failed."]
pub const UserBreakType_USERBREAK_ASSERT: UserBreakType = 1;
#[doc = "< User related."]
pub const UserBreakType_USERBREAK_USER: UserBreakType = 2;
#[doc = "< Load RO."]
pub const UserBreakType_USERBREAK_LOAD_RO: UserBreakType = 3;
#[doc = "< Unload RO."]
pub const UserBreakType_USERBREAK_UNLOAD_RO: UserBreakType = 4;
#[doc = " Reasons for a user break."]
pub type UserBreakType = crate::os::raw::c_uint;
#[doc = "< Undefined instruction."]
pub const ExceptionEventType_EXCEVENT_UNDEFINED_INSTRUCTION: ExceptionEventType = 0;
#[doc = "< Prefetch abort."]
pub const ExceptionEventType_EXCEVENT_PREFETCH_ABORT: ExceptionEventType = 1;
#[doc = "< Data abort (other than the below kind)."]
pub const ExceptionEventType_EXCEVENT_DATA_ABORT: ExceptionEventType = 2;
#[doc = "< Unaligned data access."]
pub const ExceptionEventType_EXCEVENT_UNALIGNED_DATA_ACCESS: ExceptionEventType = 3;
#[doc = "< Attached break."]
pub const ExceptionEventType_EXCEVENT_ATTACH_BREAK: ExceptionEventType = 4;
#[doc = "< Stop point reached."]
pub const ExceptionEventType_EXCEVENT_STOP_POINT: ExceptionEventType = 5;
#[doc = "< User break occurred."]
pub const ExceptionEventType_EXCEVENT_USER_BREAK: ExceptionEventType = 6;
#[doc = "< Debugger break occurred."]
pub const ExceptionEventType_EXCEVENT_DEBUGGER_BREAK: ExceptionEventType = 7;
#[doc = "< Undefined syscall."]
pub const ExceptionEventType_EXCEVENT_UNDEFINED_SYSCALL: ExceptionEventType = 8;
#[doc = " Reasons for an exception event."]
pub type ExceptionEventType = crate::os::raw::c_uint;
#[doc = " Event relating to fault exceptions (CPU exceptions other than stop points and undefined syscalls)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FaultExceptionEvent {
    #[doc = "< FAR (for DATA ABORT / UNALIGNED DATA ACCESS), attempted syscall or 0"]
    pub fault_information: u32_,
}
#[test]
fn bindgen_test_layout_FaultExceptionEvent() {
    assert_eq!(
        crate::mem::size_of::<FaultExceptionEvent>(),
        4usize,
        concat!("Size of: ", stringify!(FaultExceptionEvent))
    );
    assert_eq!(
        crate::mem::align_of::<FaultExceptionEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(FaultExceptionEvent))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<FaultExceptionEvent>())).fault_information as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FaultExceptionEvent),
            "::",
            stringify!(fault_information)
        )
    );
}
#[doc = "< See @ref SVC_STOP_POINT."]
pub const StopPointType_STOPPOINT_SVC_FF: StopPointType = 0;
#[doc = "< Breakpoint."]
pub const StopPointType_STOPPOINT_BREAKPOINT: StopPointType = 1;
#[doc = "< Watchpoint."]
pub const StopPointType_STOPPOINT_WATCHPOINT: StopPointType = 2;
#[doc = " Stop point types"]
pub type StopPointType = crate::os::raw::c_uint;
#[doc = " Event relating to stop points"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StopPointExceptionEvent {
    #[doc = "< Stop point type, see @ref StopPointType."]
    pub type_: StopPointType,
    #[doc = "< FAR for Watchpoints, otherwise 0."]
    pub fault_information: u32_,
}
#[test]
fn bindgen_test_layout_StopPointExceptionEvent() {
    assert_eq!(
        crate::mem::size_of::<StopPointExceptionEvent>(),
        8usize,
        concat!("Size of: ", stringify!(StopPointExceptionEvent))
    );
    assert_eq!(
        crate::mem::align_of::<StopPointExceptionEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(StopPointExceptionEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<StopPointExceptionEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(StopPointExceptionEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<StopPointExceptionEvent>())).fault_information as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(StopPointExceptionEvent),
            "::",
            stringify!(fault_information)
        )
    );
}
#[doc = " Event relating to @ref svcBreak"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UserBreakExceptionEvent {
    #[doc = "< User break type, see @ref UserBreakType."]
    pub type_: UserBreakType,
    #[doc = "< For LOAD_RO and UNLOAD_RO."]
    pub croInfo: u32_,
    #[doc = "< For LOAD_RO and UNLOAD_RO."]
    pub croInfoSize: u32_,
}
#[test]
fn bindgen_test_layout_UserBreakExceptionEvent() {
    assert_eq!(
        crate::mem::size_of::<UserBreakExceptionEvent>(),
        12usize,
        concat!("Size of: ", stringify!(UserBreakExceptionEvent))
    );
    assert_eq!(
        crate::mem::align_of::<UserBreakExceptionEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(UserBreakExceptionEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<UserBreakExceptionEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UserBreakExceptionEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<UserBreakExceptionEvent>())).croInfo as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UserBreakExceptionEvent),
            "::",
            stringify!(croInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<UserBreakExceptionEvent>())).croInfoSize as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UserBreakExceptionEvent),
            "::",
            stringify!(croInfoSize)
        )
    );
}
#[doc = " Event relating to @ref svcBreakDebugProcess"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DebuggerBreakExceptionEvent {
    #[doc = "< IDs of the attached process's threads that were running on each core at the time of the @ref svcBreakDebugProcess call, or -1 (only the first 2 values are meaningful on O3DS)."]
    pub thread_ids: [s32; 4usize],
}
#[test]
fn bindgen_test_layout_DebuggerBreakExceptionEvent() {
    assert_eq!(
        crate::mem::size_of::<DebuggerBreakExceptionEvent>(),
        16usize,
        concat!("Size of: ", stringify!(DebuggerBreakExceptionEvent))
    );
    assert_eq!(
        crate::mem::align_of::<DebuggerBreakExceptionEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(DebuggerBreakExceptionEvent))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebuggerBreakExceptionEvent>())).thread_ids as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebuggerBreakExceptionEvent),
            "::",
            stringify!(thread_ids)
        )
    );
}
#[doc = " Event relating to exceptions."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExceptionEvent {
    #[doc = "< Type of event. See @ref ExceptionEventType."]
    pub type_: ExceptionEventType,
    #[doc = "< Address of the exception."]
    pub address: u32_,
    pub __bindgen_anon_1: ExceptionEvent__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ExceptionEvent__bindgen_ty_1 {
    #[doc = "< Fault exception event data."]
    pub fault: FaultExceptionEvent,
    #[doc = "< Stop point exception event data."]
    pub stop_point: StopPointExceptionEvent,
    #[doc = "< User break exception event data."]
    pub user_break: UserBreakExceptionEvent,
    #[doc = "< Debugger break exception event data"]
    pub debugger_break: DebuggerBreakExceptionEvent,
}
#[test]
fn bindgen_test_layout_ExceptionEvent__bindgen_ty_1() {
    assert_eq!(
        crate::mem::size_of::<ExceptionEvent__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ExceptionEvent__bindgen_ty_1))
    );
    assert_eq!(
        crate::mem::align_of::<ExceptionEvent__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ExceptionEvent__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExceptionEvent__bindgen_ty_1>())).fault as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExceptionEvent__bindgen_ty_1),
            "::",
            stringify!(fault)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExceptionEvent__bindgen_ty_1>())).stop_point as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExceptionEvent__bindgen_ty_1),
            "::",
            stringify!(stop_point)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExceptionEvent__bindgen_ty_1>())).user_break as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExceptionEvent__bindgen_ty_1),
            "::",
            stringify!(user_break)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExceptionEvent__bindgen_ty_1>())).debugger_break as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExceptionEvent__bindgen_ty_1),
            "::",
            stringify!(debugger_break)
        )
    );
}
#[test]
fn bindgen_test_layout_ExceptionEvent() {
    assert_eq!(
        crate::mem::size_of::<ExceptionEvent>(),
        24usize,
        concat!("Size of: ", stringify!(ExceptionEvent))
    );
    assert_eq!(
        crate::mem::align_of::<ExceptionEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(ExceptionEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExceptionEvent>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExceptionEvent),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExceptionEvent>())).address as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ExceptionEvent),
            "::",
            stringify!(address)
        )
    );
}
#[doc = " Event relating to the scheduler."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScheduleInOutEvent {
    #[doc = "< Clock tick that the event occurred."]
    pub clock_tick: u64_,
}
#[test]
fn bindgen_test_layout_ScheduleInOutEvent() {
    assert_eq!(
        crate::mem::size_of::<ScheduleInOutEvent>(),
        8usize,
        concat!("Size of: ", stringify!(ScheduleInOutEvent))
    );
    assert_eq!(
        crate::mem::align_of::<ScheduleInOutEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(ScheduleInOutEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ScheduleInOutEvent>())).clock_tick as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ScheduleInOutEvent),
            "::",
            stringify!(clock_tick)
        )
    );
}
#[doc = " Event relating to syscalls."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SyscallInOutEvent {
    #[doc = "< Clock tick that the event occurred."]
    pub clock_tick: u64_,
    #[doc = "< Syscall sent/received."]
    pub syscall: u32_,
}
#[test]
fn bindgen_test_layout_SyscallInOutEvent() {
    assert_eq!(
        crate::mem::size_of::<SyscallInOutEvent>(),
        16usize,
        concat!("Size of: ", stringify!(SyscallInOutEvent))
    );
    assert_eq!(
        crate::mem::align_of::<SyscallInOutEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(SyscallInOutEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<SyscallInOutEvent>())).clock_tick as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SyscallInOutEvent),
            "::",
            stringify!(clock_tick)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<SyscallInOutEvent>())).syscall as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SyscallInOutEvent),
            "::",
            stringify!(syscall)
        )
    );
}
#[doc = " Event relating to debug output."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OutputStringEvent {
    #[doc = "< Address of the outputted string."]
    pub string_addr: u32_,
    #[doc = "< Size of the outputted string."]
    pub string_size: u32_,
}
#[test]
fn bindgen_test_layout_OutputStringEvent() {
    assert_eq!(
        crate::mem::size_of::<OutputStringEvent>(),
        8usize,
        concat!("Size of: ", stringify!(OutputStringEvent))
    );
    assert_eq!(
        crate::mem::align_of::<OutputStringEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(OutputStringEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<OutputStringEvent>())).string_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OutputStringEvent),
            "::",
            stringify!(string_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<OutputStringEvent>())).string_size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OutputStringEvent),
            "::",
            stringify!(string_size)
        )
    );
}
#[doc = " Event relating to the mapping of memory."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapEvent {
    #[doc = "< Mapped address."]
    pub mapped_addr: u32_,
    #[doc = "< Mapped size."]
    pub mapped_size: u32_,
    #[doc = "< Memory permissions. See @ref MemPerm."]
    pub memperm: MemPerm,
    #[doc = "< Memory state. See @ref MemState."]
    pub memstate: MemState,
}
#[test]
fn bindgen_test_layout_MapEvent() {
    assert_eq!(
        crate::mem::size_of::<MapEvent>(),
        16usize,
        concat!("Size of: ", stringify!(MapEvent))
    );
    assert_eq!(
        crate::mem::align_of::<MapEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(MapEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<MapEvent>())).mapped_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvent),
            "::",
            stringify!(mapped_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<MapEvent>())).mapped_size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvent),
            "::",
            stringify!(mapped_size)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<MapEvent>())).memperm as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvent),
            "::",
            stringify!(memperm)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<MapEvent>())).memstate as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MapEvent),
            "::",
            stringify!(memstate)
        )
    );
}
#[doc = "< Process attached event."]
pub const DebugEventType_DBGEVENT_ATTACH_PROCESS: DebugEventType = 0;
#[doc = "< Thread attached event."]
pub const DebugEventType_DBGEVENT_ATTACH_THREAD: DebugEventType = 1;
#[doc = "< Thread exit event."]
pub const DebugEventType_DBGEVENT_EXIT_THREAD: DebugEventType = 2;
#[doc = "< Process exit event."]
pub const DebugEventType_DBGEVENT_EXIT_PROCESS: DebugEventType = 3;
#[doc = "< Exception event."]
pub const DebugEventType_DBGEVENT_EXCEPTION: DebugEventType = 4;
#[doc = "< DLL load event."]
pub const DebugEventType_DBGEVENT_DLL_LOAD: DebugEventType = 5;
#[doc = "< DLL unload event."]
pub const DebugEventType_DBGEVENT_DLL_UNLOAD: DebugEventType = 6;
#[doc = "< Schedule in event."]
pub const DebugEventType_DBGEVENT_SCHEDULE_IN: DebugEventType = 7;
#[doc = "< Schedule out event."]
pub const DebugEventType_DBGEVENT_SCHEDULE_OUT: DebugEventType = 8;
#[doc = "< Syscall in event."]
pub const DebugEventType_DBGEVENT_SYSCALL_IN: DebugEventType = 9;
#[doc = "< Syscall out event."]
pub const DebugEventType_DBGEVENT_SYSCALL_OUT: DebugEventType = 10;
#[doc = "< Output string event."]
pub const DebugEventType_DBGEVENT_OUTPUT_STRING: DebugEventType = 11;
#[doc = "< Map event."]
pub const DebugEventType_DBGEVENT_MAP: DebugEventType = 12;
#[doc = " Debug event type."]
pub type DebugEventType = crate::os::raw::c_uint;
#[doc = " Information about a debug event."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DebugEventInfo {
    #[doc = "< Type of event. See @ref DebugEventType"]
    pub type_: DebugEventType,
    #[doc = "< ID of the thread."]
    pub thread_id: u32_,
    #[doc = "< Flags. Bit0 means that @ref svcContinueDebugEvent needs to be called for this event (except for EXIT PROCESS events, where this flag is disregarded)."]
    pub flags: u32_,
    #[doc = "< Always 0."]
    pub remnants: [u8_; 4usize],
    pub __bindgen_anon_1: DebugEventInfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DebugEventInfo__bindgen_ty_1 {
    #[doc = "< Process attachment event data."]
    pub attach_process: AttachProcessEvent,
    #[doc = "< Thread attachment event data."]
    pub attach_thread: AttachThreadEvent,
    #[doc = "< Thread exit event data."]
    pub exit_thread: ExitThreadEvent,
    #[doc = "< Process exit event data."]
    pub exit_process: ExitProcessEvent,
    #[doc = "< Exception event data."]
    pub exception: ExceptionEvent,
    #[doc = "< Schedule in/out event data."]
    pub scheduler: ScheduleInOutEvent,
    #[doc = "< Syscall in/out event data."]
    pub syscall: SyscallInOutEvent,
    #[doc = "< Output string event data."]
    pub output_string: OutputStringEvent,
    #[doc = "< Map event data."]
    pub map: MapEvent,
}
#[test]
fn bindgen_test_layout_DebugEventInfo__bindgen_ty_1() {
    assert_eq!(
        crate::mem::size_of::<DebugEventInfo__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(DebugEventInfo__bindgen_ty_1))
    );
    assert_eq!(
        crate::mem::align_of::<DebugEventInfo__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(DebugEventInfo__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).attach_process as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(attach_process)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).attach_thread as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(attach_thread)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).exit_thread as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(exit_thread)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).exit_process as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(exit_process)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).exception as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(exception)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).scheduler as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(scheduler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).syscall as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(syscall)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).output_string as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(output_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<DebugEventInfo__bindgen_ty_1>())).map as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo__bindgen_ty_1),
            "::",
            stringify!(map)
        )
    );
}
#[test]
fn bindgen_test_layout_DebugEventInfo() {
    assert_eq!(
        crate::mem::size_of::<DebugEventInfo>(),
        40usize,
        concat!("Size of: ", stringify!(DebugEventInfo))
    );
    assert_eq!(
        crate::mem::align_of::<DebugEventInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(DebugEventInfo))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DebugEventInfo>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DebugEventInfo>())).thread_id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo),
            "::",
            stringify!(thread_id)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DebugEventInfo>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<DebugEventInfo>())).remnants as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DebugEventInfo),
            "::",
            stringify!(remnants)
        )
    );
}
#[doc = "< Inhibit user-defined CPU exception handlers (including watchpoints and breakpoints, regardless of any @ref svcKernelSetState call)."]
pub const DebugFlags_DBG_INHIBIT_USER_CPU_EXCEPTION_HANDLERS: DebugFlags = 1;
#[doc = "< Signal fault exception events. See @ref FaultExceptionEvent."]
pub const DebugFlags_DBG_SIGNAL_FAULT_EXCEPTION_EVENTS: DebugFlags = 2;
#[doc = "< Signal schedule in/out events. See @ref ScheduleInOutEvent."]
pub const DebugFlags_DBG_SIGNAL_SCHEDULE_EVENTS: DebugFlags = 4;
#[doc = "< Signal syscall in/out events. See @ref SyscallInOutEvent."]
pub const DebugFlags_DBG_SIGNAL_SYSCALL_EVENTS: DebugFlags = 8;
#[doc = "< Signal map events. See @ref MapEvent."]
pub const DebugFlags_DBG_SIGNAL_MAP_EVENTS: DebugFlags = 16;
#[doc = " Debug flags for an attached process, set by @ref svcContinueDebugEvent"]
pub type DebugFlags = crate::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ThreadContext {
    #[doc = "< CPU registers."]
    pub cpu_registers: CpuRegisters,
    #[doc = "< FPU registers."]
    pub fpu_registers: FpuRegisters,
}
#[test]
fn bindgen_test_layout_ThreadContext() {
    assert_eq!(
        crate::mem::size_of::<ThreadContext>(),
        204usize,
        concat!("Size of: ", stringify!(ThreadContext))
    );
    assert_eq!(
        crate::mem::align_of::<ThreadContext>(),
        4usize,
        concat!("Alignment of ", stringify!(ThreadContext))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ThreadContext>())).cpu_registers as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(cpu_registers)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ThreadContext>())).fpu_registers as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(fpu_registers)
        )
    );
}
#[doc = "< Control r0-r12."]
pub const ThreadContextControlFlags_THREADCONTEXT_CONTROL_CPU_GPRS: ThreadContextControlFlags = 1;
#[doc = "< Control sp, lr, pc, cpsr."]
pub const ThreadContextControlFlags_THREADCONTEXT_CONTROL_CPU_SPRS: ThreadContextControlFlags = 2;
#[doc = "< Control d0-d15 (or s0-s31)."]
pub const ThreadContextControlFlags_THREADCONTEXT_CONTROL_FPU_GPRS: ThreadContextControlFlags = 4;
#[doc = "< Control fpscr, fpexc."]
pub const ThreadContextControlFlags_THREADCONTEXT_CONTROL_FPU_SPRS: ThreadContextControlFlags = 8;
#[doc = "< Control r0-r12, sp, lr, pc, cpsr."]
pub const ThreadContextControlFlags_THREADCONTEXT_CONTROL_CPU_REGS: ThreadContextControlFlags = 3;
#[doc = "< Control d0-d15, fpscr, fpexc."]
pub const ThreadContextControlFlags_THREADCONTEXT_CONTROL_FPU_REGS: ThreadContextControlFlags = 12;
#[doc = "< Control all of the above."]
pub const ThreadContextControlFlags_THREADCONTEXT_CONTROL_ALL: ThreadContextControlFlags = 15;
#[doc = " Control flags for @ref svcGetDebugThreadContext and @ref svcSetDebugThreadContext"]
pub type ThreadContextControlFlags = crate::os::raw::c_uint;
#[doc = "< Thread priority."]
pub const DebugThreadParameter_DBGTHREAD_PARAMETER_PRIORITY: DebugThreadParameter = 0;
#[doc = "< Low scheduling mask."]
pub const DebugThreadParameter_DBGTHREAD_PARAMETER_SCHEDULING_MASK_LOW: DebugThreadParameter = 1;
#[doc = "< Ideal processor."]
pub const DebugThreadParameter_DBGTHREAD_PARAMETER_CPU_IDEAL: DebugThreadParameter = 2;
#[doc = "< Processor that created the threod."]
pub const DebugThreadParameter_DBGTHREAD_PARAMETER_CPU_CREATOR: DebugThreadParameter = 3;
#[doc = " Thread parameter field for @ref svcGetDebugThreadParameter"]
pub type DebugThreadParameter = crate::os::raw::c_uint;
#[doc = " Information on address space for process. All sizes are in pages (0x1000 bytes)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CodeSetInfo {
    #[doc = "< ASCII name of codeset"]
    pub name: [u8_; 8usize],
    pub unk1: u16_,
    pub unk2: u16_,
    pub unk3: u32_,
    #[doc = "< .text start address"]
    pub text_addr: u32_,
    #[doc = "< .text number of pages"]
    pub text_size: u32_,
    #[doc = "< .rodata start address"]
    pub ro_addr: u32_,
    #[doc = "< .rodata number of pages"]
    pub ro_size: u32_,
    #[doc = "< .data, .bss start address"]
    pub rw_addr: u32_,
    #[doc = "< .data number of pages"]
    pub rw_size: u32_,
    #[doc = "< total pages for .text (aligned)"]
    pub text_size_total: u32_,
    #[doc = "< total pages for .rodata (aligned)"]
    pub ro_size_total: u32_,
    #[doc = "< total pages for .data, .bss (aligned)"]
    pub rw_size_total: u32_,
    pub unk4: u32_,
    #[doc = "< Program ID"]
    pub program_id: u64_,
}
#[test]
fn bindgen_test_layout_CodeSetInfo() {
    assert_eq!(
        crate::mem::size_of::<CodeSetInfo>(),
        64usize,
        concat!("Size of: ", stringify!(CodeSetInfo))
    );
    assert_eq!(
        crate::mem::align_of::<CodeSetInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(CodeSetInfo))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).unk1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(unk1)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).unk2 as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(unk2)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).unk3 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(unk3)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).text_addr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(text_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).text_size as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(text_size)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).ro_addr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(ro_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).ro_size as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(ro_size)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).rw_addr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(rw_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).rw_size as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(rw_size)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).text_size_total as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(text_size_total)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).ro_size_total as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(ro_size_total)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).rw_size_total as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(rw_size_total)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).unk4 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(unk4)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<CodeSetInfo>())).program_id as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CodeSetInfo),
            "::",
            stringify!(program_id)
        )
    );
}
#[doc = " Information for the main thread of a process."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StartupInfo {
    #[doc = "< Priority of the main thread."]
    pub priority: crate::os::raw::c_int,
    #[doc = "< Size of the stack of the main thread."]
    pub stack_size: u32_,
    #[doc = "< Unused on retail kernel."]
    pub argc: crate::os::raw::c_int,
    #[doc = "< Unused on retail kernel."]
    pub argv: *mut u16_,
    #[doc = "< Unused on retail kernel."]
    pub envp: *mut u16_,
}
#[test]
fn bindgen_test_layout_StartupInfo() {
    assert_eq!(
        crate::mem::size_of::<StartupInfo>(),
        20usize,
        concat!("Size of: ", stringify!(StartupInfo))
    );
    assert_eq!(
        crate::mem::align_of::<StartupInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(StartupInfo))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<StartupInfo>())).priority as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(StartupInfo),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<StartupInfo>())).stack_size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(StartupInfo),
            "::",
            stringify!(stack_size)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<StartupInfo>())).argc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(StartupInfo),
            "::",
            stringify!(argc)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<StartupInfo>())).argv as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(StartupInfo),
            "::",
            stringify!(argv)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<StartupInfo>())).envp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(StartupInfo),
            "::",
            stringify!(envp)
        )
    );
}
extern "C" {
    #[doc = "@name Memory management"]
    #[doc = "@{"]
    #[doc = "**"]
    #[doc = "* @brief Controls memory mapping"]
    #[doc = "* @param[out] addr_out The virtual address resulting from the operation. Usually the same as addr0."]
    #[doc = "* @param addr0    The virtual address to be used for the operation."]
    #[doc = "* @param addr1    The virtual address to be (un)mirrored by @p addr0 when using @ref MEMOP_MAP or @ref MEMOP_UNMAP."]
    #[doc = "*                 It has to be pointing to a RW memory."]
    #[doc = "*                 Use NULL if the operation is @ref MEMOP_FREE or @ref MEMOP_ALLOC."]
    #[doc = "* @param size     The requested size for @ref MEMOP_ALLOC and @ref MEMOP_ALLOC_LINEAR."]
    #[doc = "* @param op       Operation flags. See @ref MemOp."]
    #[doc = "* @param perm     A combination of @ref MEMPERM_READ and @ref MEMPERM_WRITE. Using MEMPERM_EXECUTE will return an error."]
    #[doc = "*                 Value 0 is used when unmapping memory."]
    #[doc = "*"]
    #[doc = "* If a memory is mapped for two or more addresses, you have to use MEMOP_UNMAP before being able to MEMOP_FREE it."]
    #[doc = "* MEMOP_MAP will fail if @p addr1 was already mapped to another address."]
    #[doc = "*"]
    #[doc = "* More information is available at http://3dbrew.org/wiki/SVC#Memory_Mapping."]
    #[doc = "*"]
    #[doc = "* @sa svcControlProcessMemory"]
    #[doc = "*/"]
    pub fn svcControlMemory(
        addr_out: *mut u32_,
        addr0: u32_,
        addr1: u32_,
        size: u32_,
        op: MemOp,
        perm: MemPerm,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Controls the memory mapping of a process"]
    #[doc = " @param addr0 The virtual address to map"]
    #[doc = " @param addr1 The virtual address to be mapped by @p addr0"]
    #[doc = " @param type Only operations @ref MEMOP_MAP, @ref MEMOP_UNMAP and @ref MEMOP_PROT are allowed."]
    #[doc = ""]
    #[doc = " This is the only SVC which allows mapping executable memory."]
    #[doc = " Using @ref MEMOP_PROT will change the memory permissions of an already mapped memory."]
    #[doc = ""]
    #[doc = " @note The pseudo handle for the current process is not supported by this service call."]
    #[doc = " @sa svcControlProcess"]
    pub fn svcControlProcessMemory(
        process: Handle,
        addr0: u32_,
        addr1: u32_,
        size: u32_,
        type_: u32_,
        perm: u32_,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Creates a block of shared memory"]
    #[doc = " @param[out] memblock Pointer to store the handle of the block"]
    #[doc = " @param addr Address of the memory to map, page-aligned. So its alignment must be 0x1000."]
    #[doc = " @param size Size of the memory to map, a multiple of 0x1000."]
    #[doc = " @param my_perm Memory permissions for the current process"]
    #[doc = " @param other_perm Memory permissions for the other processes"]
    #[doc = ""]
    #[doc = " @note The shared memory block, and its rights, are destroyed when the handle is closed."]
    pub fn svcCreateMemoryBlock(
        memblock: *mut Handle,
        addr: u32_,
        size: u32_,
        my_perm: MemPerm,
        other_perm: MemPerm,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Maps a block of shared memory"]
    #[doc = " @param memblock Handle of the block"]
    #[doc = " @param addr Address of the memory to map, page-aligned. So its alignment must be 0x1000."]
    #[doc = " @param my_perm Memory permissions for the current process"]
    #[doc = " @param other_perm Memory permissions for the other processes"]
    #[doc = ""]
    #[doc = " @note The shared memory block, and its rights, are destroyed when the handle is closed."]
    pub fn svcMapMemoryBlock(
        memblock: Handle,
        addr: u32_,
        my_perm: MemPerm,
        other_perm: MemPerm,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Maps a block of process memory, starting from address 0x00100000."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param destAddress Address of the block of memory to map, in the current (destination) process."]
    #[doc = " @param size Size of the block of memory to map (truncated to a multiple of 0x1000 bytes)."]
    pub fn svcMapProcessMemory(process: Handle, destAddress: u32_, size: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Unmaps a block of process memory, starting from address 0x00100000."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param destAddress Address of the block of memory to unmap, in the current (destination) process."]
    #[doc = " @param size Size of the block of memory to unmap (truncated to a multiple of 0x1000 bytes)."]
    pub fn svcUnmapProcessMemory(process: Handle, destAddress: u32_, size: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Unmaps a block of shared memory"]
    #[doc = " @param memblock Handle of the block"]
    #[doc = " @param addr Address of the memory to unmap, page-aligned. So its alignment must be 0x1000."]
    pub fn svcUnmapMemoryBlock(memblock: Handle, addr: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Queries memory information."]
    #[doc = " @param[out] info Pointer to output memory info to."]
    #[doc = " @param out Pointer to output page info to."]
    #[doc = " @param addr Virtual memory address to query."]
    pub fn svcQueryMemory(info: *mut MemInfo, out: *mut PageInfo, addr: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Queries process memory information."]
    #[doc = " @param[out] info Pointer to output memory info to."]
    #[doc = " @param[out] out Pointer to output page info to."]
    #[doc = " @param process Process to query memory from."]
    #[doc = " @param addr Virtual memory address to query."]
    pub fn svcQueryProcessMemory(
        info: *mut MemInfo,
        out: *mut PageInfo,
        process: Handle,
        addr: u32_,
    ) -> Result;
}
extern "C" {
    #[doc = "@name Process management"]
    #[doc = "@{"]
    #[doc = "**"]
    #[doc = "* @brief Gets the handle of a process."]
    #[doc = "* @param[out] process   The handle of the process"]
    #[doc = "* @param      processId The ID of the process to open"]
    #[doc = "*/"]
    pub fn svcOpenProcess(process: *mut Handle, processId: u32_) -> Result;
}
extern "C" {
    #[doc = " Exits the current process."]
    pub fn svcExitProcess();
}
extern "C" {
    #[doc = " @brief Terminates a process."]
    #[doc = " @param process Handle of the process to terminate."]
    pub fn svcTerminateProcess(process: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Gets information about a process."]
    #[doc = " @param[out] out Pointer to output process info to."]
    #[doc = " @param process Handle of the process to get information about."]
    #[doc = " @param type Type of information to retreieve."]
    pub fn svcGetProcessInfo(out: *mut s64, process: Handle, type_: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the ID of a process."]
    #[doc = " @param[out] out Pointer to output the process ID to."]
    #[doc = " @param handle Handle of the process to get the ID of."]
    pub fn svcGetProcessId(out: *mut u32_, handle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Gets a list of running processes."]
    #[doc = " @param[out] processCount Pointer to output the process count to."]
    #[doc = " @param[out] processIds Pointer to output the process IDs to."]
    #[doc = " @param processIdMaxCount Maximum number of process IDs."]
    pub fn svcGetProcessList(
        processCount: *mut s32,
        processIds: *mut u32_,
        processIdMaxCount: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Gets a list of the threads of a process."]
    #[doc = " @param[out] threadCount Pointer to output the thread count to."]
    #[doc = " @param[out] threadIds Pointer to output the thread IDs to."]
    #[doc = " @param threadIdMaxCount Maximum number of thread IDs."]
    #[doc = " @param process Process handle to list the threads of."]
    pub fn svcGetThreadList(
        threadCount: *mut s32,
        threadIds: *mut u32_,
        threadIdMaxCount: s32,
        process: Handle,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Creates a port."]
    #[doc = " @param[out] portServer Pointer to output the port server handle to."]
    #[doc = " @param[out] portClient Pointer to output the port client handle to."]
    #[doc = " @param name Name of the port."]
    #[doc = " @param maxSessions Maximum number of sessions that can connect to the port."]
    pub fn svcCreatePort(
        portServer: *mut Handle,
        portClient: *mut Handle,
        name: *const crate::os::raw::c_char,
        maxSessions: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Connects to a port."]
    #[doc = " @param[out] out Pointer to output the port handle to."]
    #[doc = " @param portName Name of the port."]
    pub fn svcConnectToPort(out: *mut Handle, portName: *const crate::os::raw::c_char) -> Result;
}
extern "C" {
    #[doc = " @brief Sets up virtual address space for a new process"]
    #[doc = " @param[out] out Pointer to output the code set handle to."]
    #[doc = " @param info Description for setting up the addresses"]
    #[doc = " @param code_ptr Pointer to .text in shared memory"]
    #[doc = " @param ro_ptr Pointer to .rodata in shared memory"]
    #[doc = " @param data_ptr Pointer to .data in shared memory"]
    pub fn svcCreateCodeSet(
        out: *mut Handle,
        info: *const CodeSetInfo,
        code_ptr: *mut crate::os::raw::c_void,
        ro_ptr: *mut crate::os::raw::c_void,
        data_ptr: *mut crate::os::raw::c_void,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Sets up virtual address space for a new process"]
    #[doc = " @param[out] out Pointer to output the process handle to."]
    #[doc = " @param codeset Codeset created for this process"]
    #[doc = " @param arm11kernelcaps ARM11 Kernel Capabilities from exheader"]
    #[doc = " @param arm11kernelcaps_num Number of kernel capabilities"]
    pub fn svcCreateProcess(
        out: *mut Handle,
        codeset: Handle,
        arm11kernelcaps: *const u32_,
        arm11kernelcaps_num: u32_,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Gets a process's affinity mask."]
    #[doc = " @param[out] affinitymask Pointer to store the affinity masks."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param processorcount Number of processors."]
    pub fn svcGetProcessAffinityMask(
        affinitymask: *mut u8_,
        process: Handle,
        processorcount: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Sets a process's affinity mask."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param affinitymask Pointer to retrieve the affinity masks from."]
    #[doc = " @param processorcount Number of processors."]
    pub fn svcSetProcessAffinityMask(
        process: Handle,
        affinitymask: *const u8_,
        processorcount: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " Gets a process's ideal processor."]
    #[doc = " @param[out] processorid Pointer to store the ID of the process's ideal processor."]
    #[doc = " @param process Handle of the process."]
    pub fn svcGetProcessIdealProcessor(processorid: *mut s32, process: Handle) -> Result;
}
extern "C" {
    #[doc = " Sets a process's ideal processor."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param processorid ID of the process's ideal processor."]
    pub fn svcSetProcessIdealProcessor(process: Handle, processorid: s32) -> Result;
}
extern "C" {
    #[doc = " Launches the main thread of the process."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param info Pointer to a StartupInfo structure describing information for the main thread."]
    pub fn svcRun(process: Handle, info: *const StartupInfo) -> Result;
}
extern "C" {
    #[doc = "@name Multithreading"]
    #[doc = "@{"]
    #[doc = "**"]
    #[doc = "* @brief Creates a new thread."]
    #[doc = "* @param[out] thread     The thread handle"]
    #[doc = "* @param entrypoint      The function that will be called first upon thread creation"]
    #[doc = "* @param arg             The argument passed to @p entrypoint"]
    #[doc = "* @param stack_top       The top of the thread's stack. Must be 0x8 bytes mem-aligned."]
    #[doc = "* @param thread_priority Low values gives the thread higher priority."]
    #[doc = "*                        For userland apps, this has to be within the range [0x18;0x3F]"]
    #[doc = "* @param processor_id    The id of the processor the thread should be ran on. Those are labelled starting from 0."]
    #[doc = "*                        For old 3ds it has to be <2, and for new 3DS <4."]
    #[doc = "*                        Value -1 means all CPUs and -2 read from the Exheader."]
    #[doc = "*"]
    #[doc = "* The processor with ID 1 is the system processor."]
    #[doc = "* To enable multi-threading on this core you need to call APT_SetAppCpuTimeLimit at least once with a non-zero value."]
    #[doc = "*"]
    #[doc = "* Since a thread is considered as a waitable object, you can use @ref svcWaitSynchronization"]
    #[doc = "* and @ref svcWaitSynchronizationN to join with it."]
    #[doc = "*"]
    #[doc = "* @note The kernel will clear the @p stack_top's address low 3 bits to make sure it is 0x8-bytes aligned."]
    #[doc = "*/"]
    pub fn svcCreateThread(
        thread: *mut Handle,
        entrypoint: ThreadFunc,
        arg: u32_,
        stack_top: *mut u32_,
        thread_priority: s32,
        processor_id: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the handle of a thread."]
    #[doc = " @param[out] thread  The handle of the thread"]
    #[doc = " @param      process The ID of the process linked to the thread"]
    pub fn svcOpenThread(thread: *mut Handle, process: Handle, threadId: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Exits the current thread."]
    #[doc = ""]
    #[doc = " This will trigger a state change and hence release all @ref svcWaitSynchronization operations."]
    #[doc = " It means that you can join a thread by calling @code svcWaitSynchronization(threadHandle,yourtimeout); @endcode"]
    pub fn svcExitThread();
}
extern "C" {
    #[doc = " @brief Puts the current thread to sleep."]
    #[doc = " @param ns The minimum number of nanoseconds to sleep for."]
    pub fn svcSleepThread(ns: s64);
}
extern "C" {
    #[doc = " Retrieves the priority of a thread."]
    pub fn svcGetThreadPriority(out: *mut s32, handle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Changes the priority of a thread"]
    #[doc = " @param prio For userland apps, this has to be within the range [0x18;0x3F]"]
    #[doc = ""]
    #[doc = " Low values gives the thread higher priority."]
    pub fn svcSetThreadPriority(thread: Handle, prio: s32) -> Result;
}
extern "C" {
    #[doc = " @brief Gets a thread's affinity mask."]
    #[doc = " @param[out] affinitymask Pointer to output the affinity masks to."]
    #[doc = " @param thread Handle of the thread."]
    #[doc = " @param processorcount Number of processors."]
    pub fn svcGetThreadAffinityMask(
        affinitymask: *mut u8_,
        thread: Handle,
        processorcount: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Sets a thread's affinity mask."]
    #[doc = " @param thread Handle of the thread."]
    #[doc = " @param affinitymask Pointer to retrieve the affinity masks from."]
    #[doc = " @param processorcount Number of processors."]
    pub fn svcSetThreadAffinityMask(
        thread: Handle,
        affinitymask: *const u8_,
        processorcount: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Gets a thread's ideal processor."]
    #[doc = " @param[out] processorid Pointer to output the ID of the thread's ideal processor to."]
    #[doc = " @param thread Handle of the thread."]
    pub fn svcGetThreadIdealProcessor(processorid: *mut s32, thread: Handle) -> Result;
}
extern "C" {
    #[doc = " Sets a thread's ideal processor."]
    #[doc = " @param thread Handle of the thread."]
    #[doc = " @param processorid ID of the thread's ideal processor."]
    pub fn svcSetThreadIdealProcessor(thread: Handle, processorid: s32) -> Result;
}
extern "C" {
    #[doc = " @brief Returns the ID of the processor the current thread is running on."]
    #[doc = " @sa svcCreateThread"]
    pub fn svcGetProcessorID() -> s32;
}
extern "C" {
    #[doc = " @brief Gets the ID of a thread."]
    #[doc = " @param[out] out Pointer to output the thread ID of the thread @p handle to."]
    #[doc = " @param handle Handle of the thread."]
    pub fn svcGetThreadId(out: *mut u32_, handle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the resource limit set of a process."]
    #[doc = " @param[out] resourceLimit Pointer to output the resource limit set handle to."]
    #[doc = " @param process Process to get the resource limits of."]
    pub fn svcGetResourceLimit(resourceLimit: *mut Handle, process: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the value limits of a resource limit set."]
    #[doc = " @param[out] values Pointer to output the value limits to."]
    #[doc = " @param resourceLimit Resource limit set to use."]
    #[doc = " @param names Resource limit names to get the limits of."]
    #[doc = " @param nameCount Number of resource limit names."]
    pub fn svcGetResourceLimitLimitValues(
        values: *mut s64,
        resourceLimit: Handle,
        names: *mut ResourceLimitType,
        nameCount: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the values of a resource limit set."]
    #[doc = " @param[out] values Pointer to output the values to."]
    #[doc = " @param resourceLimit Resource limit set to use."]
    #[doc = " @param names Resource limit names to get the values of."]
    #[doc = " @param nameCount Number of resource limit names."]
    pub fn svcGetResourceLimitCurrentValues(
        values: *mut s64,
        resourceLimit: Handle,
        names: *mut ResourceLimitType,
        nameCount: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Sets the resource limit set of a process."]
    #[doc = " @param process Process to set the resource limit set to."]
    #[doc = " @param resourceLimit Resource limit set handle."]
    pub fn svcSetProcessResourceLimits(process: Handle, resourceLimit: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Creates a resource limit set."]
    #[doc = " @param[out] resourceLimit Pointer to output the resource limit set handle to."]
    pub fn svcCreateResourceLimit(resourceLimit: *mut Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Sets the value limits of a resource limit set."]
    #[doc = " @param resourceLimit Resource limit set to use."]
    #[doc = " @param names Resource limit names to set the limits of."]
    #[doc = " @param values Value limits to set. The high 32 bits of RESLIMIT_COMMIT are used to"]
    #[doc = "set APPMEMALLOC in configuration memory, otherwise those bits are unused."]
    #[doc = " @param nameCount Number of resource limit names."]
    pub fn svcSetResourceLimitValues(
        resourceLimit: Handle,
        names: *const ResourceLimitType,
        values: *const s64,
        nameCount: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the process ID of a thread."]
    #[doc = " @param[out] out Pointer to output the process ID of the thread @p handle to."]
    #[doc = " @param handle Handle of the thread."]
    #[doc = " @sa svcOpenProcess"]
    pub fn svcGetProcessIdOfThread(out: *mut u32_, handle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Checks if a thread handle is valid."]
    #[doc = " This requests always return an error when called, it only checks if the handle is a thread or not."]
    #[doc = " @return 0xD8E007ED (BAD_ENUM) if the Handle is a Thread Handle"]
    #[doc = " @return 0xD8E007F7 (BAD_HANDLE) if it isn't."]
    pub fn svcGetThreadInfo(out: *mut s64, thread: Handle, type_: ThreadInfoType) -> Result;
}
extern "C" {
    #[doc = "@name Synchronization"]
    #[doc = "@{"]
    #[doc = "**"]
    #[doc = "* @brief Creates a mutex."]
    #[doc = "* @param[out] mutex Pointer to output the handle of the created mutex to."]
    #[doc = "* @param initially_locked Whether the mutex should be initially locked."]
    #[doc = "*/"]
    pub fn svcCreateMutex(mutex: *mut Handle, initially_locked: bool) -> Result;
}
extern "C" {
    #[doc = " @brief Releases a mutex."]
    #[doc = " @param handle Handle of the mutex."]
    pub fn svcReleaseMutex(handle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Creates a semaphore."]
    #[doc = " @param[out] semaphore Pointer to output the handle of the created semaphore to."]
    #[doc = " @param initial_count Initial count of the semaphore."]
    #[doc = " @param max_count Maximum count of the semaphore."]
    pub fn svcCreateSemaphore(semaphore: *mut Handle, initial_count: s32, max_count: s32)
        -> Result;
}
extern "C" {
    #[doc = " @brief Releases a semaphore."]
    #[doc = " @param[out] count Pointer to output the current count of the semaphore to."]
    #[doc = " @param semaphore Handle of the semaphore."]
    #[doc = " @param release_count Number to increase the semaphore count by."]
    pub fn svcReleaseSemaphore(count: *mut s32, semaphore: Handle, release_count: s32) -> Result;
}
extern "C" {
    #[doc = " @brief Creates an event handle."]
    #[doc = " @param[out] event Pointer to output the created event handle to."]
    #[doc = " @param reset_type Type of reset the event uses (RESET_ONESHOT/RESET_STICKY)."]
    pub fn svcCreateEvent(event: *mut Handle, reset_type: ResetType) -> Result;
}
extern "C" {
    #[doc = " @brief Signals an event."]
    #[doc = " @param handle Handle of the event to signal."]
    pub fn svcSignalEvent(handle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Clears an event."]
    #[doc = " @param handle Handle of the event to clear."]
    pub fn svcClearEvent(handle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Waits for synchronization on a handle."]
    #[doc = " @param handle Handle to wait on."]
    #[doc = " @param nanoseconds Maximum nanoseconds to wait for."]
    pub fn svcWaitSynchronization(handle: Handle, nanoseconds: s64) -> Result;
}
extern "C" {
    #[doc = " @brief Waits for synchronization on multiple handles."]
    #[doc = " @param[out] out Pointer to output the index of the synchronized handle to."]
    #[doc = " @param handles Handles to wait on."]
    #[doc = " @param handles_num Number of handles."]
    #[doc = " @param wait_all Whether to wait for synchronization on all handles."]
    #[doc = " @param nanoseconds Maximum nanoseconds to wait for."]
    pub fn svcWaitSynchronizationN(
        out: *mut s32,
        handles: *const Handle,
        handles_num: s32,
        wait_all: bool,
        nanoseconds: s64,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Creates an address arbiter"]
    #[doc = " @param[out] mutex Pointer to output the handle of the created address arbiter to."]
    #[doc = " @sa svcArbitrateAddress"]
    pub fn svcCreateAddressArbiter(arbiter: *mut Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Arbitrate an address, can be used for synchronization"]
    #[doc = " @param arbiter Handle of the arbiter"]
    #[doc = " @param addr A pointer to a s32 value."]
    #[doc = " @param type Type of action to be performed by the arbiter"]
    #[doc = " @param value Number of threads to signal if using @ref ARBITRATION_SIGNAL, or the value used for comparison."]
    #[doc = " @param timeout_ns Optional timeout in nanoseconds when using TIMEOUT actions, ignored otherwise. If not needed, use \\ref svcArbitrateAddressNoTimeout instead."]
    #[doc = " @note Usage of this syscall entails an implicit Data Memory Barrier (dmb)."]
    #[doc = " @warning Please use \\ref syncArbitrateAddressWithTimeout instead."]
    pub fn svcArbitrateAddress(
        arbiter: Handle,
        addr: u32_,
        type_: ArbitrationType,
        value: s32,
        timeout_ns: s64,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Same as \\ref svcArbitrateAddress but with the timeout_ns parameter undefined."]
    #[doc = " @param arbiter Handle of the arbiter"]
    #[doc = " @param addr A pointer to a s32 value."]
    #[doc = " @param type Type of action to be performed by the arbiter"]
    #[doc = " @param value Number of threads to signal if using @ref ARBITRATION_SIGNAL, or the value used for comparison."]
    #[doc = " @note Usage of this syscall entails an implicit Data Memory Barrier (dmb)."]
    #[doc = " @warning Please use \\ref syncArbitrateAddress instead."]
    pub fn svcArbitrateAddressNoTimeout(
        arbiter: Handle,
        addr: u32_,
        type_: ArbitrationType,
        value: s32,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Sends a synchronized request to a session handle."]
    #[doc = " @param session Handle of the session."]
    pub fn svcSendSyncRequest(session: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Connects to a port via a handle."]
    #[doc = " @param[out] clientSession Pointer to output the client session handle to."]
    #[doc = " @param clientPort Port client endpoint to connect to."]
    pub fn svcCreateSessionToPort(clientSession: *mut Handle, clientPort: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Creates a linked pair of session endpoints."]
    #[doc = " @param[out] serverSession Pointer to output the created server endpoint handle to."]
    #[doc = " @param[out] clientSession Pointer to output the created client endpoint handle to."]
    pub fn svcCreateSession(serverSession: *mut Handle, clientSession: *mut Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Accepts a session."]
    #[doc = " @param[out] session Pointer to output the created session handle to."]
    #[doc = " @param port Handle of the port to accept a session from."]
    pub fn svcAcceptSession(session: *mut Handle, port: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Replies to and receives a new request."]
    #[doc = " @param index Pointer to the index of the request."]
    #[doc = " @param handles Session handles to receive requests from."]
    #[doc = " @param handleCount Number of handles."]
    #[doc = " @param replyTarget Handle of the session to reply to."]
    pub fn svcReplyAndReceive(
        index: *mut s32,
        handles: *const Handle,
        handleCount: s32,
        replyTarget: Handle,
    ) -> Result;
}
extern "C" {
    #[doc = "@name Time"]
    #[doc = "@{"]
    #[doc = "**"]
    #[doc = "* @brief Creates a timer."]
    #[doc = "* @param[out] timer Pointer to output the handle of the created timer to."]
    #[doc = "* @param reset_type Type of reset to perform on the timer."]
    #[doc = "*/"]
    pub fn svcCreateTimer(timer: *mut Handle, reset_type: ResetType) -> Result;
}
extern "C" {
    #[doc = " @brief Sets a timer."]
    #[doc = " @param timer Handle of the timer to set."]
    #[doc = " @param initial Initial value of the timer."]
    #[doc = " @param interval Interval of the timer."]
    pub fn svcSetTimer(timer: Handle, initial: s64, interval: s64) -> Result;
}
extern "C" {
    #[doc = " @brief Cancels a timer."]
    #[doc = " @param timer Handle of the timer to cancel."]
    pub fn svcCancelTimer(timer: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Clears a timer."]
    #[doc = " @param timer Handle of the timer to clear."]
    pub fn svcClearTimer(timer: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the current system tick."]
    #[doc = " @return The current system tick."]
    pub fn svcGetSystemTick() -> u64_;
}
extern "C" {
    #[doc = "@name System"]
    #[doc = "@{"]
    #[doc = "**"]
    #[doc = "* @brief Closes a handle."]
    #[doc = "* @param handle Handle to close."]
    #[doc = "*/"]
    pub fn svcCloseHandle(handle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Duplicates a handle."]
    #[doc = " @param[out] out Pointer to output the duplicated handle to."]
    #[doc = " @param original Handle to duplicate."]
    pub fn svcDuplicateHandle(out: *mut Handle, original: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Gets a handle info."]
    #[doc = " @param[out] out Pointer to output the handle info to."]
    #[doc = " @param handle Handle to get the info for."]
    #[doc = " @param param Parameter clarifying the handle info type."]
    pub fn svcGetHandleInfo(out: *mut s64, handle: Handle, param: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the system info."]
    #[doc = " @param[out] out Pointer to output the system info to."]
    #[doc = " @param type Type of system info to retrieve."]
    #[doc = " @param param Parameter clarifying the system info type."]
    pub fn svcGetSystemInfo(out: *mut s64, type_: u32_, param: s32) -> Result;
}
extern "C" {
    #[doc = " @brief Sets the current kernel state."]
    #[doc = " @param type Type of state to set (the other parameters depend on it)."]
    pub fn svcKernelSetState(type_: u32_, ...) -> Result;
}
extern "C" {
    #[doc = " @brief Binds an event or semaphore handle to an ARM11 interrupt."]
    #[doc = " @param interruptId Interrupt identfier (see https://www.3dbrew.org/wiki/ARM11_Interrupts)."]
    #[doc = " @param eventOrSemaphore Event or semaphore handle to bind to the given interrupt."]
    #[doc = " @param priority Priority of the interrupt for the current process."]
    #[doc = " @param isManualClear Indicates whether the interrupt has to be manually cleared or not (= level-high active)."]
    pub fn svcBindInterrupt(
        interruptId: u32_,
        eventOrSemaphore: Handle,
        priority: s32,
        isManualClear: bool,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Unbinds an event or semaphore handle from an ARM11 interrupt."]
    #[doc = " @param interruptId Interrupt identfier, see (see https://www.3dbrew.org/wiki/ARM11_Interrupts)."]
    #[doc = " @param eventOrSemaphore Event or semaphore handle to unbind from the given interrupt."]
    pub fn svcUnbindInterrupt(interruptId: u32_, eventOrSemaphore: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Invalidates a process's data cache."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param addr Address to invalidate."]
    #[doc = " @param size Size of the memory to invalidate."]
    pub fn svcInvalidateProcessDataCache(process: Handle, addr: u32_, size: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Cleans a process's data cache."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param addr Address to clean."]
    #[doc = " @param size Size of the memory to clean."]
    pub fn svcStoreProcessDataCache(process: Handle, addr: u32_, size: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Flushes (cleans and invalidates) a process's data cache."]
    #[doc = " @param process Handle of the process."]
    #[doc = " @param addr Address to flush."]
    #[doc = " @param size Size of the memory to flush."]
    pub fn svcFlushProcessDataCache(process: Handle, addr: u32_, size: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Begins an inter-process DMA transfer."]
    #[doc = " @param[out] dma Pointer to output the handle of the DMA channel object to."]
    #[doc = " @param dstProcess Destination process handle."]
    #[doc = " @param dstAddr Address in the destination process to write data to."]
    #[doc = " @param srcProcess Source process handle."]
    #[doc = " @param srcAddr Address in the source to read data from."]
    #[doc = " @param size Size of the data to transfer."]
    #[doc = " @param cfg Configuration structure."]
    #[doc = " @note The handle is signaled when the transfer finishes."]
    pub fn svcStartInterProcessDma(
        dma: *mut Handle,
        dstProcess: Handle,
        dstAddr: u32_,
        srcProcess: Handle,
        srcAddr: u32_,
        size: u32_,
        cfg: *const DmaConfig,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Stops an inter-process DMA transfer."]
    #[doc = " @param dma Handle of the DMA channel object."]
    pub fn svcStopDma(dma: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the state of an inter-process DMA transfer."]
    #[doc = " @param[out] state Pointer to output the state of the DMA transfer to."]
    #[doc = " @param dma Handle of the DMA channel object."]
    pub fn svcGetDmaState(state: *mut DmaState, dma: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Restarts a DMA transfer, using the same configuration as before."]
    #[doc = " @param[out] state Pointer to output the state of the DMA transfer to."]
    #[doc = " @param dma Handle of the DMA channel object."]
    #[doc = " @param dstAddr Address in the destination process to write data to."]
    #[doc = " @param srcAddr Address in the source to read data from."]
    #[doc = " @param size Size of the data to transfer."]
    #[doc = " @param flags Restart flags, \\ref DMARST_UNLOCK and/or \\ref DMARST_RESUME_DEVICE."]
    #[doc = " @note The first transfer has to be configured with \\ref DMACFG_KEEP_LOCKED."]
    pub fn svcRestartDma(
        dma: Handle,
        dstAddr: u32_,
        srcAddr: u32_,
        size: u32_,
        flags: s8,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Sets the GPU protection register to restrict the range of the GPU DMA. 11.3+ only."]
    #[doc = " @param useApplicationRestriction Whether to use the register value used for APPLICATION titles."]
    pub fn svcSetGpuProt(useApplicationRestriction: bool) -> Result;
}
extern "C" {
    #[doc = " @brief Enables or disables Wi-Fi. 11.4+ only."]
    #[doc = " @param enabled Whether to enable or disable Wi-Fi."]
    pub fn svcSetWifiEnabled(enabled: bool) -> Result;
}
extern "C" {
    #[doc = "@name Debugging"]
    #[doc = "@{"]
    #[doc = "**"]
    #[doc = "* @brief Breaks execution."]
    #[doc = "* @param breakReason Reason for breaking."]
    #[doc = "*/"]
    pub fn svcBreak(breakReason: UserBreakType);
}
extern "C" {
    #[doc = " @brief Outputs a debug string."]
    #[doc = " @param str String to output."]
    #[doc = " @param length Length of the string to output, needs to be positive."]
    pub fn svcOutputDebugString(str_: *const crate::os::raw::c_char, length: s32) -> Result;
}
extern "C" {
    #[doc = " @brief Controls performance monitoring on the CP15 interface and the SCU."]
    #[doc = " The meaning of the parameters depend on the operation."]
    #[doc = " @param[out] out Output."]
    #[doc = " @param op Operation, see details."]
    #[doc = " @param param1 First parameter."]
    #[doc = " @param param2 Second parameter."]
    #[doc = " @details The operations are the following:"]
    #[doc = "     - \\ref PERFCOUNTEROP_ENABLE (void) -> void, tries to enable and lock perfmon. functionality."]
    #[doc = "     - \\ref PERFCOUNTEROP_DISABLE (void) -> void, disable and forcibly unlocks perfmon. functionality."]
    #[doc = "     - \\ref PERFCOUNTEROP_GET_VALUE (\\ref PerfCounterRegister reg) -> u64, gets the value of a particular counter register."]
    #[doc = "     - \\ref PERFCOUNTEROP_SET_VALUE (\\ref PerfCounterRegister reg, u64 value) -> void, sets the value of a particular counter register."]
    #[doc = "     - \\ref PERFCOUNTEROP_GET_OVERFLOW_FLAGS (void) -> u32, gets the overflow flags of all CP15 and SCU registers."]
    #[doc = "         - Format is a bitfield of \\ref PerfCounterRegister."]
    #[doc = "     - \\ref PERFCOUNTEROP_RESET (u32 valueResetMask, u32 overflowFlagResetMask) -> void, resets the value and/or"]
    #[doc = "     overflow flags of selected registers."]
    #[doc = "         - Format is two bitfields of \\ref PerfCounterRegister."]
    #[doc = "     - \\ref PERFCOUNTEROP_GET_EVENT (\\ref PerfCounterRegister reg) -> \\ref PerfCounterEvent, gets the event associated"]
    #[doc = "     to a particular counter register."]
    #[doc = "     - \\ref PERFCOUNTEROP_SET_EVENT (\\ref PerfCounterRegister reg, \\ref PerfCounterEvent) -> void, sets the event associated"]
    #[doc = "     to a particular counter register."]
    #[doc = "     - \\ref PERFCOUNTEROP_SET_VIRTUAL_COUNTER_ENABLED (bool enabled) -> void, (dis)allows the kernel to track counter overflows"]
    #[doc = "     and to use 64-bit counter values."]
    pub fn svcControlPerformanceCounter(
        out: *mut u64_,
        op: PerfCounterOperation,
        param1: u32_,
        param2: u64_,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Creates a debug handle for an active process."]
    #[doc = " @param[out] debug Pointer to output the created debug handle to."]
    #[doc = " @param processId ID of the process to debug."]
    pub fn svcDebugActiveProcess(debug: *mut Handle, processId: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Breaks a debugged process."]
    #[doc = " @param debug Debug handle of the process."]
    pub fn svcBreakDebugProcess(debug: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Terminates a debugged process."]
    #[doc = " @param debug Debug handle of the process."]
    pub fn svcTerminateDebugProcess(debug: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the current debug event of a debugged process."]
    #[doc = " @param[out] info Pointer to output the debug event information to."]
    #[doc = " @param debug Debug handle of the process."]
    pub fn svcGetProcessDebugEvent(info: *mut DebugEventInfo, debug: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Continues the current debug event of a debugged process (not necessarily the same as @ref svcGetProcessDebugEvent)."]
    #[doc = " @param debug Debug handle of the process."]
    #[doc = " @param flags Flags to continue with, see @ref DebugFlags."]
    pub fn svcContinueDebugEvent(debug: Handle, flags: DebugFlags) -> Result;
}
extern "C" {
    #[doc = " @brief Fetches the saved registers of a thread, either inactive or awaiting @ref svcContinueDebugEvent, belonging to a debugged process."]
    #[doc = " @param[out] context Values of the registers to fetch, see @ref ThreadContext."]
    #[doc = " @param debug Debug handle of the parent process."]
    #[doc = " @param threadId ID of the thread to fetch the saved registers of."]
    #[doc = " @param controlFlags Which registers to fetch, see @ref ThreadContextControlFlags."]
    pub fn svcGetDebugThreadContext(
        context: *mut ThreadContext,
        debug: Handle,
        threadId: u32_,
        controlFlags: ThreadContextControlFlags,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Updates the saved registers of a thread, either inactive or awaiting @ref svcContinueDebugEvent, belonging to a debugged process."]
    #[doc = " @param debug Debug handle of the parent process."]
    #[doc = " @param threadId ID of the thread to update the saved registers of."]
    #[doc = " @param context Values of the registers to update, see @ref ThreadContext."]
    #[doc = " @param controlFlags Which registers to update, see @ref ThreadContextControlFlags."]
    pub fn svcSetDebugThreadContext(
        debug: Handle,
        threadId: u32_,
        context: *mut ThreadContext,
        controlFlags: ThreadContextControlFlags,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Queries memory information of a debugged process."]
    #[doc = " @param[out] info Pointer to output memory info to."]
    #[doc = " @param[out] out Pointer to output page info to."]
    #[doc = " @param debug Debug handle of the process to query memory from."]
    #[doc = " @param addr Virtual memory address to query."]
    pub fn svcQueryDebugProcessMemory(
        info: *mut MemInfo,
        out: *mut PageInfo,
        debug: Handle,
        addr: u32_,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Reads from a debugged process's memory."]
    #[doc = " @param buffer Buffer to read data to."]
    #[doc = " @param debug Debug handle of the process."]
    #[doc = " @param addr Address to read from."]
    #[doc = " @param size Size of the memory to read."]
    pub fn svcReadProcessMemory(
        buffer: *mut crate::os::raw::c_void,
        debug: Handle,
        addr: u32_,
        size: u32_,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Writes to a debugged process's memory."]
    #[doc = " @param debug Debug handle of the process."]
    #[doc = " @param buffer Buffer to write data from."]
    #[doc = " @param addr Address to write to."]
    #[doc = " @param size Size of the memory to write."]
    pub fn svcWriteProcessMemory(
        debug: Handle,
        buffer: *const crate::os::raw::c_void,
        addr: u32_,
        size: u32_,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Sets an hardware breakpoint or watchpoint. This is an interface to the BRP/WRP registers, see http://infocenter.arm.com/help/topic/com.arm.doc.ddi0360f/CEGEBGFC.html ."]
    #[doc = " @param registerId range 0..5 = breakpoints (BRP0-5), 0x100..0x101 = watchpoints (WRP0-1). The previous stop point for the register is disabled."]
    #[doc = " @param control Value of the control regiser."]
    #[doc = " @param value Value of the value register: either and address (if bit21 of control is clear) or the debug handle of a process to fetch the context ID of."]
    pub fn svcSetHardwareBreakPoint(registerId: s32, control: u32_, value: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Gets a debugged thread's parameter."]
    #[doc = " @param[out] unused Unused."]
    #[doc = " @param[out] out Output value."]
    #[doc = " @param debug Debug handle of the process."]
    #[doc = " @param threadId ID of the thread"]
    #[doc = " @param parameter Parameter to fetch, see @ref DebugThreadParameter."]
    pub fn svcGetDebugThreadParam(
        unused: *mut s64,
        out: *mut u32_,
        debug: Handle,
        threadId: u32_,
        parameter: DebugThreadParameter,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Executes a function in supervisor mode."]
    #[doc = " @param callback Function to execute."]
    pub fn svcBackdoor(callback: crate::option::Option<unsafe extern "C" fn() -> s32>) -> Result;
}
#[doc = "< Mount \"nand:/\""]
pub const ARM9DESC_MOUNT_NAND: crate::os::raw::c_uint = 1;
#[doc = "< Mount nand:/ro/ as read-write"]
pub const ARM9DESC_MOUNT_NANDRO_RW: crate::os::raw::c_uint = 2;
#[doc = "< Mount \"twln:/\""]
pub const ARM9DESC_MOUNT_TWLN: crate::os::raw::c_uint = 4;
#[doc = "< Mount \"wnand:/\""]
pub const ARM9DESC_MOUNT_WNAND: crate::os::raw::c_uint = 8;
#[doc = "< Mount \"cardspi:/\""]
pub const ARM9DESC_MOUNT_CARDSPI: crate::os::raw::c_uint = 16;
#[doc = "< Use SDIF3"]
pub const ARM9DESC_USE_SDIF3: crate::os::raw::c_uint = 32;
#[doc = "< Create seed (movable.sed)"]
pub const ARM9DESC_CREATE_SEED: crate::os::raw::c_uint = 64;
#[doc = "< Use card SPI, required by multiple pxi:dev commands"]
pub const ARM9DESC_USE_CARD_SPI: crate::os::raw::c_uint = 128;
#[doc = "< SD application (not checked)"]
pub const ARM9DESC_SD_APPLICATION: crate::os::raw::c_uint = 256;
#[doc = "< Mount \"sdmc:/\" as read-write"]
pub const ARM9DESC_MOUNT_SDMC_RW: crate::os::raw::c_uint = 512;
#[doc = " ARM9 descriptor flags"]
pub type _bindgen_ty_7 = crate::os::raw::c_uint;
#[doc = "< Category \"system application\""]
pub const FSACCESS_CATEGORY_SYSTEM_APPLICATION: crate::os::raw::c_uint = 1;
#[doc = "< Category \"hardware check\""]
pub const FSACCESS_CATEGORY_HARDWARE_CHECK: crate::os::raw::c_uint = 2;
#[doc = "< Category \"filesystem tool\""]
pub const FSACCESS_CATEGORY_FILESYSTEM_TOOL: crate::os::raw::c_uint = 4;
#[doc = "< Debug"]
pub const FSACCESS_DEBUG: crate::os::raw::c_uint = 8;
#[doc = "< TWLCARD backup"]
pub const FSACCESS_TWLCARD_BACKUP: crate::os::raw::c_uint = 16;
#[doc = "< TWLNAND data"]
pub const FSACCESS_TWLNAND_DATA: crate::os::raw::c_uint = 32;
#[doc = "< BOSS (SpotPass)"]
pub const FSACCESS_BOSS: crate::os::raw::c_uint = 64;
#[doc = "< SDMC (read-write)"]
pub const FSACCESS_SDMC_RW: crate::os::raw::c_uint = 128;
#[doc = "< Core"]
pub const FSACCESS_CORE: crate::os::raw::c_uint = 256;
#[doc = "< nand:/ro/ (read-only)"]
pub const FSACCESS_NANDRO_RO: crate::os::raw::c_uint = 512;
#[doc = "< nand:/rw/"]
pub const FSACCESS_NANDRW: crate::os::raw::c_uint = 1024;
#[doc = "< nand:/ro/ (read-write)"]
pub const FSACCESS_NANDRO_RW: crate::os::raw::c_uint = 2048;
#[doc = "< Category \"System Settings\""]
pub const FSACCESS_CATEGORY_SYSTEM_SETTINGS: crate::os::raw::c_uint = 4096;
#[doc = "< Cardboard (System Transfer)"]
pub const FSACCESS_CARDBOARD: crate::os::raw::c_uint = 8192;
#[doc = "< Export/Import IVs (movable.sed)"]
pub const FSACCESS_EXPORT_IMPORT_IVS: crate::os::raw::c_uint = 16384;
#[doc = "< SDMC (write-only)"]
pub const FSACCESS_SDMC_WO: crate::os::raw::c_uint = 32768;
#[doc = "< \"Switch cleanup\" (3.0+)"]
pub const FSACCESS_SWITCH_CLEANUP: crate::os::raw::c_uint = 65536;
#[doc = "< Savedata move (5.0+)"]
pub const FSACCESS_SAVEDATA_MOVE: crate::os::raw::c_uint = 131072;
#[doc = "< Shop (5.0+)"]
pub const FSACCESS_SHOP: crate::os::raw::c_uint = 262144;
#[doc = "< Shop (5.0+)"]
pub const FSACCESS_SHELL: crate::os::raw::c_uint = 524288;
#[doc = "< Category \"Home Menu\" (6.0+)"]
pub const FSACCESS_CATEGORY_HOME_MENU: crate::os::raw::c_uint = 1048576;
#[doc = "< Seed DB (9.6+)"]
pub const FSACCESS_SEEDDB: crate::os::raw::c_uint = 2097152;
#[doc = " Filesystem access flags"]
pub type _bindgen_ty_8 = crate::os::raw::c_uint;
#[doc = "< Regular application"]
pub const ResourceLimitCategory_RESLIMIT_CATEGORY_APPLICATION: ResourceLimitCategory = 0;
#[doc = "< System applet"]
pub const ResourceLimitCategory_RESLIMIT_CATEGORY_SYS_APPLET: ResourceLimitCategory = 1;
#[doc = "< Library applet"]
pub const ResourceLimitCategory_RESLIMIT_CATEGORY_LIB_APPLET: ResourceLimitCategory = 2;
#[doc = "< System modules running inside the BASE memregion"]
pub const ResourceLimitCategory_RESLIMIT_CATEGORY_OTHER: ResourceLimitCategory = 3;
#[doc = " The resource limit category of a title"]
pub type ResourceLimitCategory = crate::os::raw::c_uint;
#[doc = "< 64MB of usable application memory"]
pub const SystemMode_SYSMODE_O3DS_PROD: SystemMode = 0;
#[doc = "< 124MB of usable application memory. Unusable on O3DS"]
pub const SystemMode_SYSMODE_N3DS_PROD: SystemMode = 1;
#[doc = "< 97MB/178MB of usable application memory"]
pub const SystemMode_SYSMODE_DEV1: SystemMode = 2;
#[doc = "< 80MB/124MB of usable application memory"]
pub const SystemMode_SYSMODE_DEV2: SystemMode = 3;
#[doc = "< 72MB of usable application memory. Same as \"Prod\" on N3DS"]
pub const SystemMode_SYSMODE_DEV3: SystemMode = 4;
#[doc = "< 32MB of usable application memory. Same as \"Prod\" on N3DS"]
pub const SystemMode_SYSMODE_DEV4: SystemMode = 5;
#[doc = " The system mode a title should be launched under"]
pub type SystemMode = crate::os::raw::c_uint;
#[doc = " The system info flags and remaster version of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_SystemInfoFlags {
    #[doc = "< Reserved"]
    pub reserved: [u8_; 5usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "< Remaster version"]
    pub remaster_version: u16_,
}
#[test]
fn bindgen_test_layout_ExHeader_SystemInfoFlags() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_SystemInfoFlags>(),
        8usize,
        concat!("Size of: ", stringify!(ExHeader_SystemInfoFlags))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_SystemInfoFlags>(),
        2usize,
        concat!("Alignment of ", stringify!(ExHeader_SystemInfoFlags))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_SystemInfoFlags>())).reserved as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_SystemInfoFlags),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_SystemInfoFlags>())).remaster_version as *const _
                as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_SystemInfoFlags),
            "::",
            stringify!(remaster_version)
        )
    );
}
impl ExHeader_SystemInfoFlags {
    #[inline]
    pub fn compress_exefs_code(&self) -> bool {
        unsafe { crate::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }

    #[inline]
    pub fn set_compress_exefs_code(&mut self, val: bool) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }

    #[inline]
    pub fn is_sd_application(&self) -> bool {
        unsafe { crate::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }

    #[inline]
    pub fn set_is_sd_application(&mut self, val: bool) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }

    #[inline]
    pub fn new_bitfield_1(
        compress_exefs_code: bool,
        is_sd_application: bool,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let compress_exefs_code: u8 = unsafe { crate::mem::transmute(compress_exefs_code) };
            compress_exefs_code as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_sd_application: u8 = unsafe { crate::mem::transmute(is_sd_application) };
            is_sd_application as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Information about a title's section"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_CodeSectionInfo {
    #[doc = "< The address of the section"]
    pub address: u32_,
    #[doc = "< The number of pages the section occupies"]
    pub num_pages: u32_,
    #[doc = "< The size of the section"]
    pub size: u32_,
}
#[test]
fn bindgen_test_layout_ExHeader_CodeSectionInfo() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_CodeSectionInfo>(),
        12usize,
        concat!("Size of: ", stringify!(ExHeader_CodeSectionInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_CodeSectionInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ExHeader_CodeSectionInfo))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_CodeSectionInfo>())).address as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSectionInfo),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_CodeSectionInfo>())).num_pages as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSectionInfo),
            "::",
            stringify!(num_pages)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSectionInfo>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSectionInfo),
            "::",
            stringify!(size)
        )
    );
}
#[doc = " The name of a title and infomation about its section"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_CodeSetInfo {
    #[doc = "< Title name"]
    pub name: [crate::os::raw::c_char; 8usize],
    #[doc = "< System info flags, see @ref ExHeader_SystemInfoFlags"]
    pub flags: ExHeader_SystemInfoFlags,
    #[doc = "< .text section info, see @ref ExHeader_CodeSectionInfo"]
    pub text: ExHeader_CodeSectionInfo,
    #[doc = "< Stack size"]
    pub stack_size: u32_,
    #[doc = "< .rodata section info, see @ref ExHeader_CodeSectionInfo"]
    pub rodata: ExHeader_CodeSectionInfo,
    #[doc = "< Reserved"]
    pub reserved: u32_,
    #[doc = "< .data section info, see @ref ExHeader_CodeSectionInfo"]
    pub data: ExHeader_CodeSectionInfo,
    #[doc = "< .bss section size"]
    pub bss_size: u32_,
}
#[test]
fn bindgen_test_layout_ExHeader_CodeSetInfo() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_CodeSetInfo>(),
        64usize,
        concat!("Size of: ", stringify!(ExHeader_CodeSetInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_CodeSetInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ExHeader_CodeSetInfo))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSetInfo>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSetInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSetInfo>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSetInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSetInfo>())).text as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSetInfo),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSetInfo>())).stack_size as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSetInfo),
            "::",
            stringify!(stack_size)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSetInfo>())).rodata as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSetInfo),
            "::",
            stringify!(rodata)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSetInfo>())).reserved as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSetInfo),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSetInfo>())).data as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSetInfo),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_CodeSetInfo>())).bss_size as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_CodeSetInfo),
            "::",
            stringify!(bss_size)
        )
    );
}
#[doc = " The savedata size and jump ID of a title"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExHeader_SystemInfo {
    #[doc = "< Savedata size"]
    pub savedata_size: u64_,
    #[doc = "< Jump ID"]
    pub jump_id: u64_,
    #[doc = "< Reserved"]
    pub reserved: [u8_; 48usize],
}
#[test]
fn bindgen_test_layout_ExHeader_SystemInfo() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_SystemInfo>(),
        64usize,
        concat!("Size of: ", stringify!(ExHeader_SystemInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_SystemInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ExHeader_SystemInfo))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_SystemInfo>())).savedata_size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_SystemInfo),
            "::",
            stringify!(savedata_size)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_SystemInfo>())).jump_id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_SystemInfo),
            "::",
            stringify!(jump_id)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_SystemInfo>())).reserved as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_SystemInfo),
            "::",
            stringify!(reserved)
        )
    );
}
#[doc = " The code set info, dependencies and system info of a title (SCI)"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExHeader_SystemControlInfo {
    #[doc = "< Code set info, see @ref ExHeader_CodeSetInfo"]
    pub codeset_info: ExHeader_CodeSetInfo,
    #[doc = "< Title IDs of the titles that this program depends on"]
    pub dependencies: [u64_; 48usize],
    #[doc = "< System info, see @ref ExHeader_SystemInfo"]
    pub system_info: ExHeader_SystemInfo,
}
#[test]
fn bindgen_test_layout_ExHeader_SystemControlInfo() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_SystemControlInfo>(),
        512usize,
        concat!("Size of: ", stringify!(ExHeader_SystemControlInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_SystemControlInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ExHeader_SystemControlInfo))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_SystemControlInfo>())).codeset_info as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_SystemControlInfo),
            "::",
            stringify!(codeset_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_SystemControlInfo>())).dependencies as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_SystemControlInfo),
            "::",
            stringify!(dependencies)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_SystemControlInfo>())).system_info as *const _ as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_SystemControlInfo),
            "::",
            stringify!(system_info)
        )
    );
}
#[doc = " The ARM11 filesystem info of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_Arm11StorageInfo {
    #[doc = "< Extdata ID"]
    pub extdata_id: u64_,
    #[doc = "< IDs of the system savedata accessible by the title"]
    pub system_savedata_ids: [u32_; 2usize],
    #[doc = "< IDs of the savedata accessible by the title, 20 bits each, followed by \"Use other variation savedata\""]
    pub accessible_savedata_ids: u64_,
    #[doc = "< FS access flags"]
    pub fs_access_info: u32_,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_ExHeader_Arm11StorageInfo() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_Arm11StorageInfo>(),
        32usize,
        concat!("Size of: ", stringify!(ExHeader_Arm11StorageInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_Arm11StorageInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ExHeader_Arm11StorageInfo))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11StorageInfo>())).extdata_id as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11StorageInfo),
            "::",
            stringify!(extdata_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11StorageInfo>())).system_savedata_ids as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11StorageInfo),
            "::",
            stringify!(system_savedata_ids)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11StorageInfo>())).accessible_savedata_ids
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11StorageInfo),
            "::",
            stringify!(accessible_savedata_ids)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11StorageInfo>())).fs_access_info as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11StorageInfo),
            "::",
            stringify!(fs_access_info)
        )
    );
}
impl ExHeader_Arm11StorageInfo {
    #[inline]
    pub fn reserved(&self) -> u32_ {
        unsafe { crate::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }

    #[inline]
    pub fn set_reserved(&mut self, val: u32_) {
        unsafe {
            let val: u32 = crate::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }

    #[inline]
    pub fn no_romfs(&self) -> bool {
        unsafe { crate::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }

    #[inline]
    pub fn set_no_romfs(&mut self, val: bool) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }

    #[inline]
    pub fn use_extended_savedata_access(&self) -> bool {
        unsafe { crate::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }

    #[inline]
    pub fn set_use_extended_savedata_access(&mut self, val: bool) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }

    #[inline]
    pub fn new_bitfield_1(
        reserved: u32_,
        no_romfs: bool,
        use_extended_savedata_access: bool,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let reserved: u32 = unsafe { crate::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let no_romfs: u8 = unsafe { crate::mem::transmute(no_romfs) };
            no_romfs as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let use_extended_savedata_access: u8 =
                unsafe { crate::mem::transmute(use_extended_savedata_access) };
            use_extended_savedata_access as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " The CPU-related and memory-layout-related info of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_Arm11CoreInfo {
    #[doc = "< The low title ID of the target firmware"]
    pub core_version: u32_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    #[doc = "< The priority of the title's main thread"]
    pub priority: u8_,
}
#[test]
fn bindgen_test_layout_ExHeader_Arm11CoreInfo() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_Arm11CoreInfo>(),
        8usize,
        concat!("Size of: ", stringify!(ExHeader_Arm11CoreInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_Arm11CoreInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ExHeader_Arm11CoreInfo))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11CoreInfo>())).core_version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11CoreInfo),
            "::",
            stringify!(core_version)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_Arm11CoreInfo>())).priority as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11CoreInfo),
            "::",
            stringify!(priority)
        )
    );
}
impl ExHeader_Arm11CoreInfo {
    #[inline]
    pub fn use_cpu_clockrate_804MHz(&self) -> bool {
        unsafe { crate::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }

    #[inline]
    pub fn set_use_cpu_clockrate_804MHz(&mut self, val: bool) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }

    #[inline]
    pub fn enable_l2c(&self) -> bool {
        unsafe { crate::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }

    #[inline]
    pub fn set_enable_l2c(&mut self, val: bool) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }

    #[inline]
    pub fn flag1_unused(&self) -> u8_ {
        unsafe { crate::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }

    #[inline]
    pub fn set_flag1_unused(&mut self, val: u8_) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }

    #[inline]
    pub fn n3ds_system_mode(&self) -> SystemMode {
        unsafe { crate::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }

    #[inline]
    pub fn set_n3ds_system_mode(&mut self, val: SystemMode) {
        unsafe {
            let val: u32 = crate::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }

    #[inline]
    pub fn flag2_unused(&self) -> u8_ {
        unsafe { crate::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u8) }
    }

    #[inline]
    pub fn set_flag2_unused(&mut self, val: u8_) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }

    #[inline]
    pub fn ideal_processor(&self) -> u8_ {
        unsafe { crate::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u8) }
    }

    #[inline]
    pub fn set_ideal_processor(&mut self, val: u8_) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }

    #[inline]
    pub fn affinity_mask(&self) -> u8_ {
        unsafe { crate::mem::transmute(self._bitfield_1.get(18usize, 2u8) as u8) }
    }

    #[inline]
    pub fn set_affinity_mask(&mut self, val: u8_) {
        unsafe {
            let val: u8 = crate::mem::transmute(val);
            self._bitfield_1.set(18usize, 2u8, val as u64)
        }
    }

    #[inline]
    pub fn o3ds_system_mode(&self) -> SystemMode {
        unsafe { crate::mem::transmute(self._bitfield_1.get(20usize, 4u8) as u32) }
    }

    #[inline]
    pub fn set_o3ds_system_mode(&mut self, val: SystemMode) {
        unsafe {
            let val: u32 = crate::mem::transmute(val);
            self._bitfield_1.set(20usize, 4u8, val as u64)
        }
    }

    #[inline]
    pub fn new_bitfield_1(
        use_cpu_clockrate_804MHz: bool,
        enable_l2c: bool,
        flag1_unused: u8_,
        n3ds_system_mode: SystemMode,
        flag2_unused: u8_,
        ideal_processor: u8_,
        affinity_mask: u8_,
        o3ds_system_mode: SystemMode,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let use_cpu_clockrate_804MHz: u8 =
                unsafe { crate::mem::transmute(use_cpu_clockrate_804MHz) };
            use_cpu_clockrate_804MHz as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enable_l2c: u8 = unsafe { crate::mem::transmute(enable_l2c) };
            enable_l2c as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let flag1_unused: u8 = unsafe { crate::mem::transmute(flag1_unused) };
            flag1_unused as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let n3ds_system_mode: u32 = unsafe { crate::mem::transmute(n3ds_system_mode) };
            n3ds_system_mode as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let flag2_unused: u8 = unsafe { crate::mem::transmute(flag2_unused) };
            flag2_unused as u64
        });
        __bindgen_bitfield_unit.set(16usize, 2u8, {
            let ideal_processor: u8 = unsafe { crate::mem::transmute(ideal_processor) };
            ideal_processor as u64
        });
        __bindgen_bitfield_unit.set(18usize, 2u8, {
            let affinity_mask: u8 = unsafe { crate::mem::transmute(affinity_mask) };
            affinity_mask as u64
        });
        __bindgen_bitfield_unit.set(20usize, 4u8, {
            let o3ds_system_mode: u32 = unsafe { crate::mem::transmute(o3ds_system_mode) };
            o3ds_system_mode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " The ARM11 system-local capabilities of a title"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExHeader_Arm11SystemLocalCapabilities {
    #[doc = "< Title ID"]
    pub title_id: u64_,
    #[doc = "< Core info, see @ref ExHeader_Arm11CoreInfo"]
    pub core_info: ExHeader_Arm11CoreInfo,
    #[doc = "< Resource limit descriptors, only \"CpuTime\" (first byte) sems to be used"]
    pub reslimits: [u16_; 16usize],
    #[doc = "< Storage info, see @ref ExHeader_Arm11StorageInfo"]
    pub storage_info: ExHeader_Arm11StorageInfo,
    #[doc = "< List of the services the title has access to. Limited to 32 prior to system version 9.3"]
    pub service_access: [[crate::os::raw::c_char; 8usize]; 34usize],
    #[doc = "< Reserved"]
    pub reserved: [u8_; 15usize],
    #[doc = "< Resource limit category, see @ref ExHeader_Arm11SystemLocalCapabilities"]
    pub reslimit_category: ResourceLimitCategory,
}
#[test]
fn bindgen_test_layout_ExHeader_Arm11SystemLocalCapabilities() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_Arm11SystemLocalCapabilities>(),
        376usize,
        concat!(
            "Size of: ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities)
        )
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_Arm11SystemLocalCapabilities>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11SystemLocalCapabilities>())).title_id as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities),
            "::",
            stringify!(title_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11SystemLocalCapabilities>())).core_info as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities),
            "::",
            stringify!(core_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11SystemLocalCapabilities>())).reslimits as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities),
            "::",
            stringify!(reslimits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11SystemLocalCapabilities>())).storage_info
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities),
            "::",
            stringify!(storage_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11SystemLocalCapabilities>())).service_access
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities),
            "::",
            stringify!(service_access)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11SystemLocalCapabilities>())).reserved as *const _
                as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11SystemLocalCapabilities>())).reslimit_category
                as *const _ as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11SystemLocalCapabilities),
            "::",
            stringify!(reslimit_category)
        )
    );
}
#[doc = " The ARM11 kernel capabilities of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_Arm11KernelCapabilities {
    #[doc = "< ARM11 kernel descriptors, see 3dbrew"]
    pub descriptors: [u32_; 28usize],
    #[doc = "< Reserved"]
    pub reserved: [u8_; 16usize],
}
#[test]
fn bindgen_test_layout_ExHeader_Arm11KernelCapabilities() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_Arm11KernelCapabilities>(),
        128usize,
        concat!("Size of: ", stringify!(ExHeader_Arm11KernelCapabilities))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_Arm11KernelCapabilities>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ExHeader_Arm11KernelCapabilities)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11KernelCapabilities>())).descriptors as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11KernelCapabilities),
            "::",
            stringify!(descriptors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm11KernelCapabilities>())).reserved as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm11KernelCapabilities),
            "::",
            stringify!(reserved)
        )
    );
}
#[doc = " The ARM9 access control of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_Arm9AccessControl {
    #[doc = "< Process9 FS descriptors, see 3dbrew"]
    pub descriptors: [u8_; 15usize],
    #[doc = "< Descriptor version"]
    pub descriptor_version: u8_,
}
#[test]
fn bindgen_test_layout_ExHeader_Arm9AccessControl() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_Arm9AccessControl>(),
        16usize,
        concat!("Size of: ", stringify!(ExHeader_Arm9AccessControl))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_Arm9AccessControl>(),
        1usize,
        concat!("Alignment of ", stringify!(ExHeader_Arm9AccessControl))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm9AccessControl>())).descriptors as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm9AccessControl),
            "::",
            stringify!(descriptors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_Arm9AccessControl>())).descriptor_version as *const _
                as usize
        },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Arm9AccessControl),
            "::",
            stringify!(descriptor_version)
        )
    );
}
#[doc = " The access control information of a title"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExHeader_AccessControlInfo {
    #[doc = "< ARM11 system-local capabilities, see @ref ExHeader_Arm11SystemLocalCapabilities"]
    pub local_caps: ExHeader_Arm11SystemLocalCapabilities,
    #[doc = "< ARM11 kernel capabilities, see @ref ExHeader_Arm11SystemLocalCapabilities"]
    pub kernel_caps: ExHeader_Arm11KernelCapabilities,
    #[doc = "< ARM9 access control, see @ref ExHeader_Arm9AccessControl"]
    pub access_control: ExHeader_Arm9AccessControl,
}
#[test]
fn bindgen_test_layout_ExHeader_AccessControlInfo() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_AccessControlInfo>(),
        520usize,
        concat!("Size of: ", stringify!(ExHeader_AccessControlInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_AccessControlInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ExHeader_AccessControlInfo))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_AccessControlInfo>())).local_caps as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_AccessControlInfo),
            "::",
            stringify!(local_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_AccessControlInfo>())).kernel_caps as *const _ as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_AccessControlInfo),
            "::",
            stringify!(kernel_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_AccessControlInfo>())).access_control as *const _
                as usize
        },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_AccessControlInfo),
            "::",
            stringify!(access_control)
        )
    );
}
#[doc = " Main extended header data, as returned by PXIPM, Loader and FSREG service commands"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExHeader_Info {
    #[doc = "< System control info, see @ref ExHeader_SystemControlInfo"]
    pub sci: ExHeader_SystemControlInfo,
    #[doc = "< Access control info, see @ref ExHeader_AccessControlInfo"]
    pub aci: ExHeader_AccessControlInfo,
}
#[test]
fn bindgen_test_layout_ExHeader_Info() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_Info>(),
        1032usize,
        concat!("Size of: ", stringify!(ExHeader_Info))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_Info>(),
        8usize,
        concat!("Alignment of ", stringify!(ExHeader_Info))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_Info>())).sci as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Info),
            "::",
            stringify!(sci)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_Info>())).aci as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_Info),
            "::",
            stringify!(aci)
        )
    );
}
#[doc = " Extended header access descriptor"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExHeader_AccessDescriptor {
    #[doc = "< The signature of the access descriptor (RSA-2048-SHA256)"]
    pub signature: [u8_; 256usize],
    #[doc = "< The modulus used for the above signature, with 65537 as public exponent"]
    pub ncchModulus: [u8_; 256usize],
    #[doc = "< This is compared for equality with the first ACI by Process9, see @ref ExHeader_AccessControlInfo"]
    pub acli: ExHeader_AccessControlInfo,
}
#[test]
fn bindgen_test_layout_ExHeader_AccessDescriptor() {
    assert_eq!(
        crate::mem::size_of::<ExHeader_AccessDescriptor>(),
        1032usize,
        concat!("Size of: ", stringify!(ExHeader_AccessDescriptor))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader_AccessDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(ExHeader_AccessDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_AccessDescriptor>())).signature as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_AccessDescriptor),
            "::",
            stringify!(signature)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ExHeader_AccessDescriptor>())).ncchModulus as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_AccessDescriptor),
            "::",
            stringify!(ncchModulus)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader_AccessDescriptor>())).acli as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader_AccessDescriptor),
            "::",
            stringify!(acli)
        )
    );
}
#[doc = " The NCCH Extended Header of a title"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExHeader {
    #[doc = "< Main extended header data, see @ref ExHeader_Info"]
    pub info: ExHeader_Info,
    #[doc = "< Access descriptor, see @ref ExHeader_AccessDescriptor"]
    pub access_descriptor: ExHeader_AccessDescriptor,
}
#[test]
fn bindgen_test_layout_ExHeader() {
    assert_eq!(
        crate::mem::size_of::<ExHeader>(),
        2064usize,
        concat!("Size of: ", stringify!(ExHeader))
    );
    assert_eq!(
        crate::mem::align_of::<ExHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(ExHeader))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader>())).info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ExHeader>())).access_descriptor as *const _ as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(ExHeader),
            "::",
            stringify!(access_descriptor)
        )
    );
}
extern "C" {
    #[doc = " Initializes the service API."]
    pub fn srvInit() -> Result;
}
extern "C" {
    #[doc = " Exits the service API."]
    pub fn srvExit();
}
extern "C" {
    #[doc = " @brief Makes srvGetServiceHandle non-blocking for the current thread (or blocking, the default), in case of unavailable (full) requested services."]
    #[doc = " @param blocking Whether srvGetServiceHandle should be non-blocking."]
    #[doc = "                 srvGetServiceHandle will always block if the service hasn't been registered yet,"]
    #[doc = "                 use srvIsServiceRegistered to check whether that is the case or not."]
    pub fn srvSetBlockingPolicy(nonBlocking: bool);
}
extern "C" {
    #[doc = " @brief Gets the current service API session handle."]
    #[doc = " @return The current service API session handle."]
    pub fn srvGetSessionHandle() -> *mut Handle;
}
extern "C" {
    #[doc = " @brief Retrieves a service handle, retrieving from the environment handle list if possible."]
    #[doc = " @param out Pointer to write the handle to."]
    #[doc = " @param name Name of the service."]
    #[doc = " @return 0 if no error occured,"]
    #[doc = "         0xD8E06406 if the caller has no right to access the service,"]
    #[doc = "         0xD0401834 if the requested service port is full and srvGetServiceHandle is non-blocking (see @ref srvSetBlockingPolicy)."]
    pub fn srvGetServiceHandle(out: *mut Handle, name: *const crate::os::raw::c_char) -> Result;
}
extern "C" {
    #[doc = " Registers the current process as a client to the service API."]
    pub fn srvRegisterClient() -> Result;
}
extern "C" {
    #[doc = " @brief Enables service notificatios, returning a notification semaphore."]
    #[doc = " @param semaphoreOut Pointer to output the notification semaphore to."]
    pub fn srvEnableNotification(semaphoreOut: *mut Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Registers the current process as a service."]
    #[doc = " @param out Pointer to write the service handle to."]
    #[doc = " @param name Name of the service."]
    #[doc = " @param maxSessions Maximum number of sessions the service can handle."]
    pub fn srvRegisterService(
        out: *mut Handle,
        name: *const crate::os::raw::c_char,
        maxSessions: crate::os::raw::c_int,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Unregisters the current process as a service."]
    #[doc = " @param name Name of the service."]
    pub fn srvUnregisterService(name: *const crate::os::raw::c_char) -> Result;
}
extern "C" {
    #[doc = " @brief Retrieves a service handle."]
    #[doc = " @param out Pointer to output the handle to."]
    #[doc = " @param name Name of the service."]
    #[doc = " * @return 0 if no error occured,"]
    #[doc = "           0xD8E06406 if the caller has no right to access the service,"]
    #[doc = "           0xD0401834 if the requested service port is full and srvGetServiceHandle is non-blocking (see @ref srvSetBlockingPolicy)."]
    pub fn srvGetServiceHandleDirect(
        out: *mut Handle,
        name: *const crate::os::raw::c_char,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Registers a port."]
    #[doc = " @param name Name of the port."]
    #[doc = " @param clientHandle Client handle of the port."]
    pub fn srvRegisterPort(name: *const crate::os::raw::c_char, clientHandle: Handle) -> Result;
}
extern "C" {
    #[doc = " @brief Unregisters a port."]
    #[doc = " @param name Name of the port."]
    pub fn srvUnregisterPort(name: *const crate::os::raw::c_char) -> Result;
}
extern "C" {
    #[doc = " @brief Retrieves a port handle."]
    #[doc = " @param out Pointer to output the handle to."]
    #[doc = " @param name Name of the port."]
    pub fn srvGetPort(out: *mut Handle, name: *const crate::os::raw::c_char) -> Result;
}
extern "C" {
    #[doc = " @brief Waits for a port to be registered."]
    #[doc = " @param name Name of the port to wait for registration."]
    pub fn srvWaitForPortRegistered(name: *const crate::os::raw::c_char) -> Result;
}
extern "C" {
    #[doc = " @brief Subscribes to a notification."]
    #[doc = " @param notificationId ID of the notification."]
    pub fn srvSubscribe(notificationId: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Unsubscribes from a notification."]
    #[doc = " @param notificationId ID of the notification."]
    pub fn srvUnsubscribe(notificationId: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Receives a notification."]
    #[doc = " @param notificationIdOut Pointer to output the ID of the received notification to."]
    pub fn srvReceiveNotification(notificationIdOut: *mut u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Publishes a notification to subscribers."]
    #[doc = " @param notificationId ID of the notification."]
    #[doc = " @param flags Flags to publish with. (bit 0 = only fire if not fired, bit 1 = do not report an error if there are more than 16 pending notifications)"]
    pub fn srvPublishToSubscriber(notificationId: u32_, flags: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Publishes a notification to subscribers and retrieves a list of all processes that were notified."]
    #[doc = " @param processIdCountOut Pointer to output the number of process IDs to."]
    #[doc = " @param processIdsOut Pointer to output the process IDs to. Should have size \"60 * sizeof(u32)\"."]
    #[doc = " @param notificationId ID of the notification."]
    pub fn srvPublishAndGetSubscriber(
        processIdCountOut: *mut u32_,
        processIdsOut: *mut u32_,
        notificationId: u32_,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Checks whether a service is registered."]
    #[doc = " @param registeredOut Pointer to output the registration status to."]
    #[doc = " @param name Name of the service to check."]
    pub fn srvIsServiceRegistered(
        registeredOut: *mut bool,
        name: *const crate::os::raw::c_char,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Checks whether a port is registered."]
    #[doc = " @param registeredOut Pointer to output the registration status to."]
    #[doc = " @param name Name of the port to check."]
    pub fn srvIsPortRegistered(
        registeredOut: *mut bool,
        name: *const crate::os::raw::c_char,
    ) -> Result;
}
#[doc = "< For generic errors. Shows miscellaneous info."]
pub const ERRF_ErrType_ERRF_ERRTYPE_GENERIC: ERRF_ErrType = 0;
#[doc = "< Same output as generic, but informs the user that \"the System Memory has been damaged\"."]
pub const ERRF_ErrType_ERRF_ERRTYPE_MEM_CORRUPT: ERRF_ErrType = 1;
#[doc = "< Displays the \"The Game Card was removed.\" message."]
pub const ERRF_ErrType_ERRF_ERRTYPE_CARD_REMOVED: ERRF_ErrType = 2;
#[doc = "< For exceptions, or more specifically 'crashes'. union data should be exception_data."]
pub const ERRF_ErrType_ERRF_ERRTYPE_EXCEPTION: ERRF_ErrType = 3;
#[doc = "< For general failure. Shows a message. union data should have a string set in failure_mesg"]
pub const ERRF_ErrType_ERRF_ERRTYPE_FAILURE: ERRF_ErrType = 4;
#[doc = "< Outputs logs to NAND in some cases."]
pub const ERRF_ErrType_ERRF_ERRTYPE_LOGGED: ERRF_ErrType = 5;
#[doc = " Types of errors that can be thrown by err:f."]
pub type ERRF_ErrType = crate::os::raw::c_uint;
#[doc = "< Prefetch Abort"]
pub const ERRF_ExceptionType_ERRF_EXCEPTION_PREFETCH_ABORT: ERRF_ExceptionType = 0;
#[doc = "< Data abort"]
pub const ERRF_ExceptionType_ERRF_EXCEPTION_DATA_ABORT: ERRF_ExceptionType = 1;
#[doc = "< Undefined instruction"]
pub const ERRF_ExceptionType_ERRF_EXCEPTION_UNDEFINED: ERRF_ExceptionType = 2;
#[doc = "< VFP (floating point) exception."]
pub const ERRF_ExceptionType_ERRF_EXCEPTION_VFP: ERRF_ExceptionType = 3;
#[doc = " Types of 'Exceptions' thrown for ERRF_ERRTYPE_EXCEPTION"]
pub type ERRF_ExceptionType = crate::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ERRF_ExceptionInfo {
    #[doc = "< Type of the exception. One of the ERRF_EXCEPTION_* values."]
    pub type_: ERRF_ExceptionType,
    pub reserved: [u8_; 3usize],
    #[doc = "< ifsr (prefetch abort) / dfsr (data abort)"]
    pub fsr: u32_,
    #[doc = "< pc = ifar (prefetch abort) / dfar (data abort)"]
    pub far: u32_,
    pub fpexc: u32_,
    pub fpinst: u32_,
    pub fpinst2: u32_,
}
#[test]
fn bindgen_test_layout_ERRF_ExceptionInfo() {
    assert_eq!(
        crate::mem::size_of::<ERRF_ExceptionInfo>(),
        28usize,
        concat!("Size of: ", stringify!(ERRF_ExceptionInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ERRF_ExceptionInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ERRF_ExceptionInfo))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionInfo>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionInfo>())).reserved as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionInfo),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionInfo>())).fsr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionInfo),
            "::",
            stringify!(fsr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionInfo>())).far as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionInfo),
            "::",
            stringify!(far)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionInfo>())).fpexc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionInfo),
            "::",
            stringify!(fpexc)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionInfo>())).fpinst as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionInfo),
            "::",
            stringify!(fpinst)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionInfo>())).fpinst2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionInfo),
            "::",
            stringify!(fpinst2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ERRF_ExceptionData {
    #[doc = "< Exception info struct"]
    pub excep: ERRF_ExceptionInfo,
    #[doc = "< CPU register dump."]
    pub regs: CpuRegisters,
}
#[test]
fn bindgen_test_layout_ERRF_ExceptionData() {
    assert_eq!(
        crate::mem::size_of::<ERRF_ExceptionData>(),
        96usize,
        concat!("Size of: ", stringify!(ERRF_ExceptionData))
    );
    assert_eq!(
        crate::mem::align_of::<ERRF_ExceptionData>(),
        4usize,
        concat!("Alignment of ", stringify!(ERRF_ExceptionData))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionData>())).excep as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionData),
            "::",
            stringify!(excep)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_ExceptionData>())).regs as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_ExceptionData),
            "::",
            stringify!(regs)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ERRF_FatalErrInfo {
    #[doc = "< Type, one of the ERRF_ERRTYPE_* enum"]
    pub type_: ERRF_ErrType,
    #[doc = "< High revison ID"]
    pub revHigh: u8_,
    #[doc = "< Low revision ID"]
    pub revLow: u16_,
    #[doc = "< Result code"]
    pub resCode: u32_,
    #[doc = "< PC address at exception"]
    pub pcAddr: u32_,
    #[doc = "< Process ID."]
    pub procId: u32_,
    #[doc = "< Title ID."]
    pub titleId: u64_,
    #[doc = "< Application Title ID."]
    pub appTitleId: u64_,
    #[doc = "< The different types of data for errors."]
    pub data: ERRF_FatalErrInfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ERRF_FatalErrInfo__bindgen_ty_1 {
    #[doc = "< Data for when type is ERRF_ERRTYPE_EXCEPTION"]
    pub exception_data: ERRF_ExceptionData,
    #[doc = "< String for when type is ERRF_ERRTYPE_FAILURE"]
    pub failure_mesg: [crate::os::raw::c_char; 96usize],
}
#[test]
fn bindgen_test_layout_ERRF_FatalErrInfo__bindgen_ty_1() {
    assert_eq!(
        crate::mem::size_of::<ERRF_FatalErrInfo__bindgen_ty_1>(),
        96usize,
        concat!("Size of: ", stringify!(ERRF_FatalErrInfo__bindgen_ty_1))
    );
    assert_eq!(
        crate::mem::align_of::<ERRF_FatalErrInfo__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ERRF_FatalErrInfo__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ERRF_FatalErrInfo__bindgen_ty_1>())).exception_data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo__bindgen_ty_1),
            "::",
            stringify!(exception_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<ERRF_FatalErrInfo__bindgen_ty_1>())).failure_mesg as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo__bindgen_ty_1),
            "::",
            stringify!(failure_mesg)
        )
    );
}
#[test]
fn bindgen_test_layout_ERRF_FatalErrInfo() {
    assert_eq!(
        crate::mem::size_of::<ERRF_FatalErrInfo>(),
        136usize,
        concat!("Size of: ", stringify!(ERRF_FatalErrInfo))
    );
    assert_eq!(
        crate::mem::align_of::<ERRF_FatalErrInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ERRF_FatalErrInfo))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).revHigh as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(revHigh)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).revLow as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(revLow)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).resCode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(resCode)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).pcAddr as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(pcAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).procId as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(procId)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).titleId as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(titleId)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).appTitleId as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(appTitleId)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ERRF_FatalErrInfo>())).data as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ERRF_FatalErrInfo),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " Initializes ERR:f. Unless you plan to call ERRF_Throw yourself, do not use this."]
    pub fn errfInit() -> Result;
}
extern "C" {
    #[doc = " Exits ERR:f. Unless you plan to call ERRF_Throw yourself, do not use this."]
    pub fn errfExit();
}
extern "C" {
    #[doc = " @brief Gets the current err:f API session handle."]
    #[doc = " @return The current err:f API session handle."]
    pub fn errfGetSessionHandle() -> *mut Handle;
}
extern "C" {
    #[doc = " @brief Throws a system error and possibly results in ErrDisp triggering."]
    #[doc = " @param[in] error Error to throw."]
    #[doc = ""]
    #[doc = " After performing this, the system may panic and need to be rebooted. Extra information will be displayed on the"]
    #[doc = " top screen with a developer console or the proper patches in a CFW applied."]
    #[doc = ""]
    #[doc = " The error may not be shown and execution aborted until errfExit(void) is called."]
    #[doc = ""]
    #[doc = " You may wish to use ERRF_ThrowResult() or ERRF_ThrowResultWithMessage() instead of"]
    #[doc = " constructing the ERRF_FatalErrInfo struct yourself."]
    pub fn ERRF_Throw(error: *const ERRF_FatalErrInfo) -> Result;
}
extern "C" {
    #[doc = " @brief Throws a system error with the given Result code."]
    #[doc = " @param[in] failure Result code to throw."]
    #[doc = ""]
    #[doc = " This calls ERRF_Throw() with error type ERRF_ERRTYPE_GENERIC and fills in the required data."]
    #[doc = ""]
    #[doc = " This function \\em does fill in the address where this function was called from."]
    #[doc = ""]
    #[doc = " See https://3dbrew.org/wiki/ERR:Throw#Generic for expected top screen output"]
    #[doc = " on development units/patched ErrDisp."]
    pub fn ERRF_ThrowResult(failure: Result) -> Result;
}
extern "C" {
    #[doc = " @brief Throws a system error with the given Result code and message."]
    #[doc = " @param[in] failure Result code to throw."]
    #[doc = " @param[in] message The message to display."]
    #[doc = ""]
    #[doc = " This calls ERRF_Throw() with error type ERRF_ERRTYPE_FAILURE and fills in the required data."]
    #[doc = ""]
    #[doc = " This function does \\em not fill in the address where this function was called from because it"]
    #[doc = " would not be displayed."]
    #[doc = ""]
    #[doc = " The message is only displayed on development units/patched ErrDisp."]
    #[doc = ""]
    #[doc = " See https://3dbrew.org/wiki/ERR:Throw#Result_Failure for expected top screen output"]
    #[doc = " on development units/patched ErrDisp."]
    pub fn ERRF_ThrowResultWithMessage(
        failure: Result,
        message: *const crate::os::raw::c_char,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Handles an exception using ErrDisp."]
    #[doc = " @param excep Exception information"]
    #[doc = " @param regs CPU registers"]
    #[doc = ""]
    #[doc = " You might want to clear ENVINFO's bit0 to be able to see any debugging information."]
    #[doc = " @sa threadOnException"]
    pub fn ERRF_ExceptionHandler(excep: *mut ERRF_ExceptionInfo, regs: *mut CpuRegisters);
}
#[doc = " Kernel configuration page (read-only)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osKernelConfig_s {
    pub kernel_ver: u32_,
    pub update_flag: u32_,
    pub ns_tid: u64_,
    pub kernel_syscore_ver: u32_,
    pub env_info: u8_,
    pub unit_info: u8_,
    pub boot_env: u8_,
    pub unk_0x17: u8_,
    pub kernel_ctrsdk_ver: u32_,
    pub unk_0x1c: u32_,
    pub firmlaunch_flags: u32_,
    pub unk_0x24: [u8_; 12usize],
    pub app_memtype: u32_,
    pub unk_0x34: [u8_; 12usize],
    pub memregion_sz: [u32_; 3usize],
    pub unk_0x4c: [u8_; 20usize],
    pub firm_ver: u32_,
    pub firm_syscore_ver: u32_,
    pub firm_ctrsdk_ver: u32_,
}
#[test]
fn bindgen_test_layout_osKernelConfig_s() {
    assert_eq!(
        crate::mem::size_of::<osKernelConfig_s>(),
        112usize,
        concat!("Size of: ", stringify!(osKernelConfig_s))
    );
    assert_eq!(
        crate::mem::align_of::<osKernelConfig_s>(),
        8usize,
        concat!("Alignment of ", stringify!(osKernelConfig_s))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).kernel_ver as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(kernel_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).update_flag as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(update_flag)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).ns_tid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(ns_tid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<osKernelConfig_s>())).kernel_syscore_ver as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(kernel_syscore_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).env_info as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(env_info)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).unit_info as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(unit_info)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).boot_env as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(boot_env)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).unk_0x17 as *const _ as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(unk_0x17)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<osKernelConfig_s>())).kernel_ctrsdk_ver as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(kernel_ctrsdk_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).unk_0x1c as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(unk_0x1c)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<osKernelConfig_s>())).firmlaunch_flags as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(firmlaunch_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).unk_0x24 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(unk_0x24)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).app_memtype as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(app_memtype)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).unk_0x34 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(unk_0x34)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).memregion_sz as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(memregion_sz)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).unk_0x4c as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(unk_0x4c)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osKernelConfig_s>())).firm_ver as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(firm_ver)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<osKernelConfig_s>())).firm_syscore_ver as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(firm_syscore_ver)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<osKernelConfig_s>())).firm_ctrsdk_ver as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(osKernelConfig_s),
            "::",
            stringify!(firm_ctrsdk_ver)
        )
    );
}
#[doc = " Time reference information struct (filled in by PTM)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osTimeRef_s {
    #[doc = "< Milliseconds elapsed since January 1900 when this structure was last updated"]
    pub value_ms: u64_,
    #[doc = "< System ticks elapsed since boot when this structure was last updated"]
    pub value_tick: u64_,
    #[doc = "< System clock frequency in Hz adjusted using RTC measurements (usually around \\ref SYSCLOCK_ARM11)"]
    pub sysclock_hz: s64,
    #[doc = "< Measured time drift of the system clock (according to the RTC) in milliseconds since the last update"]
    pub drift_ms: s64,
}
#[test]
fn bindgen_test_layout_osTimeRef_s() {
    assert_eq!(
        crate::mem::size_of::<osTimeRef_s>(),
        32usize,
        concat!("Size of: ", stringify!(osTimeRef_s))
    );
    assert_eq!(
        crate::mem::align_of::<osTimeRef_s>(),
        8usize,
        concat!("Alignment of ", stringify!(osTimeRef_s))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osTimeRef_s>())).value_ms as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osTimeRef_s),
            "::",
            stringify!(value_ms)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osTimeRef_s>())).value_tick as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(osTimeRef_s),
            "::",
            stringify!(value_tick)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osTimeRef_s>())).sysclock_hz as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(osTimeRef_s),
            "::",
            stringify!(sysclock_hz)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osTimeRef_s>())).drift_ms as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(osTimeRef_s),
            "::",
            stringify!(drift_ms)
        )
    );
}
#[doc = " Shared system configuration page structure (read-only or read-write depending on exheader)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osSharedConfig_s {
    pub timeref_cnt: vu32,
    pub running_hw: u8_,
    pub mcu_hwinfo: u8_,
    pub unk_0x06: [u8_; 26usize],
    pub timeref: [osTimeRef_s; 2usize],
    pub wifi_macaddr: [u8_; 6usize],
    pub wifi_strength: vu8,
    pub network_state: vu8,
    pub unk_0x68: [u8_; 24usize],
    pub slider_3d: f32,
    pub led_3d: vu8,
    pub led_battery: vu8,
    pub unk_flag: vu8,
    pub unk_0x87: u8_,
    pub unk_0x88: [u8_; 24usize],
    pub menu_tid: vu64,
    pub cur_menu_tid: vu64,
    pub unk_0xB0: [u8_; 16usize],
    pub headset_connected: vu8,
}
#[test]
fn bindgen_test_layout_osSharedConfig_s() {
    assert_eq!(
        crate::mem::size_of::<osSharedConfig_s>(),
        200usize,
        concat!("Size of: ", stringify!(osSharedConfig_s))
    );
    assert_eq!(
        crate::mem::align_of::<osSharedConfig_s>(),
        8usize,
        concat!("Alignment of ", stringify!(osSharedConfig_s))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).timeref_cnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(timeref_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).running_hw as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(running_hw)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).mcu_hwinfo as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(mcu_hwinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).unk_0x06 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(unk_0x06)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).timeref as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(timeref)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).wifi_macaddr as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(wifi_macaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).wifi_strength as *const _ as usize },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(wifi_strength)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).network_state as *const _ as usize },
        103usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(network_state)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).unk_0x68 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(unk_0x68)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).slider_3d as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(slider_3d)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).led_3d as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(led_3d)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).led_battery as *const _ as usize },
        133usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(led_battery)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).unk_flag as *const _ as usize },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(unk_flag)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).unk_0x87 as *const _ as usize },
        135usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(unk_0x87)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).unk_0x88 as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(unk_0x88)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).menu_tid as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(menu_tid)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).cur_menu_tid as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(cur_menu_tid)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<osSharedConfig_s>())).unk_0xB0 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(unk_0xB0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<osSharedConfig_s>())).headset_connected as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(osSharedConfig_s),
            "::",
            stringify!(headset_connected)
        )
    );
}
#[doc = " Tick counter."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TickCounter {
    #[doc = "< Elapsed CPU ticks between measurements."]
    pub elapsed: u64_,
    #[doc = "< Point in time used as reference."]
    pub reference: u64_,
}
#[test]
fn bindgen_test_layout_TickCounter() {
    assert_eq!(
        crate::mem::size_of::<TickCounter>(),
        16usize,
        concat!("Size of: ", stringify!(TickCounter))
    );
    assert_eq!(
        crate::mem::align_of::<TickCounter>(),
        8usize,
        concat!("Alignment of ", stringify!(TickCounter))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<TickCounter>())).elapsed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TickCounter),
            "::",
            stringify!(elapsed)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<TickCounter>())).reference as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TickCounter),
            "::",
            stringify!(reference)
        )
    );
}
#[doc = " OS_VersionBin. Format of the system version: \"<major>.<minor>.<build>-<nupver><region>\""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OS_VersionBin {
    pub build: u8_,
    pub minor: u8_,
    pub mainver: u8_,
    pub reserved_x3: u8_,
    pub region: crate::os::raw::c_char,
    pub reserved_x5: [u8_; 3usize],
}
#[test]
fn bindgen_test_layout_OS_VersionBin() {
    assert_eq!(
        crate::mem::size_of::<OS_VersionBin>(),
        8usize,
        concat!("Size of: ", stringify!(OS_VersionBin))
    );
    assert_eq!(
        crate::mem::align_of::<OS_VersionBin>(),
        1usize,
        concat!("Alignment of ", stringify!(OS_VersionBin))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<OS_VersionBin>())).build as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OS_VersionBin),
            "::",
            stringify!(build)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<OS_VersionBin>())).minor as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(OS_VersionBin),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<OS_VersionBin>())).mainver as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(OS_VersionBin),
            "::",
            stringify!(mainver)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<OS_VersionBin>())).reserved_x3 as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(OS_VersionBin),
            "::",
            stringify!(reserved_x3)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<OS_VersionBin>())).region as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OS_VersionBin),
            "::",
            stringify!(region)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<OS_VersionBin>())).reserved_x5 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(OS_VersionBin),
            "::",
            stringify!(reserved_x5)
        )
    );
}
extern "C" {
    #[doc = " @brief Converts an address from virtual (process) memory to physical memory."]
    #[doc = " @param vaddr Input virtual address."]
    #[doc = " @return The corresponding physical address."]
    #[doc = " It is sometimes required by services or when using the GPU command buffer."]
    pub fn osConvertVirtToPhys(vaddr: *const crate::os::raw::c_void) -> u32_;
}
extern "C" {
    #[doc = " @brief Converts 0x14* vmem to 0x30*."]
    #[doc = " @param vaddr Input virtual address."]
    #[doc = " @return The corresponding address in the 0x30* range, the input address if it's already within the new vmem, or 0 if it's outside of both ranges."]
    pub fn osConvertOldLINEARMemToNew(
        vaddr: *const crate::os::raw::c_void,
    ) -> *mut crate::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief Retrieves basic information about a service error."]
    #[doc = " @param error Error to retrieve information about."]
    #[doc = " @return A string containing a summary of an error."]
    #[doc = ""]
    #[doc = " This can be used to get some details about an error returned by a service call."]
    pub fn osStrError(error: Result) -> *const crate::os::raw::c_char;
}
extern "C" {
    #[doc = " @brief Reads the latest reference timepoint published by PTM."]
    #[doc = " @return Structure (see \\ref osTimeRef_s)."]
    pub fn osGetTimeRef() -> osTimeRef_s;
}
extern "C" {
    #[doc = " @brief Gets the current time."]
    #[doc = " @return The number of milliseconds since 1st Jan 1900 00:00."]
    pub fn osGetTime() -> u64_;
}
extern "C" {
    #[doc = " @brief Reads the elapsed time in a tick counter."]
    #[doc = " @param cnt The tick counter."]
    #[doc = " @return The number of milliseconds elapsed."]
    pub fn osTickCounterRead(cnt: *const TickCounter) -> f64;
}
extern "C" {
    #[doc = " @brief Configures the New 3DS speedup."]
    #[doc = " @param enable Specifies whether to enable or disable the speedup."]
    pub fn osSetSpeedupEnable(enable: bool);
}
extern "C" {
    #[doc = " @brief Gets the NAND system-version stored in NVer/CVer."]
    #[doc = " @param nver_versionbin Output OS_VersionBin structure for the data read from NVer."]
    #[doc = " @param cver_versionbin Output OS_VersionBin structure for the data read from CVer."]
    #[doc = " @return The result-code. This value can be positive if opening \"romfs:/version.bin\" fails with stdio, since errno would be returned in that case. In some cases the error can be special negative values as well."]
    pub fn osGetSystemVersionData(
        nver_versionbin: *mut OS_VersionBin,
        cver_versionbin: *mut OS_VersionBin,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief This is a wrapper for osGetSystemVersionData."]
    #[doc = " @param nver_versionbin Optional output OS_VersionBin structure for the data read from NVer, can be NULL."]
    #[doc = " @param cver_versionbin Optional output OS_VersionBin structure for the data read from CVer, can be NULL."]
    #[doc = " @param sysverstr Output string where the printed system-version will be written, in the same format displayed by the System Settings title."]
    #[doc = " @param sysverstr_maxsize Max size of the above string buffer, *including* NULL-terminator."]
    #[doc = " @return See osGetSystemVersionData."]
    pub fn osGetSystemVersionDataString(
        nver_versionbin: *mut OS_VersionBin,
        cver_versionbin: *mut OS_VersionBin,
        sysverstr: *mut crate::os::raw::c_char,
        sysverstr_maxsize: u32_,
    ) -> Result;
}
pub type _LOCK_T = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lock_t {
    pub lock: _LOCK_T,
    pub thread_tag: u32,
    pub counter: u32,
}
#[test]
fn bindgen_test_layout___lock_t() {
    assert_eq!(
        crate::mem::size_of::<__lock_t>(),
        12usize,
        concat!("Size of: ", stringify!(__lock_t))
    );
    assert_eq!(
        crate::mem::align_of::<__lock_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__lock_t))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<__lock_t>())).lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<__lock_t>())).thread_tag as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(thread_tag)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<__lock_t>())).counter as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(counter)
        )
    );
}
pub type _LOCK_RECURSIVE_T = __lock_t;
extern "C" {
    pub fn __libc_lock_init(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_init_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_close(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_close_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_acquire(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_acquire_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_release(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_release_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_try_acquire(lock: *mut _LOCK_T) -> crate::os::raw::c_int;
}
extern "C" {
    pub fn __libc_lock_try_acquire_recursive(lock: *mut _LOCK_RECURSIVE_T)
        -> crate::os::raw::c_int;
}
#[doc = " A light lock."]
pub type LightLock = _LOCK_T;
#[doc = " A recursive lock."]
pub type RecursiveLock = _LOCK_RECURSIVE_T;
#[doc = " A condition variable."]
pub type CondVar = s32;
#[doc = " A light event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LightEvent {
    #[doc = "< State of the event: -2=cleared sticky, -1=cleared oneshot, 0=signaled oneshot, 1=signaled sticky"]
    pub state: s32,
    #[doc = "< Lock used for sticky timer operation"]
    pub lock: LightLock,
}
#[test]
fn bindgen_test_layout_LightEvent() {
    assert_eq!(
        crate::mem::size_of::<LightEvent>(),
        8usize,
        concat!("Size of: ", stringify!(LightEvent))
    );
    assert_eq!(
        crate::mem::align_of::<LightEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(LightEvent))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<LightEvent>())).state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LightEvent),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<LightEvent>())).lock as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LightEvent),
            "::",
            stringify!(lock)
        )
    );
}
#[doc = " A light semaphore."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LightSemaphore {
    #[doc = "< The current release count of the semaphore"]
    pub current_count: s32,
    #[doc = "< Number of threads concurrently acquiring the semaphore"]
    pub num_threads_acq: s16,
    #[doc = "< The maximum release count of the semaphore"]
    pub max_count: s16,
}
#[test]
fn bindgen_test_layout_LightSemaphore() {
    assert_eq!(
        crate::mem::size_of::<LightSemaphore>(),
        8usize,
        concat!("Size of: ", stringify!(LightSemaphore))
    );
    assert_eq!(
        crate::mem::align_of::<LightSemaphore>(),
        4usize,
        concat!("Alignment of ", stringify!(LightSemaphore))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<LightSemaphore>())).current_count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LightSemaphore),
            "::",
            stringify!(current_count)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<LightSemaphore>())).num_threads_acq as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LightSemaphore),
            "::",
            stringify!(num_threads_acq)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<LightSemaphore>())).max_count as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(LightSemaphore),
            "::",
            stringify!(max_count)
        )
    );
}
extern "C" {
    #[doc = " @brief Function used to implement user-mode synchronization primitives."]
    #[doc = " @param addr Pointer to a signed 32-bit value whose address will be used to identify waiting threads."]
    #[doc = " @param type Type of action to be performed by the arbiter"]
    #[doc = " @param value Number of threads to signal if using @ref ARBITRATION_SIGNAL, or the value used for comparison."]
    #[doc = ""]
    #[doc = " This will perform an arbitration based on #type. The comparisons are done between #value and the value at the address #addr."]
    #[doc = ""]
    #[doc = " @code"]
    #[doc = " s32 val=0;"]
    #[doc = " // Does *nothing* since val >= 0"]
    #[doc = " syncArbitrateAddress(&val,ARBITRATION_WAIT_IF_LESS_THAN,0);"]
    #[doc = " @endcode"]
    #[doc = ""]
    #[doc = " @note Usage of this function entails an implicit Data Memory Barrier (dmb)."]
    pub fn syncArbitrateAddress(addr: *mut s32, type_: ArbitrationType, value: s32) -> Result;
}
extern "C" {
    #[doc = " @brief Function used to implement user-mode synchronization primitives (with timeout)."]
    #[doc = " @param addr Pointer to a signed 32-bit value whose address will be used to identify waiting threads."]
    #[doc = " @param type Type of action to be performed by the arbiter (must use \\ref ARBITRATION_WAIT_IF_LESS_THAN_TIMEOUT or \\ref ARBITRATION_DECREMENT_AND_WAIT_IF_LESS_THAN_TIMEOUT)"]
    #[doc = " @param value Number of threads to signal if using @ref ARBITRATION_SIGNAL, or the value used for comparison."]
    #[doc = ""]
    #[doc = " This will perform an arbitration based on #type. The comparisons are done between #value and the value at the address #addr."]
    #[doc = ""]
    #[doc = " @code"]
    #[doc = " s32 val=0;"]
    #[doc = " // Thread will wait for a signal or wake up after 10000000 nanoseconds because val < 1."]
    #[doc = " syncArbitrateAddressWithTimeout(&val,ARBITRATION_WAIT_IF_LESS_THAN_TIMEOUT,1,10000000LL);"]
    #[doc = " @endcode"]
    #[doc = ""]
    #[doc = " @note Usage of this function entails an implicit Data Memory Barrier (dmb)."]
    pub fn syncArbitrateAddressWithTimeout(
        addr: *mut s32,
        type_: ArbitrationType,
        value: s32,
        timeout_ns: s64,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Initializes a light lock."]
    #[doc = " @param lock Pointer to the lock."]
    pub fn LightLock_Init(lock: *mut LightLock);
}
extern "C" {
    #[doc = " @brief Locks a light lock."]
    #[doc = " @param lock Pointer to the lock."]
    pub fn LightLock_Lock(lock: *mut LightLock);
}
extern "C" {
    #[doc = " @brief Attempts to lock a light lock."]
    #[doc = " @param lock Pointer to the lock."]
    #[doc = " @return Zero on success, non-zero on failure."]
    pub fn LightLock_TryLock(lock: *mut LightLock) -> crate::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Unlocks a light lock."]
    #[doc = " @param lock Pointer to the lock."]
    pub fn LightLock_Unlock(lock: *mut LightLock);
}
extern "C" {
    #[doc = " @brief Initializes a recursive lock."]
    #[doc = " @param lock Pointer to the lock."]
    pub fn RecursiveLock_Init(lock: *mut RecursiveLock);
}
extern "C" {
    #[doc = " @brief Locks a recursive lock."]
    #[doc = " @param lock Pointer to the lock."]
    pub fn RecursiveLock_Lock(lock: *mut RecursiveLock);
}
extern "C" {
    #[doc = " @brief Attempts to lock a recursive lock."]
    #[doc = " @param lock Pointer to the lock."]
    #[doc = " @return Zero on success, non-zero on failure."]
    pub fn RecursiveLock_TryLock(lock: *mut RecursiveLock) -> crate::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Unlocks a recursive lock."]
    #[doc = " @param lock Pointer to the lock."]
    pub fn RecursiveLock_Unlock(lock: *mut RecursiveLock);
}
extern "C" {
    #[doc = " @brief Initializes a condition variable."]
    #[doc = " @param cv Pointer to the condition variable."]
    pub fn CondVar_Init(cv: *mut CondVar);
}
extern "C" {
    #[doc = " @brief Waits on a condition variable."]
    #[doc = " @param cv Pointer to the condition variable."]
    #[doc = " @param lock Pointer to the lock to atomically unlock/relock during the wait."]
    pub fn CondVar_Wait(cv: *mut CondVar, lock: *mut LightLock);
}
extern "C" {
    #[doc = " @brief Waits on a condition variable with a timeout."]
    #[doc = " @param cv Pointer to the condition variable."]
    #[doc = " @param lock Pointer to the lock to atomically unlock/relock during the wait."]
    #[doc = " @param timeout_ns Timeout in nanoseconds."]
    #[doc = " @return Zero on success, non-zero on failure."]
    pub fn CondVar_WaitTimeout(
        cv: *mut CondVar,
        lock: *mut LightLock,
        timeout_ns: s64,
    ) -> crate::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Wakes up threads waiting on a condition variable."]
    #[doc = " @param cv Pointer to the condition variable."]
    #[doc = " @param num_threads Maximum number of threads to wake up (or \\ref ARBITRATION_SIGNAL_ALL to wake them all)."]
    pub fn CondVar_WakeUp(cv: *mut CondVar, num_threads: s32);
}
extern "C" {
    #[doc = " @brief Initializes a light event."]
    #[doc = " @param event Pointer to the event."]
    #[doc = " @param reset_type Type of reset the event uses (RESET_ONESHOT/RESET_STICKY)."]
    pub fn LightEvent_Init(event: *mut LightEvent, reset_type: ResetType);
}
extern "C" {
    #[doc = " @brief Clears a light event."]
    #[doc = " @param event Pointer to the event."]
    pub fn LightEvent_Clear(event: *mut LightEvent);
}
extern "C" {
    #[doc = " @brief Wakes up threads waiting on a sticky light event without signaling it. If the event had been signaled before, it is cleared instead."]
    #[doc = " @param event Pointer to the event."]
    pub fn LightEvent_Pulse(event: *mut LightEvent);
}
extern "C" {
    #[doc = " @brief Signals a light event, waking up threads waiting on it."]
    #[doc = " @param event Pointer to the event."]
    pub fn LightEvent_Signal(event: *mut LightEvent);
}
extern "C" {
    #[doc = " @brief Attempts to wait on a light event."]
    #[doc = " @param event Pointer to the event."]
    #[doc = " @return Non-zero if the event was signaled, zero otherwise."]
    pub fn LightEvent_TryWait(event: *mut LightEvent) -> crate::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Waits on a light event."]
    #[doc = " @param event Pointer to the event."]
    pub fn LightEvent_Wait(event: *mut LightEvent);
}
extern "C" {
    #[doc = " @brief Waits on a light event until either the event is signaled or the timeout is reached."]
    #[doc = " @param event Pointer to the event."]
    #[doc = " @param timeout_ns Timeout in nanoseconds."]
    #[doc = " @return Non-zero on timeout, zero otherwise."]
    pub fn LightEvent_WaitTimeout(event: *mut LightEvent, timeout_ns: s64)
        -> crate::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Initializes a light semaphore."]
    #[doc = " @param event Pointer to the semaphore."]
    #[doc = " @param max_count Initial count of the semaphore."]
    #[doc = " @param max_count Maximum count of the semaphore."]
    pub fn LightSemaphore_Init(semaphore: *mut LightSemaphore, initial_count: s16, max_count: s16);
}
extern "C" {
    #[doc = " @brief Acquires a light semaphore."]
    #[doc = " @param semaphore Pointer to the semaphore."]
    #[doc = " @param count Acquire count"]
    pub fn LightSemaphore_Acquire(semaphore: *mut LightSemaphore, count: s32);
}
extern "C" {
    #[doc = " @brief Attempts to acquire a light semaphore."]
    #[doc = " @param semaphore Pointer to the semaphore."]
    #[doc = " @param count Acquire count"]
    #[doc = " @return Zero on success, non-zero on failure"]
    pub fn LightSemaphore_TryAcquire(
        semaphore: *mut LightSemaphore,
        count: s32,
    ) -> crate::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Releases a light semaphore."]
    #[doc = " @param semaphore Pointer to the semaphore."]
    #[doc = " @param count Release count"]
    pub fn LightSemaphore_Release(semaphore: *mut LightSemaphore, count: s32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Thread_tag {
    _unused: [u8; 0],
}
#[doc = " libctru thread handle type"]
pub type Thread = *mut Thread_tag;
#[doc = " Exception handler type, necessarily an ARM function that does not return."]
pub type ExceptionHandler = crate::option::Option<
    unsafe extern "C" fn(excep: *mut ERRF_ExceptionInfo, regs: *mut CpuRegisters),
>;
extern "C" {
    #[doc = " @brief Creates a new libctru thread."]
    #[doc = " @param entrypoint The function that will be called first upon thread creation"]
    #[doc = " @param arg The argument passed to @p entrypoint"]
    #[doc = " @param stack_size The size of the stack that will be allocated for the thread (will be rounded to a multiple of 8 bytes)"]
    #[doc = " @param prio Low values gives the thread higher priority."]
    #[doc = "             For userland apps, this has to be within the range [0x18;0x3F]."]
    #[doc = "             The main thread usually has a priority of 0x30, but not always. Use svcGetThreadPriority() if you need"]
    #[doc = "             to create a thread with a priority that is explicitly greater or smaller than that of the main thread."]
    #[doc = " @param core_id The ID of the processor the thread should be ran on. Processor IDs are labeled starting from 0."]
    #[doc = "                On Old3DS it must be <2, and on New3DS it must be <4."]
    #[doc = "                Pass -1 to execute the thread on all CPUs and -2 to execute the thread on the default CPU (read from the Exheader)."]
    #[doc = " @param detached When set to true, the thread is automatically freed when it finishes."]
    #[doc = " @return The libctru thread handle on success, NULL on failure."]
    #[doc = ""]
    #[doc = " - Processor #0 is the application core. It is always possible to create a thread on this core."]
    #[doc = " - Processor #1 is the system core. If APT_SetAppCpuTimeLimit is used, it is possible to create a single thread on this core."]
    #[doc = " - Processor #2 is New3DS exclusive. Normal applications can create threads on this core if the exheader kernel flags bitmask has 0x2000 set."]
    #[doc = " - Processor #3 is New3DS exclusive. Normal applications cannot create threads on this core."]
    #[doc = " - Processes in the BASE memory region can always create threads on processors #2 and #3."]
    #[doc = ""]
    #[doc = " @note Default exit code of a thread is 0."]
    #[doc = " @warning @ref svcExitThread should never be called from the thread, use @ref threadExit instead."]
    pub fn threadCreate(
        entrypoint: ThreadFunc,
        arg: *mut crate::os::raw::c_void,
        stack_size: size_t,
        prio: crate::os::raw::c_int,
        core_id: crate::os::raw::c_int,
        detached: bool,
    ) -> Thread;
}
extern "C" {
    #[doc = " @brief Retrieves the OS thread handle of a libctru thread."]
    #[doc = " @param thread libctru thread handle"]
    #[doc = " @return OS thread handle"]
    pub fn threadGetHandle(thread: Thread) -> Handle;
}
extern "C" {
    #[doc = " @brief Retrieves the exit code of a finished libctru thread."]
    #[doc = " @param thread libctru thread handle"]
    #[doc = " @return Exit code"]
    pub fn threadGetExitCode(thread: Thread) -> crate::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Frees a finished libctru thread."]
    #[doc = " @param thread libctru thread handle"]
    #[doc = " @remarks This function should not be called if the thread is detached, as it is freed automatically when it finishes."]
    pub fn threadFree(thread: Thread);
}
extern "C" {
    #[doc = " @brief Waits for a libctru thread to finish (or returns immediately if it is already finished)."]
    #[doc = " @param thread libctru thread handle"]
    #[doc = " @param timeout_ns Timeout in nanoseconds. Pass U64_MAX if a timeout isn't desired"]
    pub fn threadJoin(thread: Thread, timeout_ns: u64_) -> Result;
}
extern "C" {
    #[doc = "  @brief Changes a thread's status from attached to detached."]
    #[doc = "  @param thread libctru thread handle"]
    pub fn threadDetach(thread: Thread);
}
extern "C" {
    #[doc = " @brief Retrieves the libctru thread handle of the current thread."]
    #[doc = " @return libctru thread handle of the current thread, or NULL for the main thread"]
    pub fn threadGetCurrent() -> Thread;
}
extern "C" {
    #[doc = " @brief Exits the current libctru thread with an exit code (not usable from the main thread)."]
    #[doc = " @param rc Exit code"]
    pub fn threadExit(rc: crate::os::raw::c_int);
}
#[doc = " Framebuffer information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GSPGPU_FramebufferInfo {
    #[doc = "< Active framebuffer. (0 = first, 1 = second)"]
    pub active_framebuf: u32_,
    #[doc = "< Framebuffer virtual address, for the main screen this is the 3D left framebuffer."]
    pub framebuf0_vaddr: *mut u32_,
    #[doc = "< For the main screen: 3D right framebuffer address."]
    pub framebuf1_vaddr: *mut u32_,
    #[doc = "< Value for 0x1EF00X90, controls framebuffer width."]
    pub framebuf_widthbytesize: u32_,
    #[doc = "< Framebuffer format, this u16 is written to the low u16 for LCD register 0x1EF00X70."]
    pub format: u32_,
    #[doc = "< Value for 0x1EF00X78, controls which framebuffer is displayed."]
    pub framebuf_dispselect: u32_,
    #[doc = "< Unknown."]
    pub unk: u32_,
}
#[test]
fn bindgen_test_layout_GSPGPU_FramebufferInfo() {
    assert_eq!(
        crate::mem::size_of::<GSPGPU_FramebufferInfo>(),
        28usize,
        concat!("Size of: ", stringify!(GSPGPU_FramebufferInfo))
    );
    assert_eq!(
        crate::mem::align_of::<GSPGPU_FramebufferInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(GSPGPU_FramebufferInfo))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_FramebufferInfo>())).active_framebuf as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_FramebufferInfo),
            "::",
            stringify!(active_framebuf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_FramebufferInfo>())).framebuf0_vaddr as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_FramebufferInfo),
            "::",
            stringify!(framebuf0_vaddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_FramebufferInfo>())).framebuf1_vaddr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_FramebufferInfo),
            "::",
            stringify!(framebuf1_vaddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_FramebufferInfo>())).framebuf_widthbytesize as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_FramebufferInfo),
            "::",
            stringify!(framebuf_widthbytesize)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<GSPGPU_FramebufferInfo>())).format as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_FramebufferInfo),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_FramebufferInfo>())).framebuf_dispselect as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_FramebufferInfo),
            "::",
            stringify!(framebuf_dispselect)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<GSPGPU_FramebufferInfo>())).unk as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_FramebufferInfo),
            "::",
            stringify!(unk)
        )
    );
}
#[doc = "< RGBA8. (4 bytes)"]
pub const GSPGPU_FramebufferFormat_GSP_RGBA8_OES: GSPGPU_FramebufferFormat = 0;
#[doc = "< BGR8. (3 bytes)"]
pub const GSPGPU_FramebufferFormat_GSP_BGR8_OES: GSPGPU_FramebufferFormat = 1;
#[doc = "< RGB565. (2 bytes)"]
pub const GSPGPU_FramebufferFormat_GSP_RGB565_OES: GSPGPU_FramebufferFormat = 2;
#[doc = "< RGB5A1. (2 bytes)"]
pub const GSPGPU_FramebufferFormat_GSP_RGB5_A1_OES: GSPGPU_FramebufferFormat = 3;
#[doc = "< RGBA4. (2 bytes)"]
pub const GSPGPU_FramebufferFormat_GSP_RGBA4_OES: GSPGPU_FramebufferFormat = 4;
#[doc = " Framebuffer format."]
pub type GSPGPU_FramebufferFormat = crate::os::raw::c_uint;
#[doc = " Capture info entry."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GSPGPU_CaptureInfoEntry {
    #[doc = "< Left framebuffer."]
    pub framebuf0_vaddr: *mut u32_,
    #[doc = "< Right framebuffer."]
    pub framebuf1_vaddr: *mut u32_,
    #[doc = "< Framebuffer format."]
    pub format: u32_,
    #[doc = "< Framebuffer pitch."]
    pub framebuf_widthbytesize: u32_,
}
#[test]
fn bindgen_test_layout_GSPGPU_CaptureInfoEntry() {
    assert_eq!(
        crate::mem::size_of::<GSPGPU_CaptureInfoEntry>(),
        16usize,
        concat!("Size of: ", stringify!(GSPGPU_CaptureInfoEntry))
    );
    assert_eq!(
        crate::mem::align_of::<GSPGPU_CaptureInfoEntry>(),
        4usize,
        concat!("Alignment of ", stringify!(GSPGPU_CaptureInfoEntry))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_CaptureInfoEntry>())).framebuf0_vaddr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_CaptureInfoEntry),
            "::",
            stringify!(framebuf0_vaddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_CaptureInfoEntry>())).framebuf1_vaddr as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_CaptureInfoEntry),
            "::",
            stringify!(framebuf1_vaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<GSPGPU_CaptureInfoEntry>())).format as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_CaptureInfoEntry),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_CaptureInfoEntry>())).framebuf_widthbytesize as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_CaptureInfoEntry),
            "::",
            stringify!(framebuf_widthbytesize)
        )
    );
}
#[doc = " Capture info."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GSPGPU_CaptureInfo {
    #[doc = "< Capture info entries, one for each screen."]
    pub screencapture: [GSPGPU_CaptureInfoEntry; 2usize],
}
#[test]
fn bindgen_test_layout_GSPGPU_CaptureInfo() {
    assert_eq!(
        crate::mem::size_of::<GSPGPU_CaptureInfo>(),
        32usize,
        concat!("Size of: ", stringify!(GSPGPU_CaptureInfo))
    );
    assert_eq!(
        crate::mem::align_of::<GSPGPU_CaptureInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(GSPGPU_CaptureInfo))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<GSPGPU_CaptureInfo>())).screencapture as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GSPGPU_CaptureInfo),
            "::",
            stringify!(screencapture)
        )
    );
}
#[doc = "< Memory fill completed."]
pub const GSPGPU_Event_GSPGPU_EVENT_PSC0: GSPGPU_Event = 0;
#[doc = "< TODO"]
pub const GSPGPU_Event_GSPGPU_EVENT_PSC1: GSPGPU_Event = 1;
#[doc = "< TODO"]
pub const GSPGPU_Event_GSPGPU_EVENT_VBlank0: GSPGPU_Event = 2;
#[doc = "< TODO"]
pub const GSPGPU_Event_GSPGPU_EVENT_VBlank1: GSPGPU_Event = 3;
#[doc = "< Display transfer finished."]
pub const GSPGPU_Event_GSPGPU_EVENT_PPF: GSPGPU_Event = 4;
#[doc = "< Command list processing finished."]
pub const GSPGPU_Event_GSPGPU_EVENT_P3D: GSPGPU_Event = 5;
#[doc = "< TODO"]
pub const GSPGPU_Event_GSPGPU_EVENT_DMA: GSPGPU_Event = 6;
#[doc = "< Used to know how many events there are."]
pub const GSPGPU_Event_GSPGPU_EVENT_MAX: GSPGPU_Event = 7;
#[doc = " GSPGPU events."]
pub type GSPGPU_Event = crate::os::raw::c_uint;
extern "C" {
    #[doc = " Initializes GSPGPU."]
    pub fn gspInit() -> Result;
}
extern "C" {
    #[doc = " Exits GSPGPU."]
    pub fn gspExit();
}
extern "C" {
    #[doc = " Returns true if the application currently has GPU rights."]
    pub fn gspHasGpuRight() -> bool;
}
extern "C" {
    #[doc = " @brief Presents a buffer to the specified screen."]
    #[doc = " @param screen Screen ID (see \\ref GSP_SCREEN_TOP and \\ref GSP_SCREEN_BOTTOM)"]
    #[doc = " @param swap Specifies which set of framebuffer registers to configure and activate (0 or 1)"]
    #[doc = " @param fb_a Pointer to the framebuffer (in stereo mode: left eye)"]
    #[doc = " @param fb_b Pointer to the secondary framebuffer (only used in stereo mode for the right eye, otherwise pass the same as fb_a)"]
    #[doc = " @param stride Stride in bytes between scanlines"]
    #[doc = " @param mode Mode configuration to be written to LCD register"]
    #[doc = " @note The most recently presented buffer is processed and configured during the specified screen's next VBlank event."]
    pub fn gspPresentBuffer(
        screen: crate::os::raw::c_uint,
        swap: crate::os::raw::c_uint,
        fb_a: *const crate::os::raw::c_void,
        fb_b: *const crate::os::raw::c_void,
        stride: u32_,
        mode: u32_,
    );
}
extern "C" {
    #[doc = " @brief Configures a callback to run when a GSPGPU event occurs."]
    #[doc = " @param id ID of the event."]
    #[doc = " @param cb Callback to run."]
    #[doc = " @param data Data to be passed to the callback."]
    #[doc = " @param oneShot When true, the callback is only executed once. When false, the callback is executed every time the event occurs."]
    pub fn gspSetEventCallback(
        id: GSPGPU_Event,
        cb: ThreadFunc,
        data: *mut crate::os::raw::c_void,
        oneShot: bool,
    );
}
extern "C" {
    #[doc = " @brief Waits for a GSPGPU event to occur."]
    #[doc = " @param id ID of the event."]
    #[doc = " @param nextEvent Whether to discard the current event and wait for the next event."]
    pub fn gspWaitForEvent(id: GSPGPU_Event, nextEvent: bool);
}
extern "C" {
    #[doc = " @brief Waits for any GSPGPU event to occur."]
    #[doc = " @return The ID of the event that occurred."]
    #[doc = ""]
    #[doc = " The function returns immediately if there are unprocessed events at the time of call."]
    pub fn gspWaitForAnyEvent() -> GSPGPU_Event;
}
extern "C" {
    #[doc = " @brief Submits a GX command."]
    #[doc = " @param gxCommand GX command to execute."]
    pub fn gspSubmitGxCommand(gxCommand: *const u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Acquires GPU rights."]
    #[doc = " @param flags Flags to acquire with."]
    pub fn GSPGPU_AcquireRight(flags: u8_) -> Result;
}
extern "C" {
    #[doc = " Releases GPU rights."]
    pub fn GSPGPU_ReleaseRight() -> Result;
}
extern "C" {
    #[doc = " @brief Retrieves display capture info."]
    #[doc = " @param captureinfo Pointer to output capture info to."]
    pub fn GSPGPU_ImportDisplayCaptureInfo(captureinfo: *mut GSPGPU_CaptureInfo) -> Result;
}
extern "C" {
    #[doc = " Saves the VRAM sys area."]
    pub fn GSPGPU_SaveVramSysArea() -> Result;
}
extern "C" {
    #[doc = " Resets the GPU"]
    pub fn GSPGPU_ResetGpuCore() -> Result;
}
extern "C" {
    #[doc = " Restores the VRAM sys area."]
    pub fn GSPGPU_RestoreVramSysArea() -> Result;
}
extern "C" {
    #[doc = " @brief Sets whether to force the LCD to black."]
    #[doc = " @param flags Whether to force the LCD to black. (0 = no, non-zero = yes)"]
    pub fn GSPGPU_SetLcdForceBlack(flags: u8_) -> Result;
}
extern "C" {
    #[doc = " @brief Updates a screen's framebuffer state."]
    #[doc = " @param screenid ID of the screen to update."]
    #[doc = " @param framebufinfo Framebuffer information to update with."]
    pub fn GSPGPU_SetBufferSwap(
        screenid: u32_,
        framebufinfo: *const GSPGPU_FramebufferInfo,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Flushes memory from the data cache."]
    #[doc = " @param adr Address to flush."]
    #[doc = " @param size Size of the memory to flush."]
    pub fn GSPGPU_FlushDataCache(adr: *const crate::os::raw::c_void, size: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Invalidates memory in the data cache."]
    #[doc = " @param adr Address to invalidate."]
    #[doc = " @param size Size of the memory to invalidate."]
    pub fn GSPGPU_InvalidateDataCache(adr: *const crate::os::raw::c_void, size: u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Writes to GPU hardware registers."]
    #[doc = " @param regAddr Register address to write to."]
    #[doc = " @param data Data to write."]
    #[doc = " @param size Size of the data to write."]
    pub fn GSPGPU_WriteHWRegs(regAddr: u32_, data: *const u32_, size: u8_) -> Result;
}
extern "C" {
    #[doc = " @brief Writes to GPU hardware registers with a mask."]
    #[doc = " @param regAddr Register address to write to."]
    #[doc = " @param data Data to write."]
    #[doc = " @param datasize Size of the data to write."]
    #[doc = " @param maskdata Data of the mask."]
    #[doc = " @param masksize Size of the mask."]
    pub fn GSPGPU_WriteHWRegsWithMask(
        regAddr: u32_,
        data: *const u32_,
        datasize: u8_,
        maskdata: *const u32_,
        masksize: u8_,
    ) -> Result;
}
extern "C" {
    #[doc = " @brief Reads from GPU hardware registers."]
    #[doc = " @param regAddr Register address to read from."]
    #[doc = " @param data Buffer to read data to."]
    #[doc = " @param size Size of the buffer."]
    pub fn GSPGPU_ReadHWRegs(regAddr: u32_, data: *mut u32_, size: u8_) -> Result;
}
extern "C" {
    #[doc = " @brief Registers the interrupt relay queue."]
    #[doc = " @param eventHandle Handle of the GX command event."]
    #[doc = " @param flags Flags to register with."]
    #[doc = " @param outMemHandle Pointer to output the shared memory handle to."]
    #[doc = " @param threadID Pointer to output the GSP thread ID to."]
    pub fn GSPGPU_RegisterInterruptRelayQueue(
        eventHandle: Handle,
        flags: u32_,
        outMemHandle: *mut Handle,
        threadID: *mut u8_,
    ) -> Result;
}
extern "C" {
    #[doc = " Unregisters the interrupt relay queue."]
    pub fn GSPGPU_UnregisterInterruptRelayQueue() -> Result;
}
extern "C" {
    #[doc = " Triggers a handling of commands written to shared memory."]
    pub fn GSPGPU_TriggerCmdReqQueue() -> Result;
}
extern "C" {
    #[doc = " @brief Sets 3D_LEDSTATE to the input state value."]
    #[doc = " @param disable False = 3D LED enable, true = 3D LED disable."]
    pub fn GSPGPU_SetLedForceOff(disable: bool) -> Result;
}
#[doc = "< Top screen"]
pub const gfxScreen_t_GFX_TOP: gfxScreen_t = 0;
#[doc = "< Bottom screen"]
pub const gfxScreen_t_GFX_BOTTOM: gfxScreen_t = 1;
#[doc = " Screen IDs."]
pub type gfxScreen_t = crate::os::raw::c_uint;
#[doc = "< Left eye framebuffer"]
pub const gfx3dSide_t_GFX_LEFT: gfx3dSide_t = 0;
#[doc = "< Right eye framebuffer"]
pub const gfx3dSide_t_GFX_RIGHT: gfx3dSide_t = 1;
#[doc = " @brief Top screen framebuffer side."]
#[doc = ""]
#[doc = " This is only meaningful when stereoscopic 3D is enabled on the top screen."]
#[doc = " In any other case, use \\ref GFX_LEFT."]
pub type gfx3dSide_t = crate::os::raw::c_uint;
extern "C" {
    #[doc = " @brief Initializes the LCD framebuffers with default parameters"]
    #[doc = " This is equivalent to calling: @code gfxInit(GSP_BGR8_OES,GSP_BGR8_OES,false); @endcode"]
    pub fn gfxInitDefault();
}
extern "C" {
    #[doc = " @brief Initializes the LCD framebuffers."]
    #[doc = " @param topFormat The format of the top screen framebuffers."]
    #[doc = " @param bottomFormat The format of the bottom screen framebuffers."]
    #[doc = " @param vramBuffers Whether to allocate the framebuffers in VRAM."]
    #[doc = ""]
    #[doc = " This function allocates memory for the framebuffers in the specified memory region."]
    #[doc = " Initially, stereoscopic 3D is disabled and double buffering is enabled."]
    #[doc = ""]
    #[doc = " @note This function internally calls \\ref gspInit."]
    pub fn gfxInit(
        topFormat: GSPGPU_FramebufferFormat,
        bottomFormat: GSPGPU_FramebufferFormat,
        vrambuffers: bool,
    );
}
extern "C" {
    #[doc = " @brief Deinitializes and frees the LCD framebuffers."]
    #[doc = " @note This function internally calls \\ref gspExit."]
    pub fn gfxExit();
}
extern "C" {
    #[doc = " @brief Enables or disables the 3D stereoscopic effect on the top screen."]
    #[doc = " @param enable Pass true to enable, false to disable."]
    #[doc = " @note Stereoscopic 3D is disabled by default."]
    pub fn gfxSet3D(enable: bool);
}
extern "C" {
    #[doc = " @brief Retrieves the status of the 3D stereoscopic effect on the top screen."]
    #[doc = " @return true if 3D enabled, false otherwise."]
    pub fn gfxIs3D() -> bool;
}
extern "C" {
    #[doc = " @brief Retrieves the status of the 800px (double-height) high resolution display mode of the top screen."]
    #[doc = " @return true if wide mode enabled, false otherwise."]
    pub fn gfxIsWide() -> bool;
}
extern "C" {
    #[doc = " @brief Enables or disables the 800px (double-height) high resolution display mode of the top screen."]
    #[doc = " @param enable Pass true to enable, false to disable."]
    #[doc = " @note Wide mode is disabled by default."]
    #[doc = " @note Wide and stereoscopic 3D modes are mutually exclusive."]
    #[doc = " @note In wide mode pixels are not square, since scanlines are half as tall as they normally are."]
    #[doc = " @warning Wide mode does not work on Old 2DS consoles (however it does work on New 2DS XL consoles)."]
    pub fn gfxSetWide(enable: bool);
}
extern "C" {
    #[doc = " @brief Changes the pixel format of a screen."]
    #[doc = " @param screen Screen ID (see \\ref gfxScreen_t)"]
    #[doc = " @param format Pixel format (see \\ref GSPGPU_FramebufferFormat)"]
    #[doc = " @note If the currently allocated framebuffers are too small for the specified format,"]
    #[doc = "       they are freed and new ones are reallocated."]
    pub fn gfxSetScreenFormat(screen: gfxScreen_t, format: GSPGPU_FramebufferFormat);
}
extern "C" {
    #[doc = " @brief Retrieves the current pixel format of a screen."]
    #[doc = " @param screen Screen ID (see \\ref gfxScreen_t)"]
    #[doc = " @return Pixel format (see \\ref GSPGPU_FramebufferFormat)"]
    pub fn gfxGetScreenFormat(screen: gfxScreen_t) -> GSPGPU_FramebufferFormat;
}
extern "C" {
    #[doc = " @brief Enables or disables double buffering on a screen."]
    #[doc = " @param screen Screen ID (see \\ref gfxScreen_t)"]
    #[doc = " @param enable Pass true to enable, false to disable."]
    #[doc = " @note Double buffering is enabled by default."]
    pub fn gfxSetDoubleBuffering(screen: gfxScreen_t, enable: bool);
}
extern "C" {
    #[doc = " @brief Retrieves the framebuffer of the specified screen to which graphics should be rendered."]
    #[doc = " @param screen Screen ID (see \\ref gfxScreen_t)"]
    #[doc = " @param side Framebuffer side (see \\ref gfx3dSide_t) (pass \\ref GFX_LEFT if not using stereoscopic 3D)"]
    #[doc = " @param width Pointer that will hold the width of the framebuffer in pixels."]
    #[doc = " @param height Pointer that will hold the height of the framebuffer in pixels."]
    #[doc = " @return A pointer to the current framebuffer of the chosen screen."]
    #[doc = ""]
    #[doc = " Please remember that the returned pointer will change every frame if double buffering is enabled."]
    pub fn gfxGetFramebuffer(
        screen: gfxScreen_t,
        side: gfx3dSide_t,
        width: *mut u16_,
        height: *mut u16_,
    ) -> *mut u8_;
}
extern "C" {
    #[doc = " @brief Flushes the data cache for the current framebuffers."]
    #[doc = " @warning This is **only used during software rendering**. Since this function has significant overhead,"]
    #[doc = "          it is preferred to call this only once per frame, after all software rendering is completed."]
    pub fn gfxFlushBuffers();
}
extern "C" {
    #[doc = " @brief Updates the configuration of the specified screen, swapping the buffers if double buffering is enabled."]
    #[doc = " @param scr Screen ID (see \\ref gfxScreen_t)"]
    #[doc = " @param hasStereo For the top screen in 3D mode: true if the framebuffer contains individual images"]
    #[doc = "                  for both eyes, or false if the left image should be duplicated to the right eye."]
    #[doc = " @note Previously rendered content will be displayed on the screen after the next VBlank."]
    #[doc = " @note This function is still useful even if double buffering is disabled, as it must be used to commit configuration changes."]
    #[doc = " @warning Only call this once per screen per frame, otherwise graphical glitches will occur"]
    #[doc = "          since this API does not implement triple buffering."]
    pub fn gfxScreenSwapBuffers(scr: gfxScreen_t, hasStereo: bool);
}
extern "C" {
    #[doc = " @brief Same as \\ref gfxScreenSwapBuffers, but with hasStereo set to true."]
    #[doc = " @param scr Screen ID (see \\ref gfxScreen_t)"]
    #[doc = " @param immediate This parameter no longer has any effect and is thus ignored."]
    #[doc = " @deprecated This function has been superseded by \\ref gfxScreenSwapBuffers, please use that instead."]
    pub fn gfxConfigScreen(scr: gfxScreen_t, immediate: bool);
}
extern "C" {
    #[doc = " @brief Updates the configuration of both screens."]
    #[doc = " @note This function is equivalent to: \\code gfxScreenSwapBuffers(GFX_TOP,true); gfxScreenSwapBuffers(GFX_BOTTOM,true); \\endcode"]
    pub fn gfxSwapBuffers();
}
extern "C" {
    #[doc = " Same as \\ref gfxSwapBuffers (formerly different)."]
    pub fn gfxSwapBuffersGpu();
}
#[doc = " A callback for printing a character."]
pub type ConsolePrint = crate::option::Option<
    unsafe extern "C" fn(con: *mut crate::os::raw::c_void, c: crate::os::raw::c_int) -> bool,
>;
#[doc = " A font struct for the console."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConsoleFont {
    #[doc = "< A pointer to the font graphics"]
    pub gfx: *mut u8_,
    #[doc = "< Offset to the first valid character in the font table"]
    pub asciiOffset: u16_,
    #[doc = "< Number of characters in the font graphics"]
    pub numChars: u16_,
}
#[test]
fn bindgen_test_layout_ConsoleFont() {
    assert_eq!(
        crate::mem::size_of::<ConsoleFont>(),
        8usize,
        concat!("Size of: ", stringify!(ConsoleFont))
    );
    assert_eq!(
        crate::mem::align_of::<ConsoleFont>(),
        4usize,
        concat!("Alignment of ", stringify!(ConsoleFont))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ConsoleFont>())).gfx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConsoleFont),
            "::",
            stringify!(gfx)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ConsoleFont>())).asciiOffset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConsoleFont),
            "::",
            stringify!(asciiOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<ConsoleFont>())).numChars as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ConsoleFont),
            "::",
            stringify!(numChars)
        )
    );
}
#[doc = " @brief Console structure used to store the state of a console render context."]
#[doc = ""]
#[doc = " Default values from consoleGetDefault();"]
#[doc = " @code"]
#[doc = " PrintConsole defaultConsole ="]
#[doc = " {"]
#[doc = " \t//Font:"]
#[doc = " \t{"]
#[doc = " \t\t(u8*)default_font_bin, //font gfx"]
#[doc = " \t\t0, //first ascii character in the set"]
#[doc = " \t\t128, //number of characters in the font set"]
#[doc = "\t},"]
#[doc = "\t0,0, //cursorX cursorY"]
#[doc = "\t0,0, //prevcursorX prevcursorY"]
#[doc = "\t40, //console width"]
#[doc = "\t30, //console height"]
#[doc = "\t0,  //window x"]
#[doc = "\t0,  //window y"]
#[doc = "\t32, //window width"]
#[doc = "\t24, //window height"]
#[doc = "\t3, //tab size"]
#[doc = "\t0, //font character offset"]
#[doc = "\t0,  //print callback"]
#[doc = "\tfalse //console initialized"]
#[doc = " };"]
#[doc = " @endcode"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PrintConsole {
    #[doc = "< Font of the console"]
    pub font: ConsoleFont,
    #[doc = "< Framebuffer address"]
    pub frameBuffer: *mut u16_,
    #[doc = "< Current X location of the cursor (as a tile offset by default)"]
    pub cursorX: crate::os::raw::c_int,
    #[doc = "< Current Y location of the cursor (as a tile offset by default)"]
    pub cursorY: crate::os::raw::c_int,
    #[doc = "< Internal state"]
    pub prevCursorX: crate::os::raw::c_int,
    #[doc = "< Internal state"]
    pub prevCursorY: crate::os::raw::c_int,
    #[doc = "< Width of the console hardware layer in characters"]
    pub consoleWidth: crate::os::raw::c_int,
    #[doc = "< Height of the console hardware layer in characters"]
    pub consoleHeight: crate::os::raw::c_int,
    #[doc = "< Window X location in characters (not implemented)"]
    pub windowX: crate::os::raw::c_int,
    #[doc = "< Window Y location in characters (not implemented)"]
    pub windowY: crate::os::raw::c_int,
    #[doc = "< Window width in characters (not implemented)"]
    pub windowWidth: crate::os::raw::c_int,
    #[doc = "< Window height in characters (not implemented)"]
    pub windowHeight: crate::os::raw::c_int,
    #[doc = "< Size of a tab"]
    pub tabSize: crate::os::raw::c_int,
    #[doc = "< Foreground color"]
    pub fg: crate::os::raw::c_int,
    #[doc = "< Background color"]
    pub bg: crate::os::raw::c_int,
    #[doc = "< Reverse/bright flags"]
    pub flags: crate::os::raw::c_int,
    #[doc = "< Callback for printing a character. Should return true if it has handled rendering the graphics (else the print engine will attempt to render via tiles)."]
    pub PrintChar: ConsolePrint,
    #[doc = "< True if the console is initialized"]
    pub consoleInitialised: bool,
}
#[test]
fn bindgen_test_layout_PrintConsole() {
    assert_eq!(
        crate::mem::size_of::<PrintConsole>(),
        76usize,
        concat!("Size of: ", stringify!(PrintConsole))
    );
    assert_eq!(
        crate::mem::align_of::<PrintConsole>(),
        4usize,
        concat!("Alignment of ", stringify!(PrintConsole))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).font as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(font)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).frameBuffer as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(frameBuffer)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).cursorX as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(cursorX)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).cursorY as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(cursorY)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).prevCursorX as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(prevCursorX)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).prevCursorY as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(prevCursorY)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).consoleWidth as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(consoleWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).consoleHeight as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(consoleHeight)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).windowX as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(windowX)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).windowY as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(windowY)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).windowWidth as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(windowWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).windowHeight as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(windowHeight)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).tabSize as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(tabSize)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).fg as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(fg)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).bg as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(bg)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).flags as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).PrintChar as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(PrintChar)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<PrintConsole>())).consoleInitialised as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PrintConsole),
            "::",
            stringify!(consoleInitialised)
        )
    );
}
#[doc = "< Swallows prints to stderr"]
pub const debugDevice_debugDevice_NULL: debugDevice = 0;
#[doc = "< Outputs stderr debug statements using svcOutputDebugString, which can then be captured by interactive debuggers"]
pub const debugDevice_debugDevice_SVC: debugDevice = 1;
#[doc = "< Directs stderr debug statements to 3DS console window"]
pub const debugDevice_debugDevice_CONSOLE: debugDevice = 2;
pub const debugDevice_debugDevice_3DMOO: debugDevice = 1;
#[doc = " Console debug devices supported by libnds."]
pub type debugDevice = crate::os::raw::c_uint;
extern "C" {
    #[doc = " @brief Loads the font into the console."]
    #[doc = " @param console Pointer to the console to update, if NULL it will update the current console."]
    #[doc = " @param font The font to load."]
    pub fn consoleSetFont(console: *mut PrintConsole, font: *mut ConsoleFont);
}
extern "C" {
    #[doc = " @brief Sets the print window."]
    #[doc = " @param console Console to set, if NULL it will set the current console window."]
    #[doc = " @param x X location of the window."]
    #[doc = " @param y Y location of the window."]
    #[doc = " @param width Width of the window."]
    #[doc = " @param height Height of the window."]
    pub fn consoleSetWindow(
        console: *mut PrintConsole,
        x: crate::os::raw::c_int,
        y: crate::os::raw::c_int,
        width: crate::os::raw::c_int,
        height: crate::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " @brief Gets a pointer to the console with the default values."]
    #[doc = " This should only be used when using a single console or without changing the console that is returned, otherwise use consoleInit()."]
    #[doc = " @return A pointer to the console with the default values."]
    pub fn consoleGetDefault() -> *mut PrintConsole;
}
extern "C" {
    #[doc = " @brief Make the specified console the render target."]
    #[doc = " @param console A pointer to the console struct (must have been initialized with consoleInit(PrintConsole* console))."]
    #[doc = " @return A pointer to the previous console."]
    pub fn consoleSelect(console: *mut PrintConsole) -> *mut PrintConsole;
}
extern "C" {
    #[doc = " @brief Initialise the console."]
    #[doc = " @param screen The screen to use for the console."]
    #[doc = " @param console A pointer to the console data to initialize (if it's NULL, the default console will be used)."]
    #[doc = " @return A pointer to the current console."]
    pub fn consoleInit(screen: gfxScreen_t, console: *mut PrintConsole) -> *mut PrintConsole;
}
extern "C" {
    #[doc = " @brief Initializes debug console output on stderr to the specified device."]
    #[doc = " @param device The debug device (or devices) to output debug print statements to."]
    pub fn consoleDebugInit(device: debugDevice);
}
extern "C" {
    #[doc = " Clears the screen by using iprintf(\"\\x1b[2J\");"]
    pub fn consoleClear();
}
#[doc = "< Use APT workaround."]
pub const RUNFLAG_APTWORKAROUND: crate::os::raw::c_uint = 1;
#[doc = "< Reinitialize APT."]
pub const RUNFLAG_APTREINIT: crate::os::raw::c_uint = 2;
#[doc = "< Chainload APT on return."]
pub const RUNFLAG_APTCHAINLOAD: crate::os::raw::c_uint = 4;
#[doc = " System run-flags."]
pub type _bindgen_ty_9 = crate::os::raw::c_uint;
extern "C" {
    #[doc = " @brief Retrieves a handle from the environment handle list."]
    #[doc = " @param name Name of the handle."]
    #[doc = " @return The retrieved handle."]
    pub fn envGetHandle(name: *const crate::os::raw::c_char) -> Handle;
}
pub type _off_t = __int64_t;
pub type _fpos_t = __int64_t;
pub type __ino_t = __uint32_t;
pub type __dev_t = __uint32_t;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = __intptr_t;
pub type wint_t = crate::os::raw::c_uint;
pub type __blkcnt_t = crate::os::raw::c_long;
pub type __blksize_t = crate::os::raw::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type __pid_t = crate::os::raw::c_int;
pub type __uid_t = crate::os::raw::c_ushort;
pub type __gid_t = crate::os::raw::c_ushort;
pub type __id_t = __uint32_t;
pub type __mode_t = __uint32_t;
pub type _off64_t = crate::os::raw::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = crate::os::raw::c_long;
pub type __size_t = crate::os::raw::c_uint;
pub type _ssize_t = crate::os::raw::c_int;
pub type __ssize_t = _ssize_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _mbstate_t {
    pub __count: crate::os::raw::c_int,
    pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _mbstate_t__bindgen_ty_1 {
    pub __wch: wint_t,
    pub __wchb: [crate::os::raw::c_uchar; 4usize],
}
#[test]
fn bindgen_test_layout__mbstate_t__bindgen_ty_1() {
    assert_eq!(
        crate::mem::size_of::<_mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        crate::mem::align_of::<_mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<_mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<_mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout__mbstate_t() {
    assert_eq!(
        crate::mem::size_of::<_mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(_mbstate_t))
    );
    assert_eq!(
        crate::mem::align_of::<_mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<_mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<_mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
pub type _iconv_t = *mut crate::os::raw::c_void;
pub type __clock_t = crate::os::raw::c_ulong;
pub type __time_t = __int_least64_t;
pub type __clockid_t = crate::os::raw::c_ulong;
pub type __timer_t = crate::os::raw::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nl_item = crate::os::raw::c_int;
pub type __nlink_t = crate::os::raw::c_ushort;
pub type __suseconds_t = crate::os::raw::c_long;
pub type __useconds_t = crate::os::raw::c_ulong;
pub type __sigset_t = crate::os::raw::c_ulong;
pub type suseconds_t = __suseconds_t;
pub type time_t = __int_least64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        crate::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        crate::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: crate::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        crate::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        crate::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        crate::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        crate::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
pub type sigset_t = __sigset_t;
pub type fd_mask = crate::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _types_fd_set {
    pub fds_bits: [fd_mask; 2usize],
}
#[test]
fn bindgen_test_layout__types_fd_set() {
    assert_eq!(
        crate::mem::size_of::<_types_fd_set>(),
        8usize,
        concat!("Size of: ", stringify!(_types_fd_set))
    );
    assert_eq!(
        crate::mem::align_of::<_types_fd_set>(),
        4usize,
        concat!("Alignment of ", stringify!(_types_fd_set))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<_types_fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_types_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
extern "C" {
    pub fn select(
        __n: crate::os::raw::c_int,
        __readfds: *mut _types_fd_set,
        __writefds: *mut _types_fd_set,
        __exceptfds: *mut _types_fd_set,
        __timeout: *mut timeval,
    ) -> crate::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __n: crate::os::raw::c_int,
        __readfds: *mut _types_fd_set,
        __writefds: *mut _types_fd_set,
        __exceptfds: *mut _types_fd_set,
        __timeout: *const timespec,
        __set: *const sigset_t,
    ) -> crate::os::raw::c_int;
}
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type u_register_t = __uintptr_t;
pub type u_char = crate::os::raw::c_uchar;
pub type u_short = crate::os::raw::c_ushort;
pub type u_int = crate::os::raw::c_uint;
pub type u_long = crate::os::raw::c_ulong;
pub type ushort = crate::os::raw::c_ushort;
pub type uint = crate::os::raw::c_uint;
pub type ulong = crate::os::raw::c_ulong;
pub type blkcnt_t = __blkcnt_t;
pub type blksize_t = __blksize_t;
pub type clock_t = crate::os::raw::c_ulong;
pub type daddr_t = crate::os::raw::c_long;
pub type caddr_t = *mut crate::os::raw::c_char;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type off_t = __off_t;
pub type dev_t = __dev_t;
pub type uid_t = __uid_t;
pub type gid_t = __gid_t;
pub type pid_t = __pid_t;
pub type key_t = __key_t;
pub type ssize_t = _ssize_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type sbintime_t = __int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: crate::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    assert_eq!(
        crate::mem::size_of::<sched_param>(),
        4usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        crate::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<sched_param>())).sched_priority as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
}
pub type pthread_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_attr_t {
    pub is_initialized: crate::os::raw::c_int,
    pub stackaddr: *mut crate::os::raw::c_void,
    pub stacksize: crate::os::raw::c_int,
    pub contentionscope: crate::os::raw::c_int,
    pub inheritsched: crate::os::raw::c_int,
    pub schedpolicy: crate::os::raw::c_int,
    pub schedparam: sched_param,
    pub detachstate: crate::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        crate::mem::size_of::<pthread_attr_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        crate::mem::align_of::<pthread_attr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_attr_t>())).is_initialized as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_attr_t>())).stackaddr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stackaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_attr_t>())).stacksize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stacksize)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_attr_t>())).contentionscope as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(contentionscope)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_attr_t>())).inheritsched as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(inheritsched)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_attr_t>())).schedpolicy as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(schedpolicy)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_attr_t>())).schedparam as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(schedparam)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_attr_t>())).detachstate as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(detachstate)
        )
    );
}
pub type pthread_mutex_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutexattr_t {
    pub is_initialized: crate::os::raw::c_int,
    pub recursive: crate::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        crate::mem::size_of::<pthread_mutexattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        crate::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<pthread_mutexattr_t>())).is_initialized as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_mutexattr_t>())).recursive as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(recursive)
        )
    );
}
pub type pthread_cond_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_condattr_t {
    pub is_initialized: crate::os::raw::c_int,
    pub clock: clock_t,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        crate::mem::size_of::<pthread_condattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        crate::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(crate::ptr::null::<pthread_condattr_t>())).is_initialized as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_condattr_t>())).clock as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(clock)
        )
    );
}
pub type pthread_key_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_once_t {
    pub is_initialized: crate::os::raw::c_int,
    pub init_executed: crate::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_once_t() {
    assert_eq!(
        crate::mem::size_of::<pthread_once_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_once_t))
    );
    assert_eq!(
        crate::mem::align_of::<pthread_once_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_once_t))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_once_t>())).is_initialized as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_once_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<pthread_once_t>())).init_executed as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_once_t),
            "::",
            stringify!(init_executed)
        )
    );
}
#[doc = "< Dummy compression"]
pub const decompressType_DECOMPRESS_DUMMY: decompressType = 0;
#[doc = "< LZSS/LZ10 compression"]
pub const decompressType_DECOMPRESS_LZSS: decompressType = 16;
#[doc = "< LZSS/LZ10 compression"]
pub const decompressType_DECOMPRESS_LZ10: decompressType = 16;
#[doc = "< LZ11 compression"]
pub const decompressType_DECOMPRESS_LZ11: decompressType = 17;
#[doc = "< Huffman compression with 1-bit data"]
pub const decompressType_DECOMPRESS_HUFF1: decompressType = 33;
#[doc = "< Huffman compression with 2-bit data"]
pub const decompressType_DECOMPRESS_HUFF2: decompressType = 34;
#[doc = "< Huffman compression with 3-bit data"]
pub const decompressType_DECOMPRESS_HUFF3: decompressType = 35;
#[doc = "< Huffman compression with 4-bit data"]
pub const decompressType_DECOMPRESS_HUFF4: decompressType = 36;
#[doc = "< Huffman compression with 5-bit data"]
pub const decompressType_DECOMPRESS_HUFF5: decompressType = 37;
#[doc = "< Huffman compression with 6-bit data"]
pub const decompressType_DECOMPRESS_HUFF6: decompressType = 38;
#[doc = "< Huffman compression with 7-bit data"]
pub const decompressType_DECOMPRESS_HUFF7: decompressType = 39;
#[doc = "< Huffman compression with 8-bit data"]
pub const decompressType_DECOMPRESS_HUFF8: decompressType = 40;
#[doc = "< Huffman compression with 8-bit data"]
pub const decompressType_DECOMPRESS_HUFF: decompressType = 40;
#[doc = "< Run-length encoding compression"]
pub const decompressType_DECOMPRESS_RLE: decompressType = 48;
#[doc = " @brief Compression types"]
pub type decompressType = crate::os::raw::c_uint;
#[doc = " @brief I/O vector"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct decompressIOVec {
    #[doc = "< I/O buffer"]
    pub data: *mut crate::os::raw::c_void,
    #[doc = "< Buffer size"]
    pub size: size_t,
}
#[test]
fn bindgen_test_layout_decompressIOVec() {
    assert_eq!(
        crate::mem::size_of::<decompressIOVec>(),
        8usize,
        concat!("Size of: ", stringify!(decompressIOVec))
    );
    assert_eq!(
        crate::mem::align_of::<decompressIOVec>(),
        4usize,
        concat!("Alignment of ", stringify!(decompressIOVec))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<decompressIOVec>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(decompressIOVec),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<decompressIOVec>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(decompressIOVec),
            "::",
            stringify!(size)
        )
    );
}
#[doc = " @brief Data callback"]
pub type decompressCallback = crate::option::Option<
    unsafe extern "C" fn(
        userdata: *mut crate::os::raw::c_void,
        buffer: *mut crate::os::raw::c_void,
        size: size_t,
    ) -> ssize_t,
>;
extern "C" {
    #[doc = " @brief Decompression callback for file descriptors"]
    #[doc = "  @param[in] userdata Address of file descriptor"]
    #[doc = "  @param[in] buffer   Buffer to write into"]
    #[doc = "  @param[in] size     Size to read from file descriptor"]
    #[doc = "  @returns Number of bytes read"]
    pub fn decompressCallback_FD(
        userdata: *mut crate::os::raw::c_void,
        buffer: *mut crate::os::raw::c_void,
        size: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[doc = " @brief Decompression callback for stdio FILE*"]
    #[doc = "  @param[in] userdata FILE*"]
    #[doc = "  @param[in] buffer   Buffer to write into"]
    #[doc = "  @param[in] size     Size to read from file descriptor"]
    #[doc = "  @returns Number of bytes read"]
    pub fn decompressCallback_Stdio(
        userdata: *mut crate::os::raw::c_void,
        buffer: *mut crate::os::raw::c_void,
        size: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[doc = " @brief Decode decompression header"]
    #[doc = "  @param[out] type     Decompression type"]
    #[doc = "  @param[out] size     Decompressed size"]
    #[doc = "  @param[in]  callback Data callback (see decompressV())"]
    #[doc = "  @param[in]  userdata User data passed to callback (see decompressV())"]
    #[doc = "  @param[in]  insize   Size of userdata (see decompressV())"]
    #[doc = "  @returns Bytes consumed"]
    #[doc = "  @retval -1 error"]
    pub fn decompressHeader(
        type_: *mut decompressType,
        size: *mut size_t,
        callback: decompressCallback,
        userdata: *mut crate::os::raw::c_void,
        insize: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[doc = " @brief Decompress data"]
    #[doc = "  @param[in] iov      Output vector"]
    #[doc = "  @param[in] iovcnt   Number of buffers"]
    #[doc = "  @param[in] callback Data callback (see note)"]
    #[doc = "  @param[in] userdata User data passed to callback (see note)"]
    #[doc = "  @param[in] insize   Size of userdata (see note)"]
    #[doc = "  @returns Whether succeeded"]
    #[doc = ""]
    #[doc = "  @note If callback is null, userdata is a pointer to memory to read from,"]
    #[doc = "        and insize is the size of that data. If callback is not null,"]
    #[doc = "        userdata is passed to callback to fetch more data, and insize is"]
    #[doc = "        unused."]
    pub fn decompressV(
        iov: *const decompressIOVec,
        iovcnt: size_t,
        callback: decompressCallback,
        userdata: *mut crate::os::raw::c_void,
        insize: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Decompress LZSS/LZ10"]
    #[doc = "  @param[in] iov      Output vector"]
    #[doc = "  @param[in] iovcnt   Number of buffers"]
    #[doc = "  @param[in] callback Data callback (see decompressV())"]
    #[doc = "  @param[in] userdata User data passed to callback (see decompressV())"]
    #[doc = "  @param[in] insize   Size of userdata (see decompressV())"]
    #[doc = "  @returns Whether succeeded"]
    pub fn decompressV_LZSS(
        iov: *const decompressIOVec,
        iovcnt: size_t,
        callback: decompressCallback,
        userdata: *mut crate::os::raw::c_void,
        insize: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Decompress LZ11"]
    #[doc = "  @param[in] iov      Output vector"]
    #[doc = "  @param[in] iovcnt   Number of buffers"]
    #[doc = "  @param[in] callback Data callback (see decompressV())"]
    #[doc = "  @param[in] userdata User data passed to callback (see decompressV())"]
    #[doc = "  @param[in] insize   Size of userdata (see decompressV())"]
    #[doc = "  @returns Whether succeeded"]
    pub fn decompressV_LZ11(
        iov: *const decompressIOVec,
        iovcnt: size_t,
        callback: decompressCallback,
        userdata: *mut crate::os::raw::c_void,
        insize: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Decompress Huffman"]
    #[doc = "  @param[in] bits     Data size in bits (usually 4 or 8)"]
    #[doc = "  @param[in] iov      Output vector"]
    #[doc = "  @param[in] iovcnt   Number of buffers"]
    #[doc = "  @param[in] callback Data callback (see decompressV())"]
    #[doc = "  @param[in] userdata User data passed to callback (see decompressV())"]
    #[doc = "  @param[in] insize   Size of userdata (see decompressV())"]
    #[doc = "  @returns Whether succeeded"]
    pub fn decompressV_Huff(
        bits: size_t,
        iov: *const decompressIOVec,
        iovcnt: size_t,
        callback: decompressCallback,
        userdata: *mut crate::os::raw::c_void,
        insize: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Decompress run-length encoding"]
    #[doc = "  @param[in] iov      Output vector"]
    #[doc = "  @param[in] iovcnt   Number of buffers"]
    #[doc = "  @param[in] callback Data callback (see decompressV())"]
    #[doc = "  @param[in] userdata User data passed to callback (see decompressV())"]
    #[doc = "  @param[in] insize   Size of userdata (see decompressV())"]
    #[doc = "  @returns Whether succeeded"]
    pub fn decompressV_RLE(
        iov: *const decompressIOVec,
        iovcnt: size_t,
        callback: decompressCallback,
        userdata: *mut crate::os::raw::c_void,
        insize: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Convert a UTF-8 sequence into a UTF-32 codepoint"]
    #[doc = ""]
    #[doc = "  @param[out] out Output codepoint"]
    #[doc = "  @param[in]  in  Input sequence"]
    #[doc = ""]
    #[doc = "  @returns number of input code units consumed"]
    #[doc = "  @returns -1 for error"]
    pub fn decode_utf8(out: *mut u32, in_: *const u8) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-16 sequence into a UTF-32 codepoint"]
    #[doc = ""]
    #[doc = "  @param[out] out Output codepoint"]
    #[doc = "  @param[in]  in  Input sequence"]
    #[doc = ""]
    #[doc = "  @returns number of input code units consumed"]
    #[doc = "  @returns -1 for error"]
    pub fn decode_utf16(out: *mut u32, in_: *const u16) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-32 codepoint into a UTF-8 sequence"]
    #[doc = ""]
    #[doc = "  @param[out] out Output sequence"]
    #[doc = "  @param[in]  in  Input codepoint"]
    #[doc = ""]
    #[doc = "  @returns number of output code units produced"]
    #[doc = "  @returns -1 for error"]
    #[doc = ""]
    #[doc = "  @note \\a out must be able to store 4 code units"]
    pub fn encode_utf8(out: *mut u8, in_: u32) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-32 codepoint into a UTF-16 sequence"]
    #[doc = ""]
    #[doc = "  @param[out] out Output sequence"]
    #[doc = "  @param[in]  in  Input codepoint"]
    #[doc = ""]
    #[doc = "  @returns number of output code units produced"]
    #[doc = "  @returns -1 for error"]
    #[doc = ""]
    #[doc = "  @note \\a out must be able to store 2 code units"]
    pub fn encode_utf16(out: *mut u16, in_: u32) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-8 sequence into a UTF-16 sequence"]
    #[doc = ""]
    #[doc = "  Fills the output buffer up to \\a len code units."]
    #[doc = "  Returns the number of code units that the input would produce;"]
    #[doc = "  if it returns greater than \\a len, the output has been"]
    #[doc = "  truncated."]
    #[doc = ""]
    #[doc = "  @param[out] out Output sequence"]
    #[doc = "  @param[in]  in  Input sequence (null-terminated)"]
    #[doc = "  @param[in]  len Output length"]
    #[doc = ""]
    #[doc = "  @returns number of output code units produced"]
    #[doc = "  @returns -1 for error"]
    #[doc = ""]
    #[doc = "  @note \\a out is not null-terminated"]
    pub fn utf8_to_utf16(out: *mut u16, in_: *const u8, len: size_t) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-8 sequence into a UTF-32 sequence"]
    #[doc = ""]
    #[doc = "  Fills the output buffer up to \\a len code units."]
    #[doc = "  Returns the number of code units that the input would produce;"]
    #[doc = "  if it returns greater than \\a len, the output has been"]
    #[doc = "  truncated."]
    #[doc = ""]
    #[doc = "  @param[out] out Output sequence"]
    #[doc = "  @param[in]  in  Input sequence (null-terminated)"]
    #[doc = "  @param[in]  len Output length"]
    #[doc = ""]
    #[doc = "  @returns number of output code units produced"]
    #[doc = "  @returns -1 for error"]
    #[doc = ""]
    #[doc = "  @note \\a out is not null-terminated"]
    pub fn utf8_to_utf32(out: *mut u32, in_: *const u8, len: size_t) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-16 sequence into a UTF-8 sequence"]
    #[doc = ""]
    #[doc = "  Fills the output buffer up to \\a len code units."]
    #[doc = "  Returns the number of code units that the input would produce;"]
    #[doc = "  if it returns greater than \\a len, the output has been"]
    #[doc = "  truncated."]
    #[doc = ""]
    #[doc = "  @param[out] out Output sequence"]
    #[doc = "  @param[in]  in  Input sequence (null-terminated)"]
    #[doc = "  @param[in]  len Output length"]
    #[doc = ""]
    #[doc = "  @returns number of output code units produced"]
    #[doc = "  @returns -1 for error"]
    #[doc = ""]
    #[doc = "  @note \\a out is not null-terminated"]
    pub fn utf16_to_utf8(out: *mut u8, in_: *const u16, len: size_t) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-16 sequence into a UTF-32 sequence"]
    #[doc = ""]
    #[doc = "  Fills the output buffer up to \\a len code units."]
    #[doc = "  Returns the number of code units that the input would produce;"]
    #[doc = "  if it returns greater than \\a len, the output has been"]
    #[doc = "  truncated."]
    #[doc = ""]
    #[doc = "  @param[out] out Output sequence"]
    #[doc = "  @param[in]  in  Input sequence (null-terminated)"]
    #[doc = "  @param[in]  len Output length"]
    #[doc = ""]
    #[doc = "  @returns number of output code units produced"]
    #[doc = "  @returns -1 for error"]
    #[doc = ""]
    #[doc = "  @note \\a out is not null-terminated"]
    pub fn utf16_to_utf32(out: *mut u32, in_: *const u16, len: size_t) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-32 sequence into a UTF-8 sequence"]
    #[doc = ""]
    #[doc = "  Fills the output buffer up to \\a len code units."]
    #[doc = "  Returns the number of code units that the input would produce;"]
    #[doc = "  if it returns greater than \\a len, the output has been"]
    #[doc = "  truncated."]
    #[doc = ""]
    #[doc = "  @param[out] out Output sequence"]
    #[doc = "  @param[in]  in  Input sequence (null-terminated)"]
    #[doc = "  @param[in]  len Output length"]
    #[doc = ""]
    #[doc = "  @returns number of output code units produced"]
    #[doc = "  @returns -1 for error"]
    #[doc = ""]
    #[doc = "  @note \\a out is not null-terminated"]
    pub fn utf32_to_utf8(out: *mut u8, in_: *const u32, len: size_t) -> ssize_t;
}
extern "C" {
    #[doc = " Convert a UTF-32 sequence into a UTF-16 sequence"]
    #[doc = ""]
    #[doc = "  @param[out] out Output sequence"]
    #[doc = "  @param[in]  in  Input sequence (null-terminated)"]
    #[doc = "  @param[in]  len Output length"]
    #[doc = ""]
    #[doc = "  @returns number of output code units produced"]
    #[doc = "  @returns -1 for error"]
    #[doc = ""]
    #[doc = "  @note \\a out is not null-terminated"]
    pub fn utf32_to_utf16(out: *mut u16, in_: *const u32, len: size_t) -> ssize_t;
}
extern "C" {
    #[doc = " @brief Allocates a 0x80-byte aligned buffer."]
    #[doc = " @param size Size of the buffer to allocate."]
    #[doc = " @return The allocated buffer."]
    pub fn linearAlloc(size: size_t) -> *mut crate::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief Allocates a buffer aligned to the given size."]
    #[doc = " @param size Size of the buffer to allocate."]
    #[doc = " @param alignment Alignment to use."]
    #[doc = " @return The allocated buffer."]
    pub fn linearMemAlign(size: size_t, alignment: size_t) -> *mut crate::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief Reallocates a buffer."]
    #[doc = " Note: Not implemented yet."]
    #[doc = " @param mem Buffer to reallocate."]
    #[doc = " @param size Size of the buffer to allocate."]
    #[doc = " @return The reallocated buffer."]
    pub fn linearRealloc(
        mem: *mut crate::os::raw::c_void,
        size: size_t,
    ) -> *mut crate::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief Retrieves the allocated size of a buffer."]
    #[doc = " @return The size of the buffer."]
    pub fn linearGetSize(mem: *mut crate::os::raw::c_void) -> size_t;
}
extern "C" {
    #[doc = " @brief Frees a buffer."]
    #[doc = " @param mem Buffer to free."]
    pub fn linearFree(mem: *mut crate::os::raw::c_void);
}
extern "C" {
    #[doc = " @brief Gets the current linear free space."]
    #[doc = " @return The current linear free space."]
    pub fn linearSpaceFree() -> u32_;
}
extern "C" {
    #[doc = " @brief Initializes the mappable allocator."]
    #[doc = " @param addrMin Minimum address."]
    #[doc = " @param addrMax Maxium address."]
    pub fn mappableInit(addrMin: u32_, addrMax: u32_);
}
extern "C" {
    #[doc = " @brief Finds a mappable memory area."]
    #[doc = " @param size Size of the area to find."]
    #[doc = " @return The mappable area."]
    pub fn mappableAlloc(size: size_t) -> *mut crate::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief Frees a mappable area (stubbed)."]
    #[doc = " @param mem Mappable area to free."]
    pub fn mappableFree(mem: *mut crate::os::raw::c_void);
}
extern "C" {
    #[doc = " @brief Allocates a 0x80-byte aligned buffer."]
    #[doc = " @param size Size of the buffer to allocate."]
    #[doc = " @return The allocated buffer."]
    pub fn vramAlloc(size: size_t) -> *mut crate::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief Allocates a buffer aligned to the given size."]
    #[doc = " @param size Size of the buffer to allocate."]
    #[doc = " @param alignment Alignment to use."]
    #[doc = " @return The allocated buffer."]
    pub fn vramMemAlign(size: size_t, alignment: size_t) -> *mut crate::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief Reallocates a buffer."]
    #[doc = " Note: Not implemented yet."]
    #[doc = " @param mem Buffer to reallocate."]
    #[doc = " @param size Size of the buffer to allocate."]
    #[doc = " @return The reallocated buffer."]
    pub fn vramRealloc(
        mem: *mut crate::os::raw::c_void,
        size: size_t,
    ) -> *mut crate::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief Retrieves the allocated size of a buffer."]
    #[doc = " @return The size of the buffer."]
    pub fn vramGetSize(mem: *mut crate::os::raw::c_void) -> size_t;
}
extern "C" {
    #[doc = " @brief Frees a buffer."]
    #[doc = " @param mem Buffer to free."]
    pub fn vramFree(mem: *mut crate::os::raw::c_void);
}
extern "C" {
    #[doc = " @brief Gets the current VRAM free space."]
    #[doc = " @return The current VRAM free space."]
    pub fn vramSpaceFree() -> u32_;
}
#[doc = "< Open authentication."]
pub const acSecurityMode_AC_OPEN: acSecurityMode = 0;
#[doc = "< WEP 40-bit authentication."]
pub const acSecurityMode_AC_WEP_40BIT: acSecurityMode = 1;
#[doc = "< WEP 104-bit authentication."]
pub const acSecurityMode_AC_WEP_104BIT: acSecurityMode = 2;
#[doc = "< WEP 128-bit authentication."]
pub const acSecurityMode_AC_WEP_128BIT: acSecurityMode = 3;
#[doc = "< WPA TKIP authentication."]
pub const acSecurityMode_AC_WPA_TKIP: acSecurityMode = 4;
#[doc = "< WPA2 TKIP authentication."]
pub const acSecurityMode_AC_WPA2_TKIP: acSecurityMode = 5;
#[doc = "< WPA AES authentication."]
pub const acSecurityMode_AC_WPA_AES: acSecurityMode = 6;
#[doc = "< WPA2 AES authentication."]
pub const acSecurityMode_AC_WPA2_AES: acSecurityMode = 7;
#[doc = " Wifi security modes."]
pub type acSecurityMode = crate::os::raw::c_uint;
#[doc = " Struct to contain the data for connecting to a Wifi network from a stored slot."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct acuConfig {
    pub reserved: [u8_; 512usize],
}
#[test]
fn bindgen_test_layout_acuConfig() {
    assert_eq!(
        crate::mem::size_of::<acuConfig>(),
        512usize,
        concat!("Size of: ", stringify!(acuConfig))
    );
    assert_eq!(
        crate::mem::align_of::<acuConfig>(),
        1usize,
        concat!("Alignment of ", stringify!(acuConfig))
    );
    assert_eq!(
        unsafe { &(*(crate::ptr::null::<acuConfig>())).reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(acuConfig),
            "::",
            stringify!(reserved)
        )
    );
}
extern "C" {
    #[doc = " Initializes AC."]
    pub fn acInit() -> Result;
}
extern "C" {
    #[doc = " Exits AC."]
    pub fn acExit();
}
extern "C" {
    #[doc = " Waits for the system to connect to the internet."]
    pub fn acWaitInternetConnection() -> Result;
}
extern "C" {
    #[doc = " @brief Gets the connected Wifi status."]
    #[doc = " @param out Pointer to output the connected Wifi status to. (0 = not connected, 1 = O3DS Internet, 2 = N3DS Internet)"]
    pub fn ACU_GetWifiStatus(out: *mut u32_) -> Result;
}
extern "C" {
    #[doc = " @brief Gets the connected Wifi status."]
    #[doc = " @param out Pointer to output the connected Wifi status to. (1 = not connected, 3 = connected)"]
    pub fn ACU_GetStatus(out: *mut u32_) -> Result;
}
extern "C" {
